[
    {
        "desc_split": "In venture capital, the <graph> captures co-investment relationships between firms, where 1 denotes shared investments in startups and 0 indicates no joint funding history. The challenge is to uncover the largest group of firms that consistently invest together, highlighting strong alliances that drive market trends or signal high-value opportunities.",
        "label": "maxclique",
        "index": 87
    },
    {
        "desc_split": "A blockchain network’s validator nodes (<num_nodes> total) form <graph>, with edges denoting mutual dependencies. Choosing an MIS of validators guarantees no two selected nodes can collude, enhancing transaction validation fairness and security in decentralized ledgers.",
        "label": "mis",
        "index": 7
    },
    {
        "desc_split": "A logistics company uses <graph> to map delivery hubs, where edges indicate airspace overlap. Activating a maximal independent set of hubs allows simultaneous drone launches without collision risks, optimizing delivery throughput in high-demand regions.",
        "label": "mis",
        "index": 68
    },
    {
        "desc_split": "For an event venue modeled as <graph> with <num_nodes> stages and <num_edges> attendee pathways between them, security teams must oversee all foot traffic. Optimal checkpoint placement at a minimal number of stages guarantees full crowd movement coverage without redundant staffing.",
        "label": "mvc",
        "index": 47
    },
    {
        "desc_split": "A social media platform uses <graph> with <num_nodes> users and <num_edges> interaction edges (e.g., likes, shares). Splitting users into two groups to maximize interactions *between* groups ensures diverse content exposure while minimizing echo chambers within each partition.",
        "label": "maxcut",
        "index": 56
    },
    {
        "desc_split": "For a power grid <graph> with <num_nodes> energy nodes (solar/wind farms) and <num_edges> transmission lines, splitting the grid into two zones to maximize cross-zone connections ensures stable energy distribution when one zone faces intermittent generation (e.g., cloudy/windless conditions).",
        "label": "maxcut",
        "index": 97
    },
    {
        "desc_split": "A misinformation detection network uses <graph> to represent <num_nodes> news sources and <num_edges> shared ownership or bias links. To maximize unbiased verification, an MIS selects independent sources for cross-referencing facts, preventing coordinated false narratives from skewing results.",
        "label": "mis",
        "index": 56
    },
    {
        "desc_split": "In criminal investigations, the <graph> represents associations between suspects, where 1 indicates a confirmed collaboration (e.g., joint operations or communications) and 0 denotes no known link. The objective is to uncover the largest group of individuals who have all worked together, aiding law enforcement in identifying core criminal factions for targeted disruption.",
        "label": "maxclique",
        "index": 10
    },
    {
        "desc_split": "Geologists map mining sites as <graph> with <num_nodes> locations and <num_edges> environmental overlap risks (e.g., shared watersheds). An MIS identifies non-adjacent sites for simultaneous extraction, minimizing ecological damage while maintaining production efficiency.",
        "label": "mis",
        "index": 57
    },
    {
        "desc_split": "In an urban area modeled as <graph> with <num_nodes> noise sensors and <num_edges> connections between adjacent zones, authorities aim to deploy monitoring devices at key locations. By selecting the smallest set of nodes where each zone boundary is covered, the system ensures comprehensive noise pollution tracking while minimizing equipment costs.",
        "label": "mvc",
        "index": 75
    },
    {
        "desc_split": "For urban infrastructure, <graph> represents crossroads connectivity, with 1 showing physically intersecting streets and 0 denoting separate flow paths. The goal is to identify the largest group of junctions requiring coordinated timing plans to optimize city-wide vehicle movement efficiency with zero latency conflicts.",
        "label": "maxclique",
        "index": 59
    },
    {
        "desc_split": "A city’s drone delivery network is modeled as <graph>, where nodes are potential charging stations and edges are flight paths. To ensure drones never run out of power, planners must select the minimal set of stations to build, covering all routes while reducing infrastructure expenses.",
        "label": "mvc",
        "index": 98
    },
    {
        "desc_split": "Law enforcement maps a dark web marketplace as <graph>, where nodes are vendors and edges are transaction links. To dismantle the network, they must infiltrate the fewest possible vendors to expose all illegal trades. The MVC solution optimizes undercover operations by covering all edges with minimal nodes.",
        "label": "mvc",
        "index": 88
    },
    {
        "desc_split": "For holographic tech, the <graph> tracks light interference between pixel pairs (1) or their independence (0). Identifying the largest interference-free pixel group enables optimal display configurations that prevent image distortion.",
        "label": "maxclique",
        "index": 70
    },
    {
        "desc_split": "A satellite network <graph> with <num_nodes> satellites and <num_edges> interference links requires an MIS to schedule communication windows. Selected satellites transmit data without signal clashes, maximizing bandwidth usage across orbital paths.",
        "label": "mis",
        "index": 37
    },
    {
        "desc_split": "A fact-checking platform uses a network of contributors represented by <graph> with <num_nodes> nodes and <num_edges> edges. To prevent bias, contributors with conflicting interests (e.g., shared affiliations) cannot verify the same story. An MIS ensures independent, unbiased fact-checking teams.",
        "label": "mis",
        "index": 62
    },
    {
        "desc_split": "In the music industry, the <graph> flags collaborations between artists (1) or lack thereof (0). Analyzing the largest fully-linked artist group uncovers genre-defining cliques, shedding light on creative hubs that shape musical trends.",
        "label": "maxclique",
        "index": 7
    },
    {
        "desc_split": "A financial transaction network <graph> with <num_nodes> accounts and <num_edges> suspicious transactions can be split into two groups to maximize flagged transactions between them. This helps isolate potential laundering pathways while reducing false positives within each group.",
        "label": "maxcut",
        "index": 96
    },
    {
        "desc_split": "In an organized crime network <graph> with <num_nodes> suspects and <num_edges> communications, law enforcement aims to surveil key individuals to intercept all interactions. The MVC approach determines the smallest group of suspects to monitor, ensuring no communication goes undetected.",
        "label": "mvc",
        "index": 27
    },
    {
        "desc_split": "In federated learning, a coordinator must choose devices (<graph> with <num_nodes> clients and <num_edges> shared data risks) to train a global model. An MIS ensures no two selected devices have overlapping sensitive data, preserving privacy while maximizing participation diversity.",
        "label": "mis",
        "index": 54
    },
    {
        "desc_split": "A content delivery network (CDN) uses <graph> to model edge servers (<num_nodes>) and their latency-dependent overlaps (<num_edges>). To optimize cache updates, an MIS of servers is selected to synchronize data without redundancy, reducing bandwidth strain while maintaining coverage.",
        "label": "mis",
        "index": 53
    },
    {
        "desc_split": "A highway system is modeled as <graph>, where exits are nodes and road segments are edges. To ensure rapid emergency response, authorities must place patrol units at exits such that every road segment is covered by at least one unit. The goal is to minimize the number of patrol stations while ensuring full coverage of the highway network (<num_nodes> nodes, <num_edges> edges).",
        "label": "mvc",
        "index": 30
    },
    {
        "desc_split": "A logistics network for temperature-sensitive vaccines is modeled as <graph>, where nodes are storage facilities and edges are transport routes. Auditors must verify that all routes comply with cold chain protocols. Choosing the minimal set of facilities to inspect ensures every transport link is covered, reducing costs while maintaining compliance.",
        "label": "mvc",
        "index": 66
    },
    {
        "desc_split": "For ecosystem modeling, the <graph> outlines predator-prey relationships, where 1 signifies a confirmed predation link and 0 no direct interaction. The challenge is to detect the largest group of species sustaining each other through mutual predation, highlighting stable subsystems prone to cascading collapses if disturbed.",
        "label": "maxclique",
        "index": 50
    },
    {
        "desc_split": "A graph <graph> represents <num_nodes> voting districts and <num_edges> shared boundaries where electoral fraud could occur. Authorities need to deploy observers to the smallest set of districts to monitor all adjacent boundaries, guaranteeing fair elections with minimal resources.",
        "label": "mvc",
        "index": 12
    },
    {
        "desc_split": "In vehicle manufacturing, the <graph> defines compatibility between components, where 1 indicates a validated fit and 0 denotes incompatibility. Locating the largest group of mutually compatible parts ensures seamless assembly, reducing production bottlenecks and warranty claims.",
        "label": "maxclique",
        "index": 67
    },
    {
        "desc_split": "In Hollywood filmmaking, the <graph> encodes on-screen chemistry between actors, where 1 reflects positive audience reception of paired performances and 0 shows untested combinations. Identifying the maximal ensemble of performers with proven mutual appeal allows studios to minimize casting risks for blockbuster sequels.",
        "label": "maxclique",
        "index": 89
    },
    {
        "desc_split": "In a federated learning system with <num_nodes> devices and <num_edges> communication dependencies (e.g., shared routers), a coordinator must select devices for model training such that no two selected devices exchange data indirectly. This prevents privacy leaks and biases in distributed AI training.",
        "label": "mis",
        "index": 78
    },
    {
        "desc_split": "In e-commerce analytics, the <graph> captures product co-purchases, where 1 indicates frequent joint purchases and 0 no significant correlation. Detecting the largest group of products consistently bought together helps retailers optimize bundling strategies and cross-promotions.",
        "label": "maxclique",
        "index": 37
    },
    {
        "desc_split": "In a peer-to-peer file storage network represented by <graph> with <num_nodes> nodes and <num_edges> edges, nodes must be selected to store redundant copies of files without overlapping coverage. An MIS ensures that no two storage nodes are directly connected, maximizing fault tolerance while minimizing redundant data placement.",
        "label": "mis",
        "index": 0
    },
    {
        "desc_split": "An educational platform models student interactions as <graph>, where nodes are students and edges indicate collaborative engagement. By splitting students into two groups (<num_nodes> learners) to maximize cross-group interactions, educators can foster diverse peer learning while maintaining cohesive small-group dynamics (<num_edges> connections).",
        "label": "maxcut",
        "index": 26
    },
    {
        "desc_split": "In the fashion industry, the <graph> captures mutual endorsements between influencers, where 1 reflects consistent collaboration on trends and 0 indicates no shared influence. Finding the largest group of interconnected trendsetters reveals dominant stylistic coalitions, allowing brands to target cohesive marketing campaigns effectively.",
        "label": "maxclique",
        "index": 44
    },
    {
        "desc_split": "A collaboration network <graph> of <num_nodes> researchers and <num_edges> co-authorship links requires assigning reviewers to papers without conflicts of interest. By selecting an independent set of reviewers, the process ensures unbiased evaluations while maximizing the pool of eligible experts.",
        "label": "mis",
        "index": 19
    },
    {
        "desc_split": "For a drone swarm <graph> with <num_nodes> drones and <num_edges> proximity-based collision risks, splitting drones into two flight paths to maximize inter-path proximity edges reduces mid-air collision risks while maintaining coverage efficiency.",
        "label": "maxcut",
        "index": 33
    },
    {
        "desc_split": "In a legal system represented as <graph>, nodes are court cases and edges denote shared legal precedents or conflicting rulings. Splitting cases into two dockets (<num_nodes> nodes, <num_edges> edges) to maximize precedent-based conflicts between dockets ensures balanced judicial workloads while minimizing contradictory rulings within the same docket.",
        "label": "maxcut",
        "index": 76
    },
    {
        "desc_split": "In a transportation network represented as <graph>, where nodes are pickup/drop-off locations and edges represent high-demand routes, partitioning the locations into two zones to maximize the number of high-demand routes between them ensures efficient ride-sharing pairings and reduces empty vehicle miles. <num_nodes> locations and <num_edges> routes are analyzed to optimize fleet utilization.",
        "label": "maxcut",
        "index": 65
    },
    {
        "desc_split": "A city’s road network <graph> has <num_nodes> intersections as nodes and <num_edges> high-congestion roads as edges. Dividing intersections into two zones to maximize cross-zone congestion edges allows planners to prioritize alternate routes, easing traffic within each zone.",
        "label": "maxcut",
        "index": 8
    },
    {
        "desc_split": "For airline alliances, the <graph> displays flight connectivity between airports, with 1 marking direct routes and 0 indicating no direct flights. Operators seek the largest set of airports where every pair connects directly, enabling efficient hub-and-spoke systems that maximize passenger throughput while minimizing layovers.",
        "label": "maxclique",
        "index": 1
    },
    {
        "desc_split": "In a federated learning system represented by <graph> with <num_nodes> nodes and <num_edges> edges, a subset of devices must be chosen to train local AI models without overlapping data dependencies. Selecting an MIS ensures diverse, non-redundant training while minimizing communication overhead between connected devices.",
        "label": "mis",
        "index": 25
    },
    {
        "desc_split": "A tournament fixture graph <graph> with <num_nodes> teams and <num_edges> matches requires referees for oversight. Assigning referees to the fewest teams ensures every match has at least one officiating team, optimizing resource allocation for large-scale events.",
        "label": "mvc",
        "index": 42
    },
    {
        "desc_split": "In robotics, the <graph> represents communication links between autonomous drones, where 1 indicates a stable communication channel and 0 denotes the lack of a direct link. The challenge is to determine the largest group of drones that can all communicate with one another seamlessly, ensuring optimal coordination for tasks like search-and-rescue or surveillance missions.",
        "label": "maxclique",
        "index": 27
    },
    {
        "desc_split": "For holographic displays, the <graph> flags interference between pixels, where 1 means overlapping wavelengths and 0 no interference. Detecting the largest fully interfering pixel cluster ensures precise calibration to avoid visual artifacts and maintain image fidelity.",
        "label": "maxclique",
        "index": 79
    },
    {
        "desc_split": "Within the fashion industry, the <graph> captures co-endorsement relationships between influencers, with 1 signifying mutual promotion (e.g., cross-brand partnerships) and 0 indicating no collaborative history. The goal is to detect the largest clique of influencers who all support one another, highlighting dominant trendsetting circles that drive market behavior.",
        "label": "maxclique",
        "index": 11
    },
    {
        "desc_split": "Political strategists utilize the <graph> to map policy alignment between candidates, where 1 represents shared stances on key issues and 0 indicates divergence. Identifying the maximum cohort of candidates with complete mutual alignment allows parties to craft unified campaign messages while exposing potential coalition opportunities come election time.",
        "label": "maxclique",
        "index": 99
    },
    {
        "desc_split": "A music similarity graph <graph> links <num_nodes> songs via <num_edges> shared acoustic features. Maximizing edges between two partitions creates hybrid playlists where songs *within* each group are cohesive, but the *inter-group* contrast introduces creative diversity.",
        "label": "maxcut",
        "index": 59
    },
    {
        "desc_split": "A port's shipping lanes form <graph>, where nodes are docking points and edges are navigation paths. To prevent collisions, autonomous ships must be monitored at key points. The MVC solution identifies the smallest set of checkpoints where observers can track all ship movements efficiently.",
        "label": "mvc",
        "index": 86
    },
    {
        "desc_split": "In blockchain analysis, the <graph> represents transactional relationships between wallet addresses, where 1 indicates a direct transfer between wallets and 0 means no recorded interaction. The task is to uncover the largest group of wallets that have all transacted with each other, potentially exposing coordinated trading rings or illicit financial networks that regulators may investigate.",
        "label": "maxclique",
        "index": 0
    },
    {
        "desc_split": "A network of hospitals (<graph>) collaborates on a clinical trial, where nodes represent facilities and edges denote patient transfer routes. To ensure all patient movements are tracked, the trial coordinator must choose the fewest hospitals to host monitoring teams, guaranteeing complete coverage of transfer pathways.",
        "label": "mvc",
        "index": 56
    },
    {
        "desc_split": "In a marine ecosystem graph <graph>, nodes are fishing zones and edges represent species migration routes. Partitioning zones into two protected/unprotected sets (<num_nodes> nodes, <num_edges> edges) to maximize migration edges between sets helps preserve biodiversity while allowing regulated fishing in one group.",
        "label": "maxcut",
        "index": 77
    },
    {
        "desc_split": "A satellite network <graph> with <num_nodes> satellites and <num_edges> interference links requires a subset of satellites to transmit data simultaneously without signal clashes. Selecting an MIS guarantees maximal non-conflicting communication bandwidth.",
        "label": "mis",
        "index": 48
    },
    {
        "desc_split": "Miners in a blockchain network (<graph> with <num_nodes> participants) must form non-colluding pools to prevent centralization. A maximal independent set of miners ensures no two pools are directly connected, maintaining network security and fair reward distribution.",
        "label": "mis",
        "index": 22
    },
    {
        "desc_split": "In insurance investigations, the <graph> represents suspicious connections between claimants, with 1 indicating shared attributes like phone numbers or addresses and 0 no discernible link. The task is to uncover the largest group of claimants all interconnected through these suspicious ties, which may expose orchestrated fraud rings costing millions.",
        "label": "maxclique",
        "index": 47
    },
    {
        "desc_split": "Ecologists model animal habitats as <graph>, where nodes represent zones and edges indicate overlapping territories. A maximal independent set of zones ensures conservation efforts target non-adjacent areas, preventing overpopulation stress while maximizing protected biodiversity across <num_nodes> regions.",
        "label": "mis",
        "index": 6
    },
    {
        "desc_split": "In telecommunications infrastructure planning, the <graph> represents interference between base stations, with 1 signifying overlapping frequency conflicts and 0 no interference. Identifying the largest interference-free cluster of stations enables optimal spectrum allocation to minimize signal degradation across urban networks.",
        "label": "maxclique",
        "index": 93
    },
    {
        "desc_split": "In a federated learning system with <num_nodes> devices and <num_edges> data dependency links (e.g., shared users), a coordinator must select devices for training rounds such that no two selected devices share sensitive data overlaps. This preserves privacy while maximizing participant diversity.",
        "label": "mis",
        "index": 88
    },
    {
        "desc_split": "A federated learning system employs a trust graph <graph> (<num_nodes> devices, <num_edges> data-sharing relationships). To prevent biased model updates, a subset of devices must be chosen such that no two selected devices have shared sensitive data, ensuring decentralized and fair training.",
        "label": "mis",
        "index": 98
    },
    {
        "desc_split": "In an organized crime network <graph>, individuals are <num_nodes> nodes and communication links are <num_edges> edges. Law enforcement can partition the network into two groups to maximize inter-group communication, isolating key factions and destabilizing the network’s operational efficiency.",
        "label": "maxcut",
        "index": 12
    },
    {
        "desc_split": "A factory's robotic network is modeled as <graph> with <num_nodes> robots and <num_edges> communication links. To detect malfunctions, engineers must place diagnostic tools on a subset of robots. The MVC problem ensures every interaction is monitored while minimizing the number of equipped robots.",
        "label": "mvc",
        "index": 87
    },
    {
        "desc_split": "In an urban area represented as <graph> with <num_nodes> noise sensors and <num_edges> connections between adjacent zones, authorities aim to deploy the fewest sensors possible to ensure all noise-polluted corridors are monitored. The MVC solution identifies optimal sensor placements to cover every zone boundary while minimizing equipment costs.",
        "label": "mvc",
        "index": 70
    },
    {
        "desc_split": "In a community contact network <graph> with <num_nodes> individuals and <num_edges> interactions, health officials aim to vaccinate the smallest group of people to block disease transmission. By selecting a minimal vertex cover, every interaction involves at least one vaccinated individual, ensuring efficient herd immunity.",
        "label": "mvc",
        "index": 10
    },
    {
        "desc_split": "In a smart city, surveillance cameras are placed at key locations represented by <graph> with <num_nodes> nodes and <num_edges> edges. To optimize energy usage and avoid redundant coverage, cameras must be activated such that no two adjacent cameras are on simultaneously, while ensuring maximal area coverage.",
        "label": "mis",
        "index": 60
    },
    {
        "desc_split": "For multiplayer gaming platforms, the <graph> tracks player compatibility metrics, with 1 denoting successful past collaborations and 0 representing no team history. The challenge is to assemble the largest possible guild where all members have proven synergy, maximizing competitive performance.",
        "label": "maxclique",
        "index": 55
    },
    {
        "desc_split": "Maritime traffic controllers model ship routes as <graph>, where edges denote collision risks between vessels. By selecting a maximal independent set of ships to navigate simultaneously, collisions are avoided while maximizing throughput in busy shipping lanes.",
        "label": "mis",
        "index": 63
    },
    {
        "desc_split": "In a warehouse graph <graph> with <num_nodes> robotic shelves and <num_edges> collision zones, an MIS determines which shelves can be restocked concurrently by autonomous robots. This avoids physical bottlenecks and speeds up inventory replenishment.",
        "label": "mis",
        "index": 38
    },
    {
        "desc_split": "A logistics network <graph> includes <num_nodes> hubs and <num_edges> proximity edges where simultaneous drone launches could cause collisions. Activating a maximal independent set of hubs allows parallel deliveries without airspace conflicts, optimizing throughput and safety.",
        "label": "mis",
        "index": 84
    },
    {
        "desc_split": "A forest area’s visibility graph <graph> has <num_nodes> potential watchtower sites and <num_edges> lines of sight between them. Rangers must select the fewest towers to ensure every area is visible, maximizing fire detection coverage while minimizing construction costs.",
        "label": "mvc",
        "index": 29
    },
    {
        "desc_split": "A turbine network <graph> with <num_nodes> turbines and <num_edges> underwater cable connections requires preventive inspections. Selecting a minimal turbine set for technician visits ensures all interconnecting cables are checked, optimizing helicopter deployment costs in remote locations.  \n```  \n\nEach scenario embeds the required <graph>, <num_nodes>, and <num_edges> tags while introducing novel contexts like event logistics, AI training, and renewable energy maintenance. The descriptions emphasize the trade-off between coverage and resource minimization characteristic of MVC problems.",
        "label": "mvc",
        "index": 49
    },
    {
        "desc_split": "In an event planning scenario modeled as <graph>, attendees are represented as <num_nodes> nodes, and edges (totaling <num_edges>) denote social compatibility or shared interests. Partitioning attendees into two seating sections to maximize cross-section interactions ensures lively discussions while minimizing intra-section monotony, enhancing networking opportunities.",
        "label": "maxcut",
        "index": 45
    },
    {
        "desc_split": "In a knowledge graph <graph> with <num_nodes> concepts and <num_edges> semantic relationships, annotators must label core concepts to infer all connections. Identifying the smallest set of concepts to manually tag allows comprehensive automated relationship derivation while minimizing human effort.",
        "label": "mvc",
        "index": 48
    },
    {
        "desc_split": "In national security, the <graph> maps suspected communication between operatives (1 for confirmed contacts and 0 for no observed links). Finding the maximum interconnected agent cell exposes potential infiltration rings that require immediate counter-surveillance measures.",
        "label": "maxclique",
        "index": 86
    },
    {
        "desc_split": "A city’s road intersection network is modeled as <graph> with <num_nodes> intersections and <num_edges> roads. To optimize traffic flow, sensors must be installed at intersections to monitor all roads. The MVC problem finds the smallest set of intersections to equip, ensuring every road is observed without redundant sensors.",
        "label": "mvc",
        "index": 18
    },
    {
        "desc_split": "In judicial analytics, the <graph> tracks citation relationships between rulings, where 1 signals direct precedent reliance and 0 no citation. Finding the maximal set of mutually citing cases reveals foundational legal doctrines that shape entire jurisprudence branches.",
        "label": "maxclique",
        "index": 34
    },
    {
        "desc_split": "A fleet of surveillance drones operates over a region partitioned into zones (<graph>), where edges indicate overlapping sensor ranges. To avoid redundant data collection, a maximal independent set of zones must be selected for drone deployment, ensuring full coverage without interference.",
        "label": "mis",
        "index": 51
    },
    {
        "desc_split": "In a region’s transportation network modeled as <graph> with <num_nodes> locations and <num_edges> routes, aid agencies must position relief hubs to ensure all routes are serviced. Selecting the smallest set of hubs guarantees that every road or path is accessible from at least one distribution point, optimizing resource deployment during emergencies.",
        "label": "mvc",
        "index": 25
    },
    {
        "desc_split": "In drug development, the <graph> indicates safe pairwise interactions between medications (1 for safe, 0 for risky). Identifying the maximal group of drugs without adverse interactions enables the design of complex, safe multi-drug therapies for chronic conditions.",
        "label": "maxclique",
        "index": 21
    },
    {
        "desc_split": "A conference organizer uses an attendee collaboration graph <graph> with <num_nodes> participants and <num_edges> co-author relationships to schedule parallel sessions. An MIS groups attendees with no direct collaborations, ensuring fair participation and reducing intellectual property conflicts during presentations.",
        "label": "mis",
        "index": 4
    },
    {
        "desc_split": "In film production, the <graph> maps narrative compatibility between characters across franchises, with 1 denoting logical crossover potential and 0 inconsistent storytelling. Identifying the largest cluster of characters feasibly crossing over maximizes fan engagement while maintaining lore coherence.",
        "label": "maxclique",
        "index": 49
    },
    {
        "desc_split": "In law enforcement intelligence, the <graph> represents communication links between suspected criminals, where 1 indicates confirmed contact and 0 no observed interaction. Investigators seek the largest group where all members communicate directly, potentially uncovering the core leadership structure of illicit networks.",
        "label": "maxclique",
        "index": 54
    },
    {
        "desc_split": "For a satellite network <graph> with <num_nodes> satellites and <num_edges> interference links, ground stations must schedule transmissions to satellites that are not in mutual interference range. A maximal independent set ensures simultaneous, conflict-free data downlinks, optimizing bandwidth usage.",
        "label": "mis",
        "index": 87
    },
    {
        "desc_split": "In federated learning, a central server coordinates training across devices in <graph>, where edges indicate data privacy risks (e.g., shared user demographics). An MIS selects devices for each training round to prevent leakage of correlated data, preserving privacy.",
        "label": "mis",
        "index": 64
    },
    {
        "desc_split": "A constellation of satellites (<graph> with <num_nodes> satellites and <num_edges> overlapping orbits) must capture images of Earth without redundant coverage. An MIS schedules satellites to image distinct regions simultaneously, ensuring global coverage while minimizing resource waste.",
        "label": "mis",
        "index": 14
    },
    {
        "desc_split": "In online auction platforms, the <graph> captures bidding relationships between users, where 1 indicates coordinated bidding behavior and 0 no observed collusion. The task is to uncover the largest group of bidders who systematically interact to manipulate prices, helping platforms enforce fair competition and maintain market integrity.",
        "label": "maxclique",
        "index": 92
    },
    {
        "desc_split": "In digital marketing, the <graph> captures shared consumer interests between demographic segments, where 1 indicates overlapping preferences and 0 no significant overlap. The task is to pinpoint the largest audience group where all segments share mutual interests, enabling hyper-focused campaigns with higher conversion potential.",
        "label": "maxclique",
        "index": 32
    },
    {
        "desc_split": "In an exam proctoring system <graph>, students (nodes) may collaborate via communication channels (edges). To detect cheating, proctors must monitor a minimal group of students covering all potential interactions. The graph has <num_nodes> students and <num_edges> communication links.",
        "label": "mvc",
        "index": 38
    },
    {
        "desc_split": "A power grid modeled as <graph> with <num_nodes> microgrids and <num_edges> interconnections requires activation of independent subsets to prevent cascading failures. Selecting a maximal set of non-adjacent microgrids allows stable energy distribution during outages, balancing load and isolation needs.",
        "label": "mis",
        "index": 86
    },
    {
        "desc_split": "A streaming platform’s user interaction graph (<graph>) links viewers (nodes) who share content (edges). To maximize ad reach with minimal impressions, the platform must select the smallest subset of users to display ads, ensuring every shared piece of content is seen by at least one targeted viewer.",
        "label": "mvc",
        "index": 58
    },
    {
        "desc_split": "A retail competition graph <graph> models products as nodes and substitutability relationships as edges. Dividing products into two categories (e.g., premium vs. budget) to maximize substitutable pairs across categories helps retailers optimize pricing strategies. The dataset covers <num_nodes> products and <num_edges> substitutable pairs.",
        "label": "maxcut",
        "index": 2
    },
    {
        "desc_split": "A farmland’s sensor grid is represented as <graph>, where edges indicate overlapping water spray ranges. Activating sprinklers in a maximal independent set (<num_nodes> zones, <num_edges> overlaps) avoids water wastage while ensuring full coverage, optimizing resource use during drought conditions.",
        "label": "mis",
        "index": 21
    },
    {
        "desc_split": "For corporate governance analysis, the <graph> indicates board member overlaps across companies (1 for shared directors, 0 otherwise). Determining the largest fully-interlocked group exposes potential conflict-of-interest networks shaping industry decisions.",
        "label": "maxclique",
        "index": 26
    },
    {
        "desc_split": "In a transportation network modeled as <graph> with <num_nodes> charging stations and <num_edges> connecting routes, planners must ensure that every route has at least one charging station nearby. The goal is to minimize the number of stations while guaranteeing full coverage for electric vehicles.",
        "label": "mvc",
        "index": 50
    },
    {
        "desc_split": "A dark web marketplace’s user interaction graph <graph> has <num_nodes> vendors and <num_edges> transaction links. Law enforcement aims to disrupt the network by arresting the smallest group of vendors such that every transaction chain is broken, maximizing impact with minimal resources.",
        "label": "mvc",
        "index": 99
    },
    {
        "desc_split": "A port’s waterway network is represented as <graph>, where nodes are navigation checkpoints and edges are shipping lanes. To ensure collision-free routing, the port authority must install communication relays at the fewest possible checkpoints such that every lane is within range of at least one relay, optimizing coverage with <num_nodes> nodes and <num_edges> edges.",
        "label": "mvc",
        "index": 76
    },
    {
        "desc_split": "For a blockchain network <graph> with <num_nodes> nodes (validators) and <num_edges> communication links, splitting the network into two shards to maximize cross-shard transactions improves scalability. This ensures parallel processing while minimizing intra-shard congestion.",
        "label": "maxcut",
        "index": 36
    },
    {
        "desc_split": "For urban traffic management, the <graph> reflects intersecting light sequences, with 1 showing synchronizable lights and 0 unsynchronizable pairs. The goal is to find the largest set of traffic lights that can be perfectly coordinated, optimizing flow and reducing congestion citywide.",
        "label": "maxclique",
        "index": 20
    },
    {
        "desc_split": "In a room-occupancy graph <graph>, nodes are rooms and edges represent shared occupancy patterns. Partitioning rooms into two lighting zones to maximize co-usage edges between zones allows adaptive lighting schedules that reduce energy waste while maintaining user comfort. The system monitors <num_nodes> rooms and <num_edges> co-usage relationships.",
        "label": "maxcut",
        "index": 69
    },
    {
        "desc_split": "In a digital communication network <graph> with <num_nodes> devices and <num_edges> connections, investigators must collect data from devices to trace illicit activity. Selecting the minimal set of devices to analyze ensures all communication links are covered, streamlining the forensic process without missing critical evidence.",
        "label": "mvc",
        "index": 68
    },
    {
        "desc_split": "In a transportation network represented as <graph>, where nodes are pickup/drop-off locations and edges indicate frequent ride-sharing demand between them, partitioning the locations into two zones to maximize cross-zone demand ensures efficient matching of riders and drivers while reducing intra-zone congestion. The graph has <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 60
    },
    {
        "desc_split": "Within medicine formulation, the <graph> flags dangerous interactions between drugs, with 1 representing safe co-administration and 0 marking hazardous combinations. Identifying the largest compatible medication bundle is crucial for designing effective yet risk-free multi-drug therapies for complex conditions.",
        "label": "maxclique",
        "index": 53
    },
    {
        "desc_split": "Law enforcement maps a dark web marketplace as <graph>, where nodes are vendors and edges are transactions. To dismantle the network, they must identify the smallest set of vendors to target, ensuring every transaction link is disrupted. With <num_nodes> vendors and <num_edges> transactions, MVC optimizes resource allocation for maximum impact.",
        "label": "mvc",
        "index": 83
    },
    {
        "desc_split": "For genomic research, the <graph> maps co-occurring genetic variants in patient populations, where 1 denotes statistically significant variant pairing and 0 independent occurrence. Discovering the largest interconnected variant group helps pinpoint potential polygenic risk factors for complex hereditary disorders.",
        "label": "maxclique",
        "index": 94
    },
    {
        "desc_split": "In a resource-rich area mapped as <graph> with <num_nodes> potential mining sites and <num_edges> proximity constraints, regulators must approve non-adjacent sites to prevent territorial disputes. An MIS ensures equitable resource extraction while minimizing conflicts among independent miners.",
        "label": "mis",
        "index": 52
    },
    {
        "desc_split": "Geologists must choose mining sites from a resource map represented as <graph>, where nodes are potential sites and edges indicate overlapping environmental impact zones. A maximal independent set ensures selected sites operate without ecological interference, balancing resource extraction and sustainability.",
        "label": "mis",
        "index": 66
    },
    {
        "desc_split": "In a microgrid network <graph>, nodes are energy producers/consumers and edges represent trading potential. Maximizing inter-group energy flows by splitting participants into two markets enhances resilience and price competition while balancing local supply-demand. The graph includes <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 63
    },
    {
        "desc_split": "Conservationists model animal habitats as <graph> (<num_nodes> habitat zones, <num_edges> migration overlaps). A maximal independent set of zones is designated as protected corridors, ensuring no two adjacent zones are overused while maintaining biodiversity connectivity.",
        "label": "mis",
        "index": 99
    },
    {
        "desc_split": "For financial analysts, the <graph> reflects correlation strengths between assets, with 1 representing high synergy (e.g., complementary returns) and 0 weak or negative alignment. Identifying the maximal group of inter-correlated assets assists in constructing diversified yet cohesive portfolios that mitigate risk.",
        "label": "maxclique",
        "index": 13
    },
    {
        "desc_split": "In a co-authorship network <graph> with <num_nodes> researchers and <num_edges> collaborations, funding agencies must monitor research integrity. Selecting a minimal group of researchers to audit ensures all collaborations are reviewed, balancing oversight efficiency with comprehensive coverage.",
        "label": "mvc",
        "index": 19
    },
    {
        "desc_split": "In manufacturing ecosystems, the <graph> tracks compatibility between suppliers' production capabilities, with 1 representing seamless integration potential and 0 incompatibility. Locating the maximal group of mutually compatible suppliers allows corporations to build resilient, just-in-time component procurement networks.",
        "label": "maxclique",
        "index": 95
    },
    {
        "desc_split": "For IoT systems, the <graph> represents sensor communication ranges, with 1 marking mutual detection and 0 no direct signal reach. Finding the largest interconnected sensor cluster ensures robust data redundancy for critical environmental monitoring applications.",
        "label": "maxclique",
        "index": 38
    },
    {
        "desc_split": "An airline route map <graph> with <num_nodes> airports and <num_edges> flight paths requires radar coverage. Strategically placing radar stations at the fewest airports ensures every flight path is observed, reducing infrastructure costs without compromising safety.",
        "label": "mvc",
        "index": 6
    },
    {
        "desc_split": "In a parking lot layout represented as <graph> with <num_nodes> parking spots and <num_edges> connecting lanes, surveillance cameras must cover all vehicle movement paths. By strategically placing cameras at a minimal set of spots, every lane is monitored while reducing installation costs.",
        "label": "mvc",
        "index": 45
    },
    {
        "desc_split": "Within art forensics, the <graph> documents stylistic similarities between masterpieces, with 1 confirming shared techniques/materials and 0 indicating divergence. Pinpointing the largest collection of mutually consistent artworks assists in detecting workshop collaborations or exposing fraudulent attributions in the old masters' market.",
        "label": "maxclique",
        "index": 65
    },
    {
        "desc_split": "Within malware detection, the <graph> documents connections between infected devices, with 1 showing communication during an attack and 0 representing no interaction. Security teams search for the maximal interconnected device cluster to pinpoint botnet command centers, allowing targeted dismantling of coordinated cyberattacks.",
        "label": "maxclique",
        "index": 3
    },
    {
        "desc_split": "In an airline scheduling system represented as <graph> with <num_nodes> crew members and <num_edges> potential pairings, the goal is to partition crews into two groups (e.g., domestic/international) to maximize the number of high-compatibility pairings across groups. This ensures efficient resource allocation while minimizing intra-group scheduling conflicts.",
        "label": "maxcut",
        "index": 85
    },
    {
        "desc_split": "In crowdfunding platforms, the <graph> reflects mutual backing between sponsors (1) or lack thereof (0). Discovering the largest cluster of reciprocally supportive backers reveals influential communities that could drive future campaign virality.",
        "label": "maxclique",
        "index": 69
    },
    {
        "desc_split": "In a heritage site dependency graph <graph>, nodes are artifacts or locations, and edges denote historical or contextual links. Splitting the sites into two preservation tiers to maximize cross-tier dependencies ensures balanced resource allocation, protecting both high-priority and contextually critical assets across <num_nodes> sites and <num_edges> connections.",
        "label": "maxcut",
        "index": 54
    },
    {
        "desc_split": "A vaccine distribution network <graph> with <num_nodes> storage facilities and <num_edges> transport routes requires temperature monitoring. Selecting the smallest set of facilities to audit ensures all transport links between them comply with safety standards, minimizing regulatory overhead.",
        "label": "mvc",
        "index": 46
    },
    {
        "desc_split": "In finance, <graph> tracks co-investment history between firms - 1 indicates prior joint ventures while 0 shows no shared investments. Uncovering the largest consortium of inter-connected investors reveals potential megadeal collaboration opportunities in emerging markets.",
        "label": "maxclique",
        "index": 61
    },
    {
        "desc_split": "A microservices architecture is represented as <graph> with <num_nodes> services and <num_edges> API calls. To secure all inter-service communications, DevOps engineers must deploy API gateways at the minimal number of services, ensuring every call passes through a security checkpoint.",
        "label": "mvc",
        "index": 64
    },
    {
        "desc_split": "In city infrastructure, the <graph> shows direct transit routes between stations (1) or their absence (0). Finding the largest cluster of mutually accessible stations highlights potential superhubs for optimizing commuter flows and reducing transfer delays.",
        "label": "maxclique",
        "index": 9
    },
    {
        "desc_split": "A municipal street grid <graph> contains <num_nodes> streetlights connected by <num_edges> overlapping illumination zones. To conserve energy, a subset of lights must be activated such that no two adjacent lights are on, while still providing sufficient coverage for safe nighttime visibility.",
        "label": "mis",
        "index": 18
    },
    {
        "desc_split": "In swarm robotics, the <graph> defines successful communication links between robots, where 1 confirms stable two-way signaling and 0 marks failed coordination. Determining the maximal interconnected robot subgroup ensures synchronized task execution, vital for missions requiring collective decision-making in dynamic environments.",
        "label": "maxclique",
        "index": 46
    },
    {
        "desc_split": "In a social media platform represented by <graph> with <num_nodes> users and <num_edges> connections, moderators must be selected such that no two moderators are directly linked (to prevent collusion or bias). This ensures fair and independent content review while covering as many user groups as possible.",
        "label": "mis",
        "index": 15
    },
    {
        "desc_split": "In a power distribution network <graph> with <num_nodes> substations and <num_edges> transmission lines, partitioning the grid into two microgrids to maximize inter-microgrid connections allows seamless islanding during failures. This minimizes outages by isolating faults while maintaining energy flow between partitions.",
        "label": "maxcut",
        "index": 19
    },
    {
        "desc_split": "In a financial transaction network represented by <graph> with <num_nodes> accounts and <num_edges> suspicious links, an AI system must flag a set of accounts for investigation such that no two flagged accounts are directly linked. This ensures independent fraud detection while maximizing coverage of potentially fraudulent activity.",
        "label": "mis",
        "index": 40
    },
    {
        "desc_split": "For marketing agencies, the <graph> tracks successful past partnerships between creatives (1 for compatible duos, 0 otherwise). Discovering the largest fully-compatible team ensures flawless campaign execution by grouping professionals with proven collaborative chemistry.",
        "label": "maxclique",
        "index": 22
    },
    {
        "desc_split": "In event planning for music festivals, the <graph> captures artist compatibility, where 1 indicates artists who share fanbases or genres and 0 represents unrelated acts. The goal is to curate the largest group of mutually compatible performers, maximizing audience retention and creating cohesive stage schedules.",
        "label": "maxclique",
        "index": 23
    },
    {
        "desc_split": "A municipal waste management system models trash collection points as <graph>, where edges indicate proximity. By selecting an MIS of collection points, trucks can service non-adjacent locations simultaneously, reducing route conflicts and optimizing fuel efficiency across <num_nodes> nodes and <num_edges> edges.",
        "label": "mis",
        "index": 26
    },
    {
        "desc_split": "A habitat connectivity graph <graph> represents <num_nodes> wildlife zones and <num_edges> migration paths. Conservationists aim to protect the fewest zones while ensuring every migration route is adjacent to at least one protected area, balancing ecological preservation and land use.",
        "label": "mvc",
        "index": 3
    },
    {
        "desc_split": "In a store layout graph <graph>, product categories are <num_nodes> nodes, and edges indicate customer co-purchasing frequency. Partitioning products into two sections to maximize cross-section purchases improves customer flow and increases impulse buys by strategically placing high-interaction items apart.",
        "label": "maxcut",
        "index": 42
    },
    {
        "desc_split": "An art gallery’s lighting system is represented by <graph>, where nodes are exhibits and edges indicate visibility overlaps. Selecting a maximal independent set of exhibits to illuminate ensures no two adjacent artworks compete for attention, optimizing viewer experience while conserving energy.",
        "label": "mis",
        "index": 31
    },
    {
        "desc_split": "A logistics company uses a geographic graph <graph> with <num_nodes> potential drone hubs and <num_edges> overlapping service ranges. To avoid airspace conflicts, hubs must be selected such that no two active hubs are within interference range, enabling parallel deliveries without collisions.",
        "label": "mis",
        "index": 96
    },
    {
        "desc_split": "In cybersecurity operations, the <graph> captures trust relationships between dark web vendors, with 1 representing verified mutual escrow agreements and 0 untrusted parties. Locating the biggest fully trusted vendor collective exposes high-reliability black markets requiring prioritized law enforcement attention.",
        "label": "maxclique",
        "index": 51
    },
    {
        "desc_split": "In an urban area modeled as <graph> with <num_nodes> noise sensors and <num_edges> connections between adjacent zones, authorities aim to deploy the fewest sensors possible to monitor all noise pollution hotspots. By selecting a minimal set of zones, every adjacent area is covered, ensuring comprehensive noise mapping with minimal infrastructure.",
        "label": "mvc",
        "index": 80
    },
    {
        "desc_split": "In a network of security nodes represented by <graph> with <num_nodes> devices and <num_edges> connections, an MIS is used to select a subset of nodes for simultaneous threat scanning. This ensures no two active scanners interfere with each other’s signals while covering the entire network efficiently.",
        "label": "mis",
        "index": 35
    },
    {
        "desc_split": "A border region’s patrol zones are mapped as <graph>, with zones as nodes and adjacent boundaries as edges. Deploying drones at the minimum number of zones ensures every border segment is monitored, optimizing surveillance resources while maintaining security across <num_edges> boundary lines.",
        "label": "mvc",
        "index": 57
    },
    {
        "desc_split": "In a food web <graph> with <num_nodes> species and <num_edges> predator-prey relationships, conservationists must protect the smallest set of species to disrupt all predation links. This ensures ecosystem stability by preventing unchecked population growth or collapse.",
        "label": "mvc",
        "index": 14
    },
    {
        "desc_split": "In a mining region represented by <graph> with <num_nodes> potential sites and <num_edges> environmental conflict zones (e.g., overlapping ecosystems), selecting non-adjacent sites minimizes ecological disruption while maximizing resource extraction efficiency.",
        "label": "mis",
        "index": 92
    },
    {
        "desc_split": "In a highway network represented as <graph> with <num_nodes> exits and <num_edges> connecting roads, emergency response teams must be stationed to ensure rapid access to any segment of the highway. By selecting the smallest set of exit points where teams are deployed, every road segment can be reached quickly, minimizing response time and resource allocation.",
        "label": "mvc",
        "index": 65
    },
    {
        "desc_split": "For music streaming platforms, the <graph> captures compatibility between songs, with 1 denoting a harmonious transition and 0 indicating a mismatch. The aim is to discover the largest subset of songs that all transition smoothly into one another, enabling the creation of flawlessly flowing playlists that enhance listener experience.",
        "label": "maxclique",
        "index": 28
    },
    {
        "desc_split": "In a greenhouse with <num_nodes> plant sections and <num_edges> pest migration routes between them, farmers must place traps at the fewest sections to cover all potential infestations. The MVC solution ensures every route is monitored, reducing pesticide use while protecting crops.",
        "label": "mvc",
        "index": 84
    },
    {
        "desc_split": "Within cybersecurity, the <graph> maps password reuse patterns among breached accounts, with 1 signaling identical credentials shared between users and 0 meaning no overlap. Identifying the largest cluster of interconnected accounts exposed to credential stuffing attacks helps prioritize remediation efforts and mitigate widespread account takeovers.",
        "label": "maxclique",
        "index": 43
    },
    {
        "desc_split": "In a conservation area represented by <graph> with <num_nodes> patrol zones and <num_edges> overlapping surveillance ranges, rangers must select zones to monitor such that no two adjacent zones are patrolled simultaneously. This ensures efficient coverage while avoiding redundant patrols, maximizing deterrence with limited resources.",
        "label": "mis",
        "index": 85
    },
    {
        "desc_split": "For music production, the <graph> marks which samples share copyright ownership overlaps (1) or have no conflicts (0). The task is to pinpoint the largest conflict-free set of samples to avoid legal disputes while maximizing creative reuse in a track.",
        "label": "maxclique",
        "index": 68
    },
    {
        "desc_split": "Conservationists represent habitats as <graph> (<num_nodes> patches, <num_edges> migration paths). Maximizing cut edges when partitioning habitats into two zones ensures species can migrate between zones while minimizing fragmentation within each zone, balancing biodiversity preservation and human land use.",
        "label": "maxcut",
        "index": 27
    },
    {
        "desc_split": "A federated learning network <graph> connects <num_nodes> devices with <num_edges> communication links. To train a global model without leaking sensitive data, a maximal independent set of devices is selected to ensure no two collaborating devices share direct connections, enhancing privacy.",
        "label": "mis",
        "index": 83
    },
    {
        "desc_split": "In a molecular interaction graph <graph> with <num_nodes> compounds and <num_edges> reactive pairs, researchers select an MIS of drugs for combined therapies. This prevents adverse reactions by ensuring no two administered drugs interact directly, improving patient safety.",
        "label": "mis",
        "index": 9
    },
    {
        "desc_split": "For financial institutions, the <graph> captures transactions between accounts, with 1 marking suspicious activity links and 0 legitimate transfers. Detecting the largest group of accounts all linked by fraudulent transactions exposes coordinated scam networks for regulatory action.",
        "label": "maxclique",
        "index": 17
    },
    {
        "desc_split": "In a corporate intranet represented as <graph> with <num_nodes> devices and <num_edges> connections, security analysts must deploy intrusion detection systems (IDS) to monitor all network traffic. By selecting a minimal set of devices to host IDS, every communication path is covered, ensuring threats are detected while minimizing deployment costs.",
        "label": "mvc",
        "index": 15
    },
    {
        "desc_split": "In a medical imaging graph <graph>, pixels or voxels (<num_nodes>) are connected by edges (<num_edges>) based on intensity similarity. Maximizing edges between two partitions helps separate tumor regions from healthy tissue, improving accuracy in diagnostic algorithms and surgical planning.",
        "label": "maxcut",
        "index": 17
    },
    {
        "desc_split": "In a user engagement graph <graph>, nodes are customer segments and edges reflect overlapping interests. Partitioning segments into two groups to maximize cross-group ad exposure ensures diverse targeting, minimizing redundancy while broadening reach in a campaign with <num_nodes> segments and <num_edges> interest overlaps.",
        "label": "maxcut",
        "index": 52
    },
    {
        "desc_split": "A retail store’s shelf network <graph> has <num_nodes> shelves and <num_edges> shared restocking pathways. Selecting non-adjacent shelves for simultaneous restocking prevents robot collisions, ensuring efficient inventory management without workflow interruptions.",
        "label": "mis",
        "index": 94
    },
    {
        "desc_split": "For a content moderation network <graph>, nodes are moderators and edges indicate overlapping expertise. Dividing moderators into two teams (<num_nodes> nodes, <num_edges> edges) to maximize expertise-sharing edges between teams ensures diverse perspectives in reviewing contentious posts while reducing echo chambers.",
        "label": "maxcut",
        "index": 78
    },
    {
        "desc_split": "In a smart city parking system modeled as <graph> with <num_nodes> parking spots and <num_edges> proximity conflicts, an algorithm must select a set of non-adjacent spots to reserve for incoming vehicles. This ensures parked cars do not block each other’s access lanes, optimizing space utilization and reducing congestion.",
        "label": "mis",
        "index": 55
    },
    {
        "desc_split": "In a biomedical graph <graph>, nodes represent <num_nodes> drugs and protein targets, while edges denote interactions. Partitioning them into two sets to maximize cross-set interactions helps identify optimal drug combinations that avoid overlapping mechanisms, reducing side effects.",
        "label": "maxcut",
        "index": 7
    },
    {
        "desc_split": "In a network vulnerability graph <graph>, devices are <num_nodes> nodes, and edges represent exploitable pathways. Dividing devices into two isolated subnetworks to maximize the number of severed attack paths minimizes the risk of lateral movement during a breach, enhancing overall security.",
        "label": "maxcut",
        "index": 43
    },
    {
        "desc_split": "In a farmland graph <graph> with <num_nodes> plots and <num_edges> shared pest/disease risks, partitioning plots into two crop groups to maximize risk edges between groups minimizes intra-group contamination, reducing the need for pesticides while maintaining yield diversity.",
        "label": "maxcut",
        "index": 84
    },
    {
        "desc_split": "In a bipartite <graph> linking <num_nodes> advertisers to <num_nodes> audience segments via <num_edges> engagement metrics, partitioning both sets to maximize cross-group edges creates non-overlapping ad campaigns, reducing audience fatigue and improving reach efficiency.",
        "label": "maxcut",
        "index": 98
    },
    {
        "desc_split": "A brand partnership graph <graph> models <num_nodes> influencers and <num_edges> collaborations (e.g., co-promotions). To maximize reach with minimal budget, marketers select the smallest set of influencers such that every collaboration involves at least one chosen influencer, ensuring full campaign coverage.",
        "label": "mvc",
        "index": 2
    },
    {
        "desc_split": "In a university campus represented as <graph> with <num_nodes> buildings and <num_edges> power connections, administrators must deploy energy monitors to track electricity flow. Selecting the smallest set of buildings to install sensors ensures all power lines are monitored while minimizing equipment costs.",
        "label": "mvc",
        "index": 60
    },
    {
        "desc_split": "A power grid modeled as <graph> with <num_nodes> solar farms and <num_edges> transmission dependencies requires selecting a subset of farms to activate simultaneously without overloading shared infrastructure. The MIS ensures energy distribution stability while avoiding cascading failures.",
        "label": "mis",
        "index": 41
    },
    {
        "desc_split": "In a player compatibility graph <graph> with <num_nodes> gamers and <num_edges> skill/playstyle synergies, splitting players into two matchmaking pools (e.g., casual/competitive) to maximize inter-pool edges creates balanced cross-play lobbies, enhancing engagement without sacrificing fairness.",
        "label": "maxcut",
        "index": 88
    },
    {
        "desc_split": "A retail store’s shelf layout is represented as <graph>, where nodes are shelves and edges indicate adjacency. To monitor stock levels efficiently, sensors must be placed on the fewest shelves possible while ensuring every adjacent pair is observed. This reduces costs while maintaining inventory accuracy.",
        "label": "mvc",
        "index": 51
    },
    {
        "desc_split": "For a ride-sharing demand graph <graph>, nodes are geographic zones and edges reflect high trip demand between zones. Splitting zones into two pricing tiers to maximize demand across tiers allows surge pricing to target high-traffic corridors, optimizing revenue while balancing supply in <num_nodes> zones and <num_edges> demand links.",
        "label": "maxcut",
        "index": 21
    },
    {
        "desc_split": "For space agencies, the <graph> tracks proximity alerts between orbiting satellites, where 1 represents a potential collision risk and 0 signifies safe separation. Detecting the largest group of mutually at-risk satellites allows for preemptive maneuvers to avoid cascading collisions in congested orbital zones.",
        "label": "maxclique",
        "index": 31
    },
    {
        "desc_split": "In an urban traffic network modeled as <graph>, intersections are <num_nodes> nodes and roads are <num_edges> edges. By partitioning intersections into two groups to maximize the number of roads connecting them, traffic engineers can optimize signal timing to reduce congestion and improve flow between zones.",
        "label": "maxcut",
        "index": 90
    },
    {
        "desc_split": "In a wildlife reserve represented by <graph> with <num_nodes> patrol zones and <num_edges> overlapping surveillance ranges, rangers must select zones to monitor such that no two adjacent zones are patrolled simultaneously. This ensures optimal coverage while minimizing redundant patrols, deterring poachers effectively.",
        "label": "mis",
        "index": 45
    },
    {
        "desc_split": "In a cybercrime investigation, a communication network <graph> links <num_nodes> suspects via <num_edges> recorded interactions. Investigators must subpoena the minimal set of suspects to guarantee access to all communications, ensuring legal efficiency without overlooking critical evidence.",
        "label": "mvc",
        "index": 62
    },
    {
        "desc_split": "A historical site’s artifact proximity graph <graph> with <num_nodes> artifacts and <num_edges> proximity relationships needs guarding. Placing sensors on the minimal number of artifacts ensures all proximity pairs are monitored against theft, balancing security and budget constraints.",
        "label": "mvc",
        "index": 9
    },
    {
        "desc_split": "For industrial robotics, the <graph> defines compatibility between robots tasked with collaborative operations, where 1 means two robots can effectively work together and 0 denotes incompatibility. The challenge lies in determining the largest group of robots capable of seamless mutual cooperation, maximizing efficiency in complex assembly line scenarios.",
        "label": "maxclique",
        "index": 97
    },
    {
        "desc_split": "In a logistics network represented as <graph> with <num_nodes> warehouses and <num_edges> shipment routes, partitioning the warehouses into two groups to maximize the number of routes between them ensures redundancy. This minimizes disruption risks if one group faces delays or failures, improving overall supply chain resilience.",
        "label": "maxcut",
        "index": 25
    },
    {
        "desc_split": "In a geological fault network modeled as <graph>, nodes represent potential sensor sites and edges indicate fault line connections. By splitting the sites into two sets to maximize the number of monitored fault segments, seismologists can optimize early-warning coverage across a region with <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 51
    },
    {
        "desc_split": "A tournament organizer uses a competitor graph <graph> with <num_nodes> teams and <num_edges> rivalry edges (e.g., frequent past matches). Scheduling matches for teams in an MIS guarantees no two rivals play simultaneously, maximizing viewership diversity and reducing fan fatigue.",
        "label": "mis",
        "index": 34
    },
    {
        "desc_split": "For biochemistry studies, the <graph> outlines enzymatic reactions between metabolites, with 1 representing direct catalytic relationships and 0 showing no biochemical interaction. Locating the largest fully reactive metabolite cluster uncovers critical pathway hubs, informing drug targeting strategies for metabolic disorders.",
        "label": "maxclique",
        "index": 45
    },
    {
        "desc_split": "For a warehouse grid <graph> where nodes are storage zones and edges represent high-frequency robot traffic routes (<num_nodes> zones, <num_edges> routes), splitting zones into two groups to maximize inter-group traffic minimizes congestion within each zone, improving robotic picker efficiency.",
        "label": "maxcut",
        "index": 83
    },
    {
        "desc_split": "In a transportation network represented as <graph>, where nodes are pickup/drop-off locations and edges represent high-demand routes, partitioning the locations into two zones to maximize inter-zone demand ensures efficient ride-sharing pairings. This reduces empty vehicle miles and improves service coverage in a city with <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 50
    },
    {
        "desc_split": "For competitive online gaming, the <graph> tracks player compatibility, with 1 representing successful past collaborations and 0 denoting no prior teamwork. The aim is to assemble the largest possible squad where every member synergizes perfectly, maximizing in-game performance and strategic cohesion.",
        "label": "maxclique",
        "index": 88
    },
    {
        "desc_split": "For epidemiological modeling, the <graph> represents infection transmission likelihoods between individuals, where 1 implies high contagion risk and 0 no expected transmission. Isolating the largest interconnected group of potential spreaders enables preemptive quarantine measures to contain outbreak epicenters efficiently.",
        "label": "maxclique",
        "index": 66
    },
    {
        "desc_split": "When investigating compromised credentials, the <graph> shows shared password patterns across accounts (1) versus unique passwords (0). Identifying the largest cluster of accounts with identical leaked credentials reveals systemic security vulnerabilities requiring immediate remediation.",
        "label": "maxclique",
        "index": 24
    },
    {
        "desc_split": "In a city's transportation network modeled as <graph>, nodes represent high-demand zones and edges indicate frequent ride transitions between zones. By partitioning the zones into two pricing groups (<num_nodes> nodes, <num_edges> edges) to maximize cross-group transitions, operators can implement dynamic pricing strategies that optimize driver allocation and reduce wait times.",
        "label": "maxcut",
        "index": 75
    },
    {
        "desc_split": "Conservationists model animal habitats as <graph> with <num_nodes> zones and <num_edges> migration path overlaps. Selecting a maximal independent set of zones for wildlife corridors prevents territorial conflicts among species while maximizing protected area coverage.",
        "label": "mis",
        "index": 67
    },
    {
        "desc_split": "In a blockchain transaction graph <graph>, nodes represent wallets and edges denote transactions. To detect fraudulent activity, auditors must verify a minimal set of wallets such that every transaction is linked to at least one verified wallet. This reduces verification costs while maintaining trust in the network (<num_nodes> nodes, <num_edges> edges).",
        "label": "mvc",
        "index": 31
    },
    {
        "desc_split": "In a covert transaction network <graph> with <num_nodes> users and <num_edges> deals, law enforcement aims to infiltrate the fewest accounts to monitor all illegal exchanges. Selecting a vertex cover guarantees every transaction is observed, maximizing disruption efficiency.",
        "label": "mvc",
        "index": 78
    },
    {
        "desc_split": "A factory’s robot collaboration network is modeled as <graph>, with <num_nodes> robots and <num_edges> interaction dependencies. To preemptively detect failures, engineers must select a minimal set of robots to embed diagnostic sensors, ensuring every interaction is monitored without redundant data collection.",
        "label": "mvc",
        "index": 82
    },
    {
        "desc_split": "A port’s waterway network is represented as <graph>, where nodes are navigation checkpoints and edges are shipping lanes. To ensure collision-free routing, the port authority must install monitoring systems at the fewest checkpoints such that every lane is observed. This minimizes costs while maintaining safety across <num_edges> critical paths.",
        "label": "mvc",
        "index": 81
    },
    {
        "desc_split": "In an astronaut compatibility graph <graph>, nodes are crew candidates and edges represent skill synergies. Partitioning candidates into two mission teams (<num_nodes> nodes, <num_edges> edges) to maximize skill complementarity across teams optimizes resource utilization (e.g., splitting medical/engineering experts) for long-duration missions.",
        "label": "maxcut",
        "index": 79
    },
    {
        "desc_split": "In a federated learning system with <num_nodes> devices and <num_edges> data similarity links, a coordinator must select devices for training rounds such that no two share sensitive data patterns. A maximal independent set ensures diverse, non-redundant contributions while preserving privacy.",
        "label": "mis",
        "index": 69
    },
    {
        "desc_split": "In network security, the <graph> represents compatibility between firewall rules, where 1 indicates no conflict and 0 marks a rule collision. The challenge is to identify the largest subset of mutually compatible rules that can be activated simultaneously, maximizing protection without causing operational disruptions for enterprises managing complex network infrastructures.",
        "label": "maxclique",
        "index": 72
    },
    {
        "desc_split": "For crime prevention, the <graph> tracks suspected communications between individuals (1 for contact, 0 for none). Pinpointing the maximally connected suspect group helps dismantle organized crime rings by revealing their core operational structure.",
        "label": "maxclique",
        "index": 8
    },
    {
        "desc_split": "In epidemiology, the <graph> maps contact events between individuals, where 1 signifies a high-risk interaction (e.g., prolonged exposure) and 0 no recorded contact. Determining the largest subset of individuals all exposed to one another pinpoints potential superspreader clusters, refining containment strategies for outbreaks.",
        "label": "maxclique",
        "index": 12
    },
    {
        "desc_split": "In business strategy, the <graph> quantifies synergies between companies, with 1 meaning high compatibility and 0 incompatibility. The objective is to find the largest cluster of firms perfectly aligned for mergers, minimizing integration risks and maximizing post-deal value.",
        "label": "maxclique",
        "index": 83
    },
    {
        "desc_split": "In a workforce management system represented as <graph>, employees are <num_nodes> nodes and edges denote collaboration frequency. Partitioning employees into two shifts while maximizing cross-shift collaborations ensures efficient task handovers and minimizes intra-shift communication overload, improving productivity.",
        "label": "maxcut",
        "index": 30
    },
    {
        "desc_split": "In a city’s waste collection network modeled as <graph> with <num_nodes> bins and <num_edges> collection routes, sensors must be installed to monitor fill levels. Selecting the smallest set of bins to equip ensures all routes are covered, minimizing sensor costs while maintaining efficient waste management.",
        "label": "mvc",
        "index": 40
    },
    {
        "desc_split": "For a satellite network <graph> with <num_nodes> satellites and <num_edges> interference-prone communication links, splitting satellites into two frequency bands to maximize interference links across bands reduces signal collisions and optimizes bandwidth usage in orbital constellations.",
        "label": "maxcut",
        "index": 31
    },
    {
        "desc_split": "A national park’s animal movement paths form <graph> with <num_nodes> key locations and <num_edges> trails. Rangers must patrol a minimal set of locations to cover all trails, maximizing poaching deterrence with limited personnel.",
        "label": "mvc",
        "index": 92
    },
    {
        "desc_split": "In cultural heritage studies, the <graph> tracks artifact co-occurrence, with 1 signifying shared excavation sites and 0 no overlap. Discovering the maximal group of artifacts linked to the same context helps reconstruct ancient trade routes with precision.",
        "label": "maxclique",
        "index": 85
    },
    {
        "desc_split": "A city's road network is modeled as <graph> with <num_nodes> intersections and <num_edges> road segments. To optimize charging infrastructure for self-driving taxis, planners must place stations at intersections such that every road is serviced by at least one nearby station, reducing deployment costs.",
        "label": "mvc",
        "index": 61
    },
    {
        "desc_split": "In a style influence graph <graph>, artworks are <num_nodes> nodes and edges reflect stylistic similarities. Partitioning artworks into two groups to maximize stylistic differences between them helps curators or algorithms create distinct thematic exhibitions or training datasets.",
        "label": "maxcut",
        "index": 94
    },
    {
        "desc_split": "In an urban noise monitoring system represented as <graph> with <num_nodes> sensors and <num_edges> connections between overlapping detection zones, authorities must deploy the fewest possible sensors to ensure every noise source is captured. A minimal vertex cover guarantees full coverage while reducing deployment costs.",
        "label": "mvc",
        "index": 85
    },
    {
        "desc_split": "In a gene interaction graph <graph>, genes are <num_nodes> nodes and regulatory relationships are <num_edges> edges. Partitioning genes into two groups to maximize regulatory edges between them helps identify functionally distinct gene modules, aiding in the study of complex diseases like cancer.",
        "label": "maxcut",
        "index": 13
    },
    {
        "desc_split": "For quantum systems, the <graph> represents coherence between qubits, with 1 denoting stable entanglement and 0 decoherence. Determining the largest fully coherent qubit cluster is vital for error correction and scalable quantum circuit design.",
        "label": "maxclique",
        "index": 33
    },
    {
        "desc_split": "A user-preference graph <graph> links <num_nodes> viewers to films via edges representing strong preferences. Splitting viewers into two groups to maximize cross-group preferences ensures tailored recommendations that avoid homogeneity, enhancing user engagement.",
        "label": "maxcut",
        "index": 9
    },
    {
        "desc_split": "A federated learning system with <num_nodes> devices and <num_edges> communication dependencies must select a subset of devices for model training. By choosing non-adjacent devices in <graph>, data privacy is preserved, as correlated devices (e.g., same household) cannot infer each other’s inputs.",
        "label": "mis",
        "index": 93
    },
    {
        "desc_split": "In a DNA fragment overlap graph <graph> with <num_nodes> fragments and <num_edges> overlaps, scientists must verify critical fragments to detect sequencing errors. A minimal vertex cover identifies the fewest fragments needing validation to ensure all overlaps are error-free.",
        "label": "mvc",
        "index": 7
    },
    {
        "desc_split": "For competitive dance events, the <graph> encodes pairwise chemistry between dancers, with 1 reflecting seamless synergy and 0 denoting incompatibility. Identifying the largest ensemble of perfectly matched performers ensures flawless group routines, elevating performance quality and judging scores.",
        "label": "maxclique",
        "index": 63
    },
    {
        "desc_split": "A city’s parking infrastructure is modeled as <graph>, where nodes are parking spots and edges connect spots too close for simultaneous use. An MIS (<num_nodes> spots, <num_edges> proximity constraints) allows drivers to reserve non-adjacent spots dynamically, minimizing disputes and double bookings during peak hours.",
        "label": "mis",
        "index": 79
    },
    {
        "desc_split": "A farmland is divided into zones represented as <graph>, where nodes are monitoring stations and edges are pest migration paths. To detect infestations early, traps must be placed at the fewest stations while covering all migration routes. This minimizes costs while ensuring comprehensive pest surveillance.",
        "label": "mvc",
        "index": 69
    },
    {
        "desc_split": "In an urban traffic network modeled as <graph>, intersections are <num_nodes> nodes and roads are <num_edges> edges. Partitioning intersections into two alternating signal groups to maximize road crossings between them optimizes traffic flow and reduces congestion within each synchronized group.",
        "label": "maxcut",
        "index": 55
    },
    {
        "desc_split": "In retail analytics, the <graph> captures product co-purchasing patterns, where 1 indicates frequent joint purchases and 0 suggests no significant correlation. The task is to discover the largest group of products consistently bought together, enabling optimized promotional bundles that maximize revenue while enhancing customer satisfaction.",
        "label": "maxclique",
        "index": 62
    },
    {
        "desc_split": "A satellite constellation forms <graph>, where satellites are nodes and communication links are edges. To maintain global coverage, ground stations must connect to a minimal set of satellites such that every inter-satellite link is relayed to at least one station. This optimizes infrastructure costs while ensuring uninterrupted communication (<num_nodes> nodes, <num_edges> edges).",
        "label": "mvc",
        "index": 34
    },
    {
        "desc_split": "For a user engagement graph <graph>, where nodes are news categories and edges reflect co-readership patterns, partitioning categories into two groups to maximize cross-group edges ensures diverse content exposure while maintaining thematic coherence within each group. The graph has <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 62
    },
    {
        "desc_split": "A city’s electric vehicle charging infrastructure is modeled as <graph> with <num_nodes> stations and <num_edges> proximity links. An MIS selects stations to activate during peak hours so that nearby stations aren’t overloaded simultaneously, optimizing energy distribution and reducing wait times.",
        "label": "mis",
        "index": 36
    },
    {
        "desc_split": "In an audio processing network represented as <graph>, where nodes are frequency bands and edges denote harmonic interference, partitioning the bands into two groups to maximize interference between them helps isolate noise sources. This improves signal clarity by minimizing intra-group distortion in <num_nodes> bands and <num_edges> interference relationships.",
        "label": "maxcut",
        "index": 20
    },
    {
        "desc_split": "A financial network <graph> represents accounts (nodes) and suspicious transactions (edges). Separating accounts into two groups to maximize flagged transactions between groups isolates potential fraud rings. The graph includes <num_nodes> accounts and <num_edges> high-risk transactions.",
        "label": "maxcut",
        "index": 4
    },
    {
        "desc_split": "A retail supply chain is represented as <graph>, where warehouses are nodes and delivery routes are edges. Auditors must visit a subset of warehouses to verify stock levels across all routes. The MVC solution identifies the minimal set of warehouses to audit, ensuring full route coverage with <num_nodes> warehouses and <num_edges> routes.",
        "label": "mvc",
        "index": 17
    },
    {
        "desc_split": "An oil pipeline network is represented as <graph>, where junctions are nodes and pipes are edges. Sensors must be installed at junctions to detect leaks in any pipe. The challenge is to place the fewest sensors possible while ensuring every pipe is monitored by at least one adjacent sensor (<num_nodes> nodes, <num_edges> edges).",
        "label": "mvc",
        "index": 32
    },
    {
        "desc_split": "In a smart home IoT network <graph> with <num_nodes> devices and <num_edges> communication links, security patches must be deployed to cover all vulnerable connections. The challenge is to select the smallest set of devices to update, ensuring every data exchange is protected.",
        "label": "mvc",
        "index": 52
    },
    {
        "desc_split": "In an IoT sensor graph <graph>, nodes are devices and edges indicate correlated abnormal readings. Partitioning devices into two clusters to maximize cross-cluster correlations isolates systemic faults from localized errors, enhancing diagnostic precision across <num_nodes> sensors and <num_edges> anomaly relationships.",
        "label": "maxcut",
        "index": 22
    },
    {
        "desc_split": "A warehouse’s robot navigation grid is modeled as <graph>, where nodes are charging stations and edges are travel paths. To ensure robots never run out of power, the MVC problem identifies the minimal stations to activate, guaranteeing every path is within reach of at least one charging point.",
        "label": "mvc",
        "index": 28
    },
    {
        "desc_split": "A social media graph <graph> links users (nodes) via shared interests (edges). Partitioning <num_nodes> users into two clusters to maximize inter-cluster edges allows advertisers to target divergent demographics simultaneously, increasing ad relevance and reducing audience overlap (<num_edges> interest connections).",
        "label": "maxcut",
        "index": 29
    },
    {
        "desc_split": "In a machine learning dataset modeled as <graph>, nodes are data samples and edges encode feature similarities. Splitting the dataset into two subsets to maximize dissimilar edges between them helps mitigate bias by ensuring each subset captures divergent patterns, improving model generalization. The graph contains <num_nodes> samples and <num_edges> similarity links.",
        "label": "maxcut",
        "index": 66
    },
    {
        "desc_split": "A factory’s machine dependency graph (<graph>) connects equipment (nodes) that share maintenance dependencies (edges). To prevent downtime, technicians must inspect the fewest machines possible while covering all dependencies, ensuring <num_edges> critical maintenance links are monitored efficiently.",
        "label": "mvc",
        "index": 59
    },
    {
        "desc_split": "In a farmland irrigation system represented as <graph>, where nodes are valves and edges are pipes, engineers must ensure every pipe is monitored for leaks or blockages. Selecting the smallest set of valves to install sensors guarantees full pipe coverage while minimizing equipment costs. The system has <num_nodes> valves and <num_edges> pipes.",
        "label": "mvc",
        "index": 35
    },
    {
        "desc_split": "In a smart city’s electric vehicle (EV) charging network modeled as <graph> with <num_nodes> stations and <num_edges> proximity connections, stations must be activated such that no two adjacent stations operate simultaneously. This prevents grid overload while ensuring maximal coverage for EV users during peak demand.",
        "label": "mis",
        "index": 90
    },
    {
        "desc_split": "A power grid modeled as <graph> with <num_nodes> substations and <num_edges> shared transmission lines must avoid overloading. An MIS selects substations to distribute power independently, ensuring no two adjacent stations activate simultaneously, thus balancing load and preventing blackouts.",
        "label": "mis",
        "index": 12
    },
    {
        "desc_split": "Within the fashion industry, the <graph> captures stylistic alignment between designers, where 1 marks a history of successful joint collections and 0 no prior teamwork. The aim is to pinpoint the biggest cohort of designers universally compatible with one another, fostering innovative collaborations for runway shows.",
        "label": "maxclique",
        "index": 19
    },
    {
        "desc_split": "In a decentralized ledger represented as <graph>, where nodes are validators and edges are transaction dependencies, a minimal set of validators must be chosen to verify all transactions. This reduces computational overhead while ensuring consensus integrity across the network.",
        "label": "mvc",
        "index": 41
    },
    {
        "desc_split": "Within smart infrastructure systems, the <graph> shows functional dependencies between IoT sensors, with 1 indicating crucial data-exchange pairs and 0 representing independent units. Locating the largest cluster of mutually dependent sensors exposes critical failure points requiring redundancy planning to maintain urban operations.",
        "label": "maxclique",
        "index": 90
    },
    {
        "desc_split": "An oceanographic mission uses <num_nodes> AUVs and <num_edges> proximity constraints (e.g., sonar interference) to map a region. By activating a maximal independent set of AUVs, the team avoids signal collisions while covering the largest possible area in parallel.",
        "label": "mis",
        "index": 89
    },
    {
        "desc_split": "A greenhouse’s plant layout is a <graph> with <num_nodes> plants and <num_edges> overlapping pest-spread paths. To detect infestations early, sensors must be placed on the minimal number of plants to cover all potential spread routes. MVC ensures full coverage while reducing sensor costs and false alarms.",
        "label": "mvc",
        "index": 74
    },
    {
        "desc_split": "A global airline route network is modeled as <graph>, where airports are nodes and flight paths are edges. To detect disease spread efficiently, health agencies must choose the minimal number of airports to implement mandatory testing, ensuring every flight route is covered by at least one testing hub.",
        "label": "mvc",
        "index": 96
    },
    {
        "desc_split": "A maritime traffic system represents ships and their collision radii as <graph> with <num_nodes> vessels and <num_edges> proximity conflicts. An MIS computes a safe subset of ships to maneuver simultaneously, preventing accidents while maintaining throughput in busy shipping lanes.",
        "label": "mis",
        "index": 59
    },
    {
        "desc_split": "In a cloud infrastructure represented as <graph> with <num_nodes> microservices and <num_edges> communication dependencies, partitioning the microservices into two clusters to maximize inter-cluster communication minimizes latency bottlenecks within each cluster, improving overall system performance.",
        "label": "maxcut",
        "index": 95
    },
    {
        "desc_split": "In a smart building’s sensor network <graph>, rooms are nodes (<num_nodes>), and shared occupancy patterns are edges (<num_edges>). Splitting rooms into two lighting zones to maximize cross-zone activity ensures energy-efficient illumination while adapting to real-time occupancy disparities.",
        "label": "maxcut",
        "index": 49
    },
    {
        "desc_split": "In a resource extraction map represented by <graph> (<num_nodes> sites, <num_edges> shared environmental risks), regulators must approve mining sites where no two adjacent sites operate simultaneously. This minimizes ecological damage while maximizing resource yield.",
        "label": "mis",
        "index": 97
    },
    {
        "desc_split": "A city’s evacuation plan maps shelters (<num_nodes>) and their proximity risks (<num_edges>) in <graph>. An MIS ensures shelters are far enough apart to avoid overcrowding during disasters, optimizing resource distribution and safety coverage.",
        "label": "mis",
        "index": 8
    },
    {
        "desc_split": "In conservation biology, the <graph> models migration paths between habitats, where 1 denotes accessible routes and 0 barriers. Identifying the largest cluster of habitats fully connected by migration paths aids in designing wildlife corridors to preserve biodiversity.",
        "label": "maxclique",
        "index": 16
    },
    {
        "desc_split": "Within legislative bodies, the <graph> tracks voting alignment (1 = consistent agreements, 0 = frequent opposition). Discovering the maximum group of legislators with identical voting patterns reveals dominant political alliances shaping policy outcomes.",
        "label": "maxclique",
        "index": 40
    },
    {
        "desc_split": "In a microgrid <graph> with <num_nodes> prosumers (producer-consumers) and <num_edges> energy exchange potentials, bipartitioning prosumers to maximize trades *between* groups encourages competitive pricing and reduces reliance on centralized distributors.",
        "label": "maxcut",
        "index": 58
    },
    {
        "desc_split": "In an airspace network <graph>, waypoints are nodes (<num_nodes>), and flight paths are edges (<num_edges>). Dividing airspace into two sectors to maximize cross-sector flights optimizes traffic flow management, reducing congestion within sectors while maintaining efficient routing.",
        "label": "maxcut",
        "index": 47
    },
    {
        "desc_split": "For law enforcement, the <graph> models communication links between suspected criminals, with 1 denoting confirmed contact and 0 representing no observable connection. Identifying the largest group where all members interact directly with each other helps uncover core leadership structures within illicit networks.",
        "label": "maxclique",
        "index": 57
    },
    {
        "desc_split": "A city’s neighborhoods are nodes in <graph>, with edges denoting high inter-zone mobility. Placing testing sites in a maximal independent set (<num_nodes> locations, <num_edges> mobility paths) minimizes redundant coverage while ensuring all high-risk areas are within reach, balancing cost and accessibility.",
        "label": "mis",
        "index": 23
    },
    {
        "desc_split": "In a delivery drone network <graph> with <num_nodes> hubs and <num_edges> flight paths, charging stations must cover all routes. Placing stations at a minimal set of hubs guarantees drones can recharge on any path, maximizing operational range with minimal infrastructure.",
        "label": "mvc",
        "index": 43
    },
    {
        "desc_split": "In a power distribution network modeled as <graph> with <num_nodes> substations and <num_edges> transmission lines, a utility provider must activate a subset of microgrids to ensure no two adjacent substations are powered simultaneously. This prevents overloads while maximizing energy coverage during peak demand.",
        "label": "mis",
        "index": 50
    },
    {
        "desc_split": "In a collision-avoidance graph <graph>, drones are nodes and edges represent proximity risks. Dividing the swarm into two flight paths to maximize inter-group separation minimizes mid-air collisions while maintaining mission efficiency in a formation of <num_nodes> drones and <num_edges> risk pairs.",
        "label": "maxcut",
        "index": 53
    },
    {
        "desc_split": "A warehouse layout is modeled as <graph>, where nodes represent charging stations and edges indicate proximity conflicts. To avoid overloading the power grid, stations must be placed such that no two adjacent stations charge robots simultaneously, optimizing energy distribution across <num_nodes> stations and <num_edges> proximity constraints.",
        "label": "mis",
        "index": 16
    },
    {
        "desc_split": "In culinary operations, the <graph> tracks ingredient pairings across dishes, where 1 denotes frequent co-occurrence (e.g., tomato-basil) and 0 rare combination. Finding the largest fully compatible ingredient subset enables chefs to design cohesive menus that maximize cross-utilization and reduce inventory waste.",
        "label": "maxclique",
        "index": 14
    },
    {
        "desc_split": "A conservation area’s animal movement paths form <graph>, where nodes are key habitats and edges are migration routes. To prevent poaching, rangers must patrol the fewest habitats while ensuring every migration route is monitored, maximizing coverage with minimal resources.",
        "label": "mvc",
        "index": 53
    },
    {
        "desc_split": "A municipal water system is represented as <graph>, where nodes are junctions and edges are pipelines. To detect leaks or contamination, sensors must cover all pipelines. The MVC solution identifies the minimal set of junctions to place sensors, ensuring full coverage while reducing installation costs.",
        "label": "mvc",
        "index": 26
    },
    {
        "desc_split": "A festival’s stage network is represented by <graph>, where <num_nodes> stages and <num_edges> sound interference edges exist. Scheduling performances on stages that are acoustically isolated (no shared edges) prevents audio clashes, maximizing attendee experience and artist exposure.",
        "label": "mis",
        "index": 81
    },
    {
        "desc_split": "In aviation logistics, the <graph> represents compatibility between flights for shared gate usage, where 1 indicates simultaneous gate occupancy is feasible and 0 denotes conflicting schedules. The task is to pinpoint the largest group of flights that can safely share a single gate without overlap, optimizing terminal efficiency during peak hours.",
        "label": "maxclique",
        "index": 52
    },
    {
        "desc_split": "A transportation network <graph> models <num_nodes> neighborhoods and <num_edges> frequently traveled routes. To minimize costs, a ride-sharing company must place hubs in the fewest neighborhoods such that every route connects to at least one hub, ensuring coverage for all potential pickups.",
        "label": "mvc",
        "index": 11
    },
    {
        "desc_split": "A logistics network <graph> models <num_nodes> warehouses as nodes and <num_edges> high-dependency routes as edges. Splitting warehouses into two groups to maximize cross-group dependencies ensures that localized disruptions (e.g., natural disasters) minimally impact overall supply chain resilience.",
        "label": "maxcut",
        "index": 6
    },
    {
        "desc_split": "During disaster response, a relief network <graph> with <num_nodes> aid centers and <num_edges> overlapping service areas uses an MIS to deploy resources. Centers in the set operate independently to avoid duplication while ensuring all affected regions receive aid.",
        "label": "mis",
        "index": 39
    },
    {
        "desc_split": "In a transportation network modeled as <graph> with <num_nodes> pickup/drop-off locations and <num_edges> representing high-demand routes, partitioning the locations into two zones to maximize inter-zone trips optimizes ride-pooling efficiency. This reduces empty vehicle miles while ensuring demand is evenly distributed across fleets.",
        "label": "maxcut",
        "index": 35
    },
    {
        "desc_split": "A farm’s crop fields are modeled as <graph>, where nodes are fields and edges represent pest migration routes. To deploy traps efficiently, the MVC problem identifies the smallest set of fields where traps intercept all migration paths, minimizing costs while maximizing pest control coverage.",
        "label": "mvc",
        "index": 24
    },
    {
        "desc_split": "In quantum computing research, the <graph> represents entanglement compatibility between qubits, where 1 indicates pairs that can maintain entanglement without error and 0 denotes incompatible pairs. The aim is to discover the largest fully entangled subset of qubits, enabling high-fidelity quantum circuits essential for scalable quantum algorithms.",
        "label": "maxclique",
        "index": 42
    },
    {
        "desc_split": "In a power distribution network modeled as <graph> with <num_nodes> substations and <num_edges> transmission lines, a utility company must activate a subset of microgrids to ensure no two active grids share a direct connection. This prevents cascading failures while maximizing energy coverage during peak demand.",
        "label": "mis",
        "index": 95
    },
    {
        "desc_split": "In a flight zone partition graph <graph> (<num_nodes> sectors, <num_edges> shared boundaries), assigning control towers to a maximal independent set of sectors prevents overlapping jurisdiction conflicts, enabling efficient coordination without radio interference or redundant oversight.",
        "label": "mis",
        "index": 24
    },
    {
        "desc_split": "For logistics, the <graph> represents supplier relationships, with 1 marking a direct dependency and 0 independence. Discovering the largest interconnected supplier cluster reveals critical vulnerabilities, enabling firms to mitigate risks of disruptions in complex supply networks.",
        "label": "maxclique",
        "index": 6
    },
    {
        "desc_split": "For a drone-based surveillance system operating over a grid <graph> of <num_nodes> zones and <num_edges> overlapping patrol ranges, an MIS selects non-adjacent zones for simultaneous drone deployment. This maximizes area coverage while preventing redundant monitoring or mid-air collisions.",
        "label": "mis",
        "index": 3
    },
    {
        "desc_split": "In a CDN topology <graph>, servers are <num_nodes> nodes and high-latency connections are <num_edges> edges. Splitting servers into two geographically distinct clusters while maximizing cross-cluster traffic ensures efficient content replication and minimizes latency for end-users by distributing load evenly.",
        "label": "maxcut",
        "index": 11
    },
    {
        "desc_split": "Studying cognitive functions, neuroscientists use the <graph> where 1 marks statistically coupled brain regions and 0 uncorrelated activity. Locating the maximally interconnected neural cluster provides insights into functional hubs responsible for complex thought processes.",
        "label": "maxclique",
        "index": 25
    },
    {
        "desc_split": "A farmland is divided into <num_nodes> zones with <num_edges> shared boundaries where pests can migrate. Farmers need to place traps in the fewest zones to cover all adjacent boundaries, preventing pest spread while reducing trap maintenance efforts.",
        "label": "mvc",
        "index": 63
    },
    {
        "desc_split": "A building’s room adjacency graph <graph> has <num_nodes> rooms and <num_edges> connecting doors. To deploy motion sensors efficiently, the goal is to cover all doorways by placing sensors in the fewest rooms, ensuring every door is monitored while minimizing installation costs.",
        "label": "mvc",
        "index": 1
    },
    {
        "desc_split": "In a federated learning system represented as <graph>, devices are <num_nodes> nodes and edges represent data similarity. Splitting devices into two groups to maximize dissimilarity between groups ensures diverse training data distribution, improving model robustness while preserving privacy.",
        "label": "maxcut",
        "index": 91
    },
    {
        "desc_split": "A cultural heritage risk network <graph> links <num_nodes> archaeological sites via <num_edges> shared threats (looting, erosion). Partitioning sites into two preservation priority tiers to maximize threat edges between tiers ensures high-risk sites in one group receive immediate protection while maintaining awareness of secondary risks.",
        "label": "maxcut",
        "index": 89
    },
    {
        "desc_split": "A constellation of <num_nodes> satellites forms a communication graph <graph> with <num_edges> interference links. To avoid signal collisions, ground stations must schedule transmissions to satellites in an MIS, enabling parallel data downloads without cross-talk.",
        "label": "mis",
        "index": 32
    },
    {
        "desc_split": "For a machine learning dataset structured as <graph>, data points are nodes (<num_nodes>), and edges (<num_edges>) reflect feature correlations. Splitting the data into two subsets to maximize inter-subset edges helps reduce bias by ensuring diverse representation in each training batch, improving model generalization.",
        "label": "maxcut",
        "index": 46
    },
    {
        "desc_split": "In online retail platforms, the <graph> tracks product co-purchases, where 1 signifies frequent joint purchases by customers and 0 rare or no joint purchases. Identifying the biggest collection of mutually co-purchased items helps bundle recommendations, boosting cross-selling opportunities for retailers.",
        "label": "maxclique",
        "index": 2
    },
    {
        "desc_split": "In a habitat connectivity graph <graph>, nodes are wildlife zones and edges are migration corridors. Partitioning zones into two reserves to maximize corridor crossings between them promotes genetic diversity by forcing species to traverse both reserves, with <num_nodes> zones and <num_edges> corridors.",
        "label": "maxcut",
        "index": 3
    },
    {
        "desc_split": "A network of security sensors <graph> with <num_nodes> nodes and <num_edges> overlapping monitoring ranges must activate a subset of sensors to detect threats independently. An MIS ensures maximal coverage without redundant alerts, optimizing response efficiency.",
        "label": "mis",
        "index": 49
    },
    {
        "desc_split": "In a collision-risk graph <graph>, nodes are debris objects and edges represent proximity thresholds. Partitioning debris into two orbital clusters to maximize high-risk pairs across clusters minimizes intra-cluster collision probability, aiding satellite safety. The graph tracks <num_nodes> debris objects and <num_edges> risk edges.",
        "label": "maxcut",
        "index": 67
    },
    {
        "desc_split": "In medical research, <graph> indicates pairs of drugs with potentially dangerous interactions, where 1 marks confirmed adverse reactions and 0 means no known issues. Finding the largest cluster of mutually compatible medications assists in designing safe combination therapies for complex treatments.",
        "label": "maxclique",
        "index": 58
    },
    {
        "desc_split": "In film production, the <graph> represents potential acting partnerships, where 1 signifies confirmed on-screen chemistry between actors and 0 indicates no prior collaboration. The objective is to determine the largest ensemble cast where every actor has previously worked successfully with all others, ensuring cinematic cohesion and audience appeal.",
        "label": "maxclique",
        "index": 56
    },
    {
        "desc_split": "A music festival’s stage network <graph> has <num_nodes> stages and <num_edges> sound interference edges. Organizers must schedule performances on stages that are acoustically isolated to prevent overlapping noise, maximizing audience enjoyment and artist clarity.",
        "label": "mis",
        "index": 46
    },
    {
        "desc_split": "A power grid’s control network is represented as <graph> with <num_nodes> control units and <num_edges> communication links. To defend against cyberattacks, operators must deploy intrusion detectors at the fewest possible units, guaranteeing every data link is monitored without redundancy.",
        "label": "mvc",
        "index": 97
    },
    {
        "desc_split": "A correlation network <graph> of financial assets (<num_nodes>) uses edges (<num_edges>) to represent high correlation. Splitting assets into two portfolios to maximize cross-portfolio correlations ensures diversification, reducing systemic risk while maintaining exposure to market trends.",
        "label": "maxcut",
        "index": 18
    },
    {
        "desc_split": "During a crisis, a regional hospital network’s ICU capacity is modeled as <graph>, where nodes are hospitals and edges represent shared patient transfer routes. An MIS ensures selected hospitals can independently handle critical cases without overburdening neighboring facilities, balancing regional healthcare load.",
        "label": "mis",
        "index": 33
    },
    {
        "desc_split": "For a multi-stage festival with <num_nodes> performers and <num_edges> overlapping fan bases, an MIS selects artists who can play simultaneously without drawing crowds to adjacent stages. This maximizes audience choice while preventing overcrowding in the venue graph <graph>.",
        "label": "mis",
        "index": 27
    },
    {
        "desc_split": "A federated learning system involves <num_nodes> devices connected via <graph> (edges indicate data leakage risks). To train a global model without exposing correlated data, an MIS selects devices with no shared links, preserving privacy while maximizing participation.",
        "label": "mis",
        "index": 73
    },
    {
        "desc_split": "For a disease spread network <graph> with nodes as communities and edges as high transmission rates, dividing communities into two vaccination priority groups to maximize transmission links between them ensures targeted immunization, effectively curbing spread with limited resources in <num_nodes> communities and <num_edges> transmission pathways.",
        "label": "maxcut",
        "index": 23
    },
    {
        "desc_split": "In an advanced power distribution network modeled as <graph> with <num_nodes> substations and <num_edges> transmission lines, sensors must be deployed to detect faults. The MVC solution identifies the minimal set of substations where sensors can monitor all lines, ensuring rapid fault detection while reducing installation costs.",
        "label": "mvc",
        "index": 20
    },
    {
        "desc_split": "A city’s road network is represented as <graph>, where nodes are intersections and edges are roads. To ensure autonomous delivery robots never run out of power, charging stations must cover all roads. The MVC problem determines the fewest intersections for station placement, guaranteeing every road has access to charging.",
        "label": "mvc",
        "index": 21
    },
    {
        "desc_split": "In a sensor network <graph>, monitoring stations are <num_nodes> nodes, and edges represent overlapping coverage areas. Splitting the stations into two groups to maximize the number of overlapping edges between groups ensures comprehensive environmental data collection while minimizing redundant coverage within each group.",
        "label": "maxcut",
        "index": 41
    },
    {
        "desc_split": "In a music similarity graph <graph>, nodes are songs and edges indicate shared acoustic features. Partitioning songs into two clusters to maximize cross-cluster edges allows AI systems to create hybrid playlists that blend genres seamlessly while preserving distinct stylistic boundaries. The graph comprises <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 64
    },
    {
        "desc_split": "A cloud infrastructure graph <graph> with <num_nodes> servers and <num_edges> communication links requires backup nodes. Selecting the smallest set of servers to replicate guarantees that every link remains operational if any single server fails, optimizing redundancy costs.",
        "label": "mvc",
        "index": 8
    },
    {
        "desc_split": "A telecom company aims to deploy cellular towers across a region modeled as <graph>, where <num_nodes> represents potential tower locations and <num_edges> indicates interference zones. An MIS identifies non-adjacent tower sites, allowing simultaneous signal transmission without cross-interference and optimizing network capacity.",
        "label": "mis",
        "index": 1
    },
    {
        "desc_split": "During a pandemic, health authorities must choose vaccination centers from a city’s facility network <graph> with <num_nodes> clinics and <num_edges> proximity links. An MIS ensures no two selected centers are too close, enabling equitable access while avoiding resource duplication in high-density areas.",
        "label": "mis",
        "index": 2
    },
    {
        "desc_split": "An e-commerce platform models its product recommendation system as <graph>, with <num_nodes> products and <num_edges> representing co-purchase frequencies. By splitting products into two disjoint catalogs to maximize cross-group co-purchases, the platform can run balanced A/B tests to evaluate recommendation algorithms without skewing user behavior.",
        "label": "maxcut",
        "index": 16
    },
    {
        "desc_split": "For organizing academic conferences, the <graph> tracks topic similarity between submitted papers (1 for thematic alignment, 0 for incompatibility). Planners must discover the largest cohesive group of papers sharing conceptual overlaps to create high-impact sessions that foster meaningful scholarly dialogues among attendees.",
        "label": "maxclique",
        "index": 73
    },
    {
        "desc_split": "In a museum interaction graph <graph>, artworks are nodes and edges represent visitor flow between pieces. Partitioning artworks into two gallery sections to maximize visitor transitions between sections encourages exploration, optimizing engagement in an exhibition with <num_nodes> artworks and <num_edges> flow patterns.",
        "label": "maxcut",
        "index": 24
    },
    {
        "desc_split": "In a smart farming system modeled by <graph> with <num_nodes> fields and <num_edges> adjacency relationships, drones must monitor crops for diseases without overlapping coverage. Selecting a maximal independent set of fields ensures efficient surveillance while avoiding redundant data collection and energy waste.",
        "label": "mis",
        "index": 80
    },
    {
        "desc_split": "A cellular tower network <graph> requires signal boosters to maintain connectivity between towers (edges). By placing boosters at a minimal subset of towers (nodes), providers ensure all inter-tower links are strengthened without over-deployment. The network has <num_nodes> towers and <num_edges> connections.",
        "label": "mvc",
        "index": 36
    },
    {
        "desc_split": "Law enforcement maps a dark web marketplace as <graph>, where nodes are vendors and edges are transactions. To dismantle the network, they must infiltrate the smallest group of vendors to trace all transactions. The MVC solution identifies the critical vendors to target for maximal disruption with minimal exposure.",
        "label": "mvc",
        "index": 73
    },
    {
        "desc_split": "In a resource-rich area represented by <graph> (<num_nodes> mining sites, <num_edges> proximity conflicts), regulators must designate independent mining sites to prevent environmental degradation from overlapping excavations. The MIS ensures maximal extraction without ecological clashes.",
        "label": "mis",
        "index": 72
    },
    {
        "desc_split": "In a molecular interaction network <graph>, atoms or molecules are represented as <num_nodes> nodes, and bonds or interactions as <num_edges> edges. By partitioning the system into two subsets to maximize the interactions between them, researchers can identify optimal configurations for novel materials with desired properties, such as superconductivity or mechanical strength.",
        "label": "maxcut",
        "index": 10
    },
    {
        "desc_split": "In a contact graph <graph> with <num_nodes> individuals and <num_edges> close interactions, health agencies need to notify a subset of people about potential exposure without revealing overlapping contacts. The MIS ensures anonymized alerts while covering the maximum at-risk population.",
        "label": "mis",
        "index": 43
    },
    {
        "desc_split": "In a seismic activity network <graph>, nodes represent potential sensor locations and edges model fault line interactions. By splitting the locations into two sets to maximize the number of fault lines monitored across sets, scientists can optimize early-warning coverage with minimal redundancy. The graph contains <num_nodes> nodes and <num_edges> edges.",
        "label": "maxcut",
        "index": 61
    },
    {
        "desc_split": "In a power distribution network modeled as <graph> with <num_nodes> substations and <num_edges> transmission lines, operators must activate a subset of microgrids to ensure no two adjacent substations are simultaneously active. This prevents overloads while maximizing energy coverage during peak demand.",
        "label": "mis",
        "index": 70
    },
    {
        "desc_split": "A pixel affinity graph <graph> of a medical image contains <num_nodes> superpixels and <num_edges> similarity weights. Using Max-Cut to split superpixels into two regions (e.g., tumor vs. healthy tissue) while maximizing dissimilar edges improves boundary accuracy for diagnostic precision.",
        "label": "maxcut",
        "index": 73
    },
    {
        "desc_split": "A mining company evaluates potential extraction sites modeled as <graph>, where edges indicate overlapping environmental impact zones. Selecting a maximal independent set of sites ensures that no two active mines disrupt the same ecosystem, balancing resource extraction with sustainability.",
        "label": "mis",
        "index": 61
    },
    {
        "desc_split": "In a power distribution network represented as <graph>, where nodes are substations and edges are transmission lines, partitioning the grid into two regions to maximize the number of inter-region connections ensures redundancy and minimizes cascading failures during outages. The network has <num_nodes> substations and <num_edges> critical transmission lines.",
        "label": "maxcut",
        "index": 0
    },
    {
        "desc_split": "In computational linguistics, the <graph> shows agreement between machine translation systems, with 1 marking consistent translations for a phrase pair and 0 reflecting discrepancies. Analyzing these matrices helps isolate the largest cluster of translation engines producing mutually aligned outputs, highlighting reliable linguistic approaches worthy of further development.",
        "label": "maxclique",
        "index": 98
    },
    {
        "desc_split": "In a city’s traffic network represented as <graph> with <num_nodes> intersections and <num_edges> roads, authorities aim to deploy traffic sensors at the fewest intersections to monitor all road segments. This ensures real-time congestion tracking while minimizing installation costs.",
        "label": "mvc",
        "index": 90
    },
    {
        "desc_split": "A railway network is modeled as <graph>, where stations are nodes and tracks are edges. To ensure safety, inspectors must be stationed at key junctions to oversee all track segments. The goal is to select the fewest stations such that every track is monitored, optimizing inspector allocation for <num_nodes> stations and <num_edges> tracks.",
        "label": "mvc",
        "index": 16
    },
    {
        "desc_split": "In a city’s road network modeled as <graph> with <num_nodes> intersections and <num_edges> streets, energy-efficient streetlights must illuminate all roads. By selecting the smallest set of intersections to install lights, every street segment is lit while minimizing power consumption and infrastructure costs.",
        "label": "mvc",
        "index": 55
    },
    {
        "desc_split": "A supply chain network <graph> consists of <num_nodes> suppliers and <num_edges> transactions. Auditors must select the smallest set of suppliers to investigate, ensuring that every transaction involving a high-risk supplier is scrutinized for fraud.",
        "label": "mvc",
        "index": 54
    },
    {
        "desc_split": "A citation network <graph> of legal documents (<num_nodes> documents, <num_edges> references) requires auditing for regulatory compliance. Selecting the smallest subset of documents to review ensures all referenced materials are covered, streamlining the verification process.",
        "label": "mvc",
        "index": 44
    },
    {
        "desc_split": "In a city’s ride-hailing demand graph <graph> with <num_nodes> zones and <num_edges> high-demand trips between zones, Max-Cut partitions zones into two pricing regions. Maximizing inter-region trips allows surge pricing algorithms to dynamically adjust rates based on cross-boundary demand, optimizing driver allocation and revenue.",
        "label": "maxcut",
        "index": 72
    },
    {
        "desc_split": "In a multiplayer game world represented by <graph> with <num_nodes> non-player characters (NPCs) and <num_edges> interaction dependencies, an MIS selects NPCs to act autonomously without conflicting behaviors. This creates realistic, non-redundant actions while preserving gameplay balance.",
        "label": "mis",
        "index": 13
    },
    {
        "desc_split": "In a supermarket layout modeled as <graph> with <num_nodes> shelves and <num_edges> proximity constraints, restocking robots must select shelves to service without adjacent activations. This prevents aisle congestion and ensures efficient inventory replenishment.",
        "label": "mis",
        "index": 47
    },
    {
        "desc_split": "In cybersecurity, the <graph> captures trust relationships between dark web vendors, where 1 signifies a validated trust link and 0 distrust or no interaction. Pinpointing the largest clique of trusted vendors exposes resilient illicit networks for targeted law enforcement.",
        "label": "maxclique",
        "index": 81
    },
    {
        "desc_split": "In a distribution network modeled as <graph> with <num_nodes> warehouses and <num_edges> shipping routes, regulators must ensure all drug shipments are tracked. By selecting the smallest set of warehouses to audit, every route is monitored, minimizing regulatory overhead while preventing counterfeit goods.",
        "label": "mvc",
        "index": 5
    },
    {
        "desc_split": "In digital humanities, the <graph> denotes thematic links between archived manuscripts (1) or their isolation (0). Extracting the largest interconnected document cluster helps historians reconstruct comprehensive narrative threads from fragmented records.",
        "label": "maxclique",
        "index": 71
    },
    {
        "desc_split": "In a warehouse layout <graph>, storage zones are <num_nodes> nodes and robot transit paths are <num_edges> edges. Partitioning zones into two groups to maximize inter-group paths allows efficient robot routing, minimizing collisions and maximizing parallel task execution.",
        "label": "maxcut",
        "index": 92
    },
    {
        "desc_split": "For ancient civilization studies, the <graph> marks artifact similarity between dig sites, where 1 signifies shared material provenance and 0 indicates distinct origins. Determining the largest collection of interconnected sites reveals extensive trade networks that shaped historical economic systems.",
        "label": "maxclique",
        "index": 91
    },
    {
        "desc_split": "A mining corporation evaluates potential excavation sites represented by <graph>, where nodes are locations and edges indicate overlapping environmental impact zones. Selecting a maximal independent set of sites (<num_nodes> candidates, <num_edges> conflicts) allows sustainable extraction without violating ecological regulations or overburdening local ecosystems.",
        "label": "mis",
        "index": 76
    },
    {
        "desc_split": "In a wireless interference graph <graph>, devices are <num_nodes> nodes and edges represent potential signal interference. Partitioning devices into two frequency channels to maximize interference edges between groups minimizes intra-channel collisions, optimizing overall network performance.",
        "label": "maxcut",
        "index": 5
    },
    {
        "desc_split": "A busy harbor’s waterway network is modeled as <graph>, where nodes are navigation checkpoints and edges are shipping lanes. To prevent collisions, the port authority must station patrol boats at the smallest set of checkpoints to oversee all lanes. The MVC approach ensures complete coverage with minimal resource deployment.",
        "label": "mvc",
        "index": 71
    },
    {
        "desc_split": "In a city’s ride-sharing network <graph> with <num_nodes> drivers and <num_edges> overlapping service zones, drivers must be assigned to regions where they do not directly compete. This maximizes coverage while minimizing driver congestion, ensuring efficient passenger pickups.",
        "label": "mis",
        "index": 17
    },
    {
        "desc_split": "In a disaster-prone region, evacuation routes form <graph> with <num_nodes> shelters and <num_edges> pathways. Authorities must station responders at shelters to oversee all pathways. The MVC approach selects the minimal shelters to staff, ensuring every evacuation route is monitored for safety.",
        "label": "mvc",
        "index": 23
    },
    {
        "desc_split": "In a smart city’s transportation network modeled as <graph> with <num_nodes> charging stations and <num_edges> proximity-based conflicts, stations must be activated such that no two adjacent stations operate simultaneously. This ensures efficient power grid load balancing while avoiding localized energy surges.",
        "label": "mis",
        "index": 30
    },
    {
        "desc_split": "A fashion influence network <graph> models <num_nodes> designers and <num_edges> stylistic similarities. By splitting designers into two clusters (e.g., avant-garde/traditional) to maximize cross-cluster inspiration edges, retailers can curate diverse collections that appeal to broader consumer segments.",
        "label": "maxcut",
        "index": 86
    },
    {
        "desc_split": "In a disease transmission network <graph> with <num_nodes> regions and <num_edges> travel routes, partitioning regions into two vaccine allocation groups to maximize cross-group transmission edges ensures limited vaccines are strategically placed to disrupt the most critical spread pathways.",
        "label": "maxcut",
        "index": 80
    },
    {
        "desc_split": "In a smart city, parking spots are modeled as nodes in <graph> with <num_nodes> spots and <num_edges> proximity conflicts. To optimize parking availability, a system must select a maximal set of non-adjacent spots for simultaneous reservations, ensuring no two reserved spots are close enough to cause traffic bottlenecks.",
        "label": "mis",
        "index": 65
    },
    {
        "desc_split": "A border region is mapped as <graph> with <num_nodes> observation points and <num_edges> patrol routes. To monitor all routes for illegal crossings, drones must be stationed at the fewest possible points while ensuring every route is visible to at least one drone. This optimizes surveillance efficiency and battery usage.",
        "label": "mvc",
        "index": 67
    },
    {
        "desc_split": "A factory’s robot collaboration network is modeled as <graph>, with <num_nodes> robots and <num_edges> interaction dependencies. To predict failures, engineers must instrument a minimal set of robots whose data streams cover all interactions, ensuring full system visibility without redundant sensors.",
        "label": "mvc",
        "index": 77
    },
    {
        "desc_split": "In a greenhouse with <num_nodes> plant clusters and <num_edges> pest migration routes, sensors must be placed to detect infestations. The MVC problem determines the optimal sensor locations to cover all possible pest pathways while minimizing hardware costs.",
        "label": "mvc",
        "index": 89
    },
    {
        "desc_split": "In a molecular interaction graph <graph>, drugs are nodes and edges indicate adverse interactions. Bipartitioning the drugs into two treatment groups to maximize cross-group interactions ensures safer co-administration within each group, minimizing patient risk.",
        "label": "maxcut",
        "index": 32
    },
    {
        "desc_split": "A fleet of surveillance drones operates over a region divided into zones (<graph> with <num_nodes> zones and <num_edges> overlapping coverage areas). To avoid redundant monitoring, drones must be assigned to zones such that no two adjacent zones are surveilled, optimizing resource usage and minimizing interference.",
        "label": "mis",
        "index": 71
    },
    {
        "desc_split": "In an automated factory, robots collaborate via a communication network represented as <graph> with <num_nodes> robots and <num_edges> interaction links. To ensure all collaborative tasks are monitored for malfunctions, engineers must select the smallest set of robots to install diagnostic sensors, covering every interaction while minimizing equipment costs.",
        "label": "mvc",
        "index": 95
    },
    {
        "desc_split": "A co-authorship network <graph> represents researchers (nodes, <num_nodes>) and collaborations (edges, <num_edges>). Partitioning researchers into two teams to maximize inter-team collaborations fosters interdisciplinary innovation while maintaining focused intra-team expertise.",
        "label": "maxcut",
        "index": 48
    },
    {
        "desc_split": "In museology, the <graph> documents shared historical ownership between artifacts, where 1 proves documented transfer links and 0 unconnected provenance. Identifying the largest group of interlinked artifacts helps authenticate collections and trace stolen heritage.",
        "label": "maxclique",
        "index": 36
    },
    {
        "desc_split": "For research institutions, the <graph> reflects co-authorship among scholars, where 1 denotes joint publications and 0 means no collaborative papers. Universities aim to detect the largest group of researchers who have all worked together, highlighting potential interdisciplinary teams capable of securing large grants or producing high-impact studies.",
        "label": "maxclique",
        "index": 4
    },
    {
        "desc_split": "In a cybersecurity network <graph>, where <num_nodes> represent critical infrastructure components (e.g., power plants, servers) and <num_edges> denote communication links, partitioning the nodes into two isolated groups to maximize inter-group connections helps contain cyberattacks. This ensures that a breach in one group minimally impacts the other, improving overall resilience.",
        "label": "maxcut",
        "index": 15
    },
    {
        "desc_split": "In a global cloud infrastructure represented by <graph> with <num_nodes> data centers and <num_edges> communication links, selecting a set of non-adjacent servers ensures redundancy and minimizes latency conflicts. This setup allows parallel processing while avoiding bandwidth contention between critical nodes.",
        "label": "mis",
        "index": 5
    },
    {
        "desc_split": "A delivery network <graph> connects warehouses (nodes) via routes (edges). To streamline operations, the company selects the fewest warehouses to act as hubs, ensuring every route originates or terminates at a hub. The network spans <num_nodes> warehouses and <num_edges> routes.",
        "label": "mvc",
        "index": 39
    },
    {
        "desc_split": "A tactical communication network <graph> with <num_nodes> relay stations and <num_edges> vulnerable connections requires a subset of stations to transmit securely. An MIS identifies stations that are not directly linked, preventing enemy interception by ensuring no two active relays are within eavesdropping range.",
        "label": "mis",
        "index": 11
    },
    {
        "desc_split": "A hospital floor plan is modeled as <graph>, with rooms as nodes and connecting corridors as edges. To prevent outbreaks, disinfecting robots must be stationed in rooms to cover all corridors. The objective is to minimize robot deployments while ensuring every corridor is adjacent to at least one disinfected room (<num_nodes> nodes, <num_edges> edges).",
        "label": "mvc",
        "index": 33
    },
    {
        "desc_split": "A decentralized blockchain network is modeled as <graph>, where nodes are validators and edges represent communication channels. To optimize consensus efficiency, the system must select a minimal set of validator nodes to verify all transactions, reducing redundancy while maintaining network integrity.",
        "label": "mvc",
        "index": 91
    },
    {
        "desc_split": "An electronic voting system’s audit graph <graph> links <num_nodes> voting machines via <num_edges> shared verification protocols. To detect tampering, auditors must inspect the smallest set of machines to cover all protocol edges, ensuring election transparency efficiently.",
        "label": "mvc",
        "index": 94
    },
    {
        "desc_split": "In vehicle diagnostics, the <graph> represents sensor dependencies, where 1 indicates a functional interaction between sensors and 0 no interaction. Identifying the largest group of mutually dependent sensors helps isolate systemic faults, improving repair accuracy and reducing downtime.",
        "label": "maxclique",
        "index": 82
    },
    {
        "desc_split": "In an NFT similarity graph <graph>, artworks are nodes and edges represent stylistic overlap. Partitioning the collection into two exhibitions to maximize cross-exhibition similarities ensures thematic diversity within each exhibit, enhancing viewer engagement.",
        "label": "maxcut",
        "index": 34
    },
    {
        "desc_split": "In an edge computing network represented as <graph>, where <num_nodes> devices (e.g., IoT sensors, servers) are connected via <num_edges> communication links, the Max-Cut problem helps partition devices into two clusters to maximize inter-cluster data transfer. This ensures efficient load balancing and minimizes latency for critical real-time applications.",
        "label": "maxcut",
        "index": 70
    },
    {
        "desc_split": "A forest is mapped as <graph>, where trees (<num_nodes> nodes) are connected if their root systems overlap (<num_edges> edges). An MIS identifies trees that can be harvested without destabilizing neighboring trees, ensuring sustainable logging and soil preservation.",
        "label": "mis",
        "index": 28
    },
    {
        "desc_split": "For biochemists, the <graph> maps enzyme-substrate relationships (1 = catalyzes reaction, 0 = no interaction). Determining the largest cluster of mutually interacting enzymes pinpoints central metabolic cascades for targeted drug development.",
        "label": "maxclique",
        "index": 41
    },
    {
        "desc_split": "In a factory’s IoT device network <graph> (<num_nodes> devices, <num_edges> connections), engineers must select devices to update firmware such that all connected pairs are covered. This minimizes downtime while ensuring compatibility across the network.",
        "label": "mvc",
        "index": 93
    },
    {
        "desc_split": "A greenhouse’s plant layout is represented as <graph>, where nodes are plant clusters and edges are pest migration paths. To deploy traps efficiently, the goal is to cover all paths by placing traps in the minimal number of clusters (<num_nodes> nodes, <num_edges> edges), ensuring pest control with minimal resource use.",
        "label": "mvc",
        "index": 79
    },
    {
        "desc_split": "In a nutrient-interaction graph <graph>, nodes are food items and edges indicate complementary nutritional profiles. Dividing foods into two meal groups to maximize complementary pairs across groups ensures balanced daily intake while avoiding nutrient redundancy. The graph includes <num_nodes> foods and <num_edges> nutrient synergies.",
        "label": "maxcut",
        "index": 68
    },
    {
        "desc_split": "In a federated learning network <graph> with <num_nodes> client devices and <num_edges> data similarity links, Max-Cut divides clients into two groups to maximize differences between groups. This ensures diverse local model updates, reducing bias and improving global model convergence during collaborative training.",
        "label": "maxcut",
        "index": 74
    },
    {
        "desc_split": "For a digital art dataset <graph> where nodes represent artworks and edges denote stylistic similarity, splitting the collection into two maximally dissimilar groups (<num_nodes> artworks, <num_edges> style links) helps curators create contrasting exhibitions or train generative models on distinct aesthetics.",
        "label": "maxcut",
        "index": 81
    },
    {
        "desc_split": "In a farmland network <graph>, plots are <num_nodes> nodes and edges represent shared pest/disease risks. Dividing plots into two groups to maximize risk exposure between them ensures optimal crop rotation, reducing cross-contamination and improving yield resilience.",
        "label": "maxcut",
        "index": 93
    },
    {
        "desc_split": "For a logistics network <graph> with <num_nodes> warehouses and <num_edges> overlapping delivery ranges, a drone operator must choose hubs to activate simultaneously. An MIS ensures no two active hubs are within interference range, optimizing package throughput while avoiding mid-air collisions or signal jamming.",
        "label": "mis",
        "index": 77
    },
    {
        "desc_split": "In a cloud infrastructure represented as <graph>, virtual machines (VMs) are <num_nodes> nodes, and communication dependencies between them are <num_edges> edges. Partitioning VMs into two clusters to maximize inter-cluster communication ensures efficient resource utilization, reduces latency, and minimizes contention within each cluster.",
        "label": "maxcut",
        "index": 40
    },
    {
        "desc_split": "A disaster relief logistics network <graph> models <num_nodes> locations (e.g., hospitals, supply depots) and <num_edges> transportation routes. By splitting locations into two groups to maximize route crossings, responders can strategically position resources to ensure rapid access from either cluster, improving coverage during emergencies.",
        "label": "maxcut",
        "index": 71
    },
    {
        "desc_split": "In a mining region graph <graph> with <num_nodes> sites and <num_edges> environmental conflict edges (e.g., shared watersheds), regulators must approve sites that do not mutually degrade ecosystems. A maximal independent set ensures sustainable extraction while minimizing ecological damage.",
        "label": "mis",
        "index": 82
    },
    {
        "desc_split": "In aerospace engineering, the <graph> tracks cross-link capabilities between satellites, where 1 signifies operational communication links and 0 represents unavailable connections. Determining the largest fully interconnected cluster guarantees robust intersatellite networking for critical data relay missions in orbital constellations.",
        "label": "maxclique",
        "index": 64
    },
    {
        "desc_split": "In a nutrient interaction graph <graph> with <num_nodes> food items and <num_edges> representing incompatible nutrient pairs (e.g., iron-calcium), partitioning foods into two meal plans to maximize incompatibilities between plans ensures balanced diets while minimizing adverse interactions within each meal.",
        "label": "maxcut",
        "index": 37
    },
    {
        "desc_split": "In multiplayer gaming communities, the <graph> represents player compatibility, with 1 indicating a successful past team-up and 0 a lack of synergy. The challenge is to assemble the largest group of players who have all collaborated positively, ensuring a harmonious and high-performing clan for competitive matches.",
        "label": "maxclique",
        "index": 18
    },
    {
        "desc_split": "In civil engineering projects, the <graph> charts physical connectivity between underground utility conduits (1 for confirmed interlinked pipes/cables, 0 for isolated systems). Municipalities require detection of maximally interconnected infrastructure clusters to prioritize maintenance areas where systemic failures could cascade through interdependent utility networks beneath urban environments.",
        "label": "maxclique",
        "index": 76
    },
    {
        "desc_split": "In a penetration testing simulation <graph>, nodes represent attack surfaces (e.g., servers, APIs), and edges denote vulnerabilities shared between them. Splitting the surfaces into two teams (red vs. blue) to maximize cross-team vulnerabilities ensures a rigorous security assessment, with <num_nodes> targets and <num_edges> exploit paths.",
        "label": "maxcut",
        "index": 1
    },
    {
        "desc_split": "A museum’s floor plan is modeled as <graph>, where nodes are rooms and edges are doorways. Security guards must be stationed to cover all pathways. The MVC solution identifies the fewest rooms to place guards so every doorway is watched. The layout includes <num_nodes> rooms and <num_edges> doorways.",
        "label": "mvc",
        "index": 37
    },
    {
        "desc_split": "In an outbreak scenario, a contact tracing graph <graph> with <num_nodes> individuals and <num_edges> interactions is analyzed. To identify all potential infections, health officials must test the smallest possible group of people such that every close contact pair includes at least one tested individual, optimizing testing resources.",
        "label": "mvc",
        "index": 0
    },
    {
        "desc_split": "In an edge network <graph> with <num_nodes> servers and <num_edges> latency-critical links, an MIS selects servers to process independent tasks in parallel. This avoids redundant computations in interconnected nodes, optimizing resource usage for real-time applications like autonomous vehicles.",
        "label": "mis",
        "index": 29
    },
    {
        "desc_split": "A satellite proximity graph <graph> with <num_nodes> debris objects and <num_edges> collision risks can be split into two orbital zones. Maximizing risky edges between zones reduces intra-zone collisions, simplifying debris mitigation strategies for space agencies.",
        "label": "maxcut",
        "index": 38
    },
    {
        "desc_split": "In power distribution systems, the <graph> represents connections between grid components, with 1 indicating a functional link and 0 a disconnected state. The task is to locate the largest subset of components that are all interlinked, ensuring localized stability during outages and improving failure containment strategies.",
        "label": "maxclique",
        "index": 15
    },
    {
        "desc_split": "For digital marketing strategies, the <graph> reflects audience overlap between social media influencers (1 denoting shared follower demographics, 0 showing divergent audiences). Brands aim to pinpoint the largest cohort of influencers with interconnected follower bases to maximize campaign reach while ensuring message consistency across partnered content creators.",
        "label": "maxclique",
        "index": 75
    },
    {
        "desc_split": "A warehouse with <num_nodes> robot zones and <num_edges> overlapping paths requires charging stations to be placed such that no two stations are adjacent. This ensures robots can recharge without traffic jams, optimizing workflow in <graph>.",
        "label": "mis",
        "index": 91
    },
    {
        "desc_split": "The <graph> in venture capital maps co-investment relationships between firms, with 1 denoting a shared investment and 0 none. The goal is to uncover the largest syndicate of firms that have all invested together, revealing strategic alliances or concentrated market influence.",
        "label": "maxclique",
        "index": 78
    },
    {
        "desc_split": "For multiplayer games, the <graph> reflects win-rate compatibility between players, where 1 shows synergistic pairing and 0 poor coordination. The objective is to assemble the largest possible team where every member performs optimally with all others, enhancing tournament success rates.",
        "label": "maxclique",
        "index": 48
    },
    {
        "desc_split": "A gig-economy platform uses <graph> to map workers (nodes) and task dependencies (edges). Splitting <num_nodes> workers into two teams to maximize task handoffs between teams optimizes parallel task completion while reducing intra-team coordination overhead (<num_edges> dependencies).",
        "label": "maxcut",
        "index": 28
    },
    {
        "desc_split": "Within the luxury goods market, the <graph> encodes shared rare components among high-end watches, with 1 indicating a matching component and 0 showing no overlap. Identifying the largest cluster of watches sharing identical rare parts can expose counterfeit rings or validate provenance in auctions and resale markets.",
        "label": "maxclique",
        "index": 30
    },
    {
        "desc_split": "A factory’s robot collaboration network is a <graph> with <num_nodes> robots and <num_edges> shared workspaces. To predict failures, engineers must install diagnostic modules on the fewest robots such that every shared workspace is monitored by at least one module. MVC optimizes this selection for cost-efficient predictive maintenance.",
        "label": "mvc",
        "index": 72
    },
    {
        "desc_split": "In a power distribution network modeled as <graph> with <num_nodes> substations and <num_edges> transmission lines, a utility provider must activate a subset of microgrids such that no two active microgrids share a direct connection. This ensures localized power autonomy while preventing cascading failures due to interdependent loads.",
        "label": "mis",
        "index": 75
    },
    {
        "desc_split": "A smart city’s parking infrastructure is modeled as <graph> (<num_nodes> spots, <num_edges> adjacent pairs). An MIS allocates spots to drivers such that no two adjacent spots are occupied simultaneously, reducing congestion and optimizing space utilization in high-demand areas.",
        "label": "mis",
        "index": 74
    },
    {
        "desc_split": "In a heritage site dependency graph <graph> with <num_nodes> artifacts and <num_edges> shared conservation risks (e.g., humidity sensitivity), partitioning artifacts into two preservation groups to maximize risk edges between them ensures that each group’s internal vulnerabilities are minimized, optimizing resource allocation.",
        "label": "maxcut",
        "index": 39
    },
    {
        "desc_split": "In quantum hardware design, <graph> denotes error-free entanglement pairs between qubits (1 = stable linkage, 0 = incoherent coupling). Determining the largest fully-interconnected set of quantum bits enables the construction of more powerful processors by isolating reliable computation blocks.",
        "label": "maxclique",
        "index": 60
    },
    {
        "desc_split": "A financial transaction graph <graph> links <num_nodes> accounts via <num_edges> transfers. Auditors must flag the minimal set of accounts to investigate, ensuring every transaction involves at least one flagged account, thereby uncovering potential fraud rings with limited resources.",
        "label": "mvc",
        "index": 4
    },
    {
        "desc_split": "In a vehicle communication network <graph>, autonomous cars are <num_nodes> nodes and proximity-based interactions are <num_edges> edges. Splitting vehicles into two platoons to maximize inter-platoon communication optimizes traffic flow and reduces congestion while maintaining safe coordination.",
        "label": "maxcut",
        "index": 14
    },
    {
        "desc_split": "A website network <graph> has <num_nodes> pages and <num_edges> hyperlinks. Advertisers want to place banners on the fewest pages possible while ensuring every hyperlink originates from or points to at least one page with an ad, maximizing visibility cost-effectively.",
        "label": "mvc",
        "index": 13
    },
    {
        "desc_split": "In a peer-to-peer storage network <graph> with <num_nodes> nodes and <num_edges> latency-sensitive connections, partitioning nodes into two shards to maximize cross-shard edges ensures redundant data placement across distant nodes, optimizing fault tolerance and access speed.",
        "label": "maxcut",
        "index": 82
    },
    {
        "desc_split": "For a regional power grid <graph> with <num_nodes> energy nodes (solar/wind farms) and <num_edges> transmission lines, partitioning nodes into two self-sufficient microgrids while maximizing inter-grid connections improves fault tolerance and enables dynamic energy trading during outages.",
        "label": "maxcut",
        "index": 87
    },
    {
        "desc_split": "In the music industry, the <graph> represents potential legal conflicts between samples used in songs, where 1 indicates a clear similarity requiring clearance and 0 signifies no conflict. Identifying the largest group of samples that all potentially conflict with one another helps artists and labels preemptively resolve legal hurdles and streamline production.",
        "label": "maxclique",
        "index": 77
    },
    {
        "desc_split": "A disease spread network <graph> has <num_nodes> population hubs and <num_edges> transmission routes. Partitioning hubs into two vaccine priority groups to maximize cross-group transmission edges helps contain outbreaks by targeting bridges in the contagion network.",
        "label": "maxcut",
        "index": 57
    },
    {
        "desc_split": "In a song similarity graph <graph>, tracks are <num_nodes> nodes, and edges reflect acoustic or thematic similarity. Splitting songs into two playlists to maximize dissimilarity between them ensures diverse listening experiences, reducing monotony while maintaining cohesion within each playlist.",
        "label": "maxcut",
        "index": 44
    },
    {
        "desc_split": "For machine learning, the <graph> flags feature correlations, where 1 denotes strong interdependence and 0 independence. Locating the largest set of interlinked features enables targeted data augmentation, enhancing model performance efficiently.",
        "label": "maxclique",
        "index": 84
    },
    {
        "desc_split": "In computational chemistry, the <graph> maps atomic bonding patterns within complex molecules (1 for stable bonds, 0 for repulsive pairs). Researchers seek to isolate the largest set of atoms exhibiting mutual bonding stability to predict viable molecular configurations for pharmaceutical applications or materials science breakthroughs.",
        "label": "maxclique",
        "index": 74
    },
    {
        "desc_split": "For an ocean floor mapped as <graph> with <num_nodes> exploration sites and <num_edges> overlapping sonar ranges, AUVs must visit sites that are sufficiently distant to avoid interference. The MIS maximizes data collection efficiency while preventing sensor collisions.",
        "label": "mis",
        "index": 42
    },
    {
        "desc_split": "In archival research, the <graph> tracks citations between documents, with 1 marking a direct reference and 0 its absence. Isolating the largest set of mutually citing documents highlights core historical narratives or pivotal texts in a corpus.",
        "label": "maxclique",
        "index": 80
    },
    {
        "desc_split": "In a federated learning system modeled by <graph> with <num_nodes> nodes and <num_edges> edges, selecting a maximal independent set of devices ensures that no two training nodes share overlapping data sources. This prevents bias amplification while maximizing parallel model updates across geographically dispersed devices.",
        "label": "mis",
        "index": 20
    },
    {
        "desc_split": "In an Internet of Things (IoT) network represented by <graph> with <num_nodes> devices and <num_edges> interference links, a subset of devices must be activated simultaneously without causing signal overlap. An MIS ensures that selected devices operate independently, maximizing coverage while minimizing interference.",
        "label": "mis",
        "index": 10
    },
    {
        "desc_split": "A global air travel network <graph> with <num_nodes> cities and <num_edges> flight routes can be divided into two regions to maximize inter-region flights. This optimizes travel restrictions by containing outbreaks within regions while minimizing economic disruption to long-haul routes.",
        "label": "maxcut",
        "index": 99
    },
    {
        "desc_split": "In software engineering, the <graph> reflects interdependent vulnerabilities in a codebase, where 1 signifies that two vulnerabilities can be exploited together and 0 means they are independent. The task is to isolate the most extensive group of interconnected vulnerabilities, helping developers prioritize patches that mitigate the highest-risk exploit chains.",
        "label": "maxclique",
        "index": 29
    },
    {
        "desc_split": "An artist collaboration network <graph> with <num_nodes> artists and <num_edges> shared galleries requires selecting independent bidders for auctions to avoid price manipulation. The MIS guarantees fair bidding by preventing collusion among directly connected artists.",
        "label": "mis",
        "index": 44
    },
    {
        "desc_split": "In healthcare research, the <graph> captures relationships between diagnostic tests, with 1 representing a statistically significant correlation between two tests and 0 indicating no observed link. The objective is to discover the largest subset of tests that all correlate with one another, aiding physicians in identifying redundant tests or uncovering hidden diagnostic patterns that could streamline patient evaluations.",
        "label": "maxclique",
        "index": 96
    },
    {
        "desc_split": "A content-sharing network <graph> links users (nodes) who share licensed media (edges). To enforce copyright, the platform must monitor a subset of users covering all shared content. The MVC solution minimizes the number of monitored accounts while ensuring no unauthorized sharing goes undetected.",
        "label": "mvc",
        "index": 22
    },
    {
        "desc_split": "In sports analytics, the <graph> captures player interactions during games, where 1 indicates a strong on-field synergy and 0 shows minimal collaboration. The goal is to identify the largest group of players who consistently work well together, aiding coaches in forming optimal lineups for peak performance.",
        "label": "maxclique",
        "index": 5
    },
    {
        "desc_split": "In Hollywood productions, the <graph> shows shared appearances among actors (1 = co-starred in films, 0 = never worked together). Identifying the largest ensemble with mutual on-screen history aids studios in assembling familiar casts to boost audience engagement.",
        "label": "maxclique",
        "index": 39
    },
    {
        "desc_split": "For autonomous vehicles, the <graph> shows redundancy between sensor pairs, with 1 indicating consistent readings and 0 divergence. Locating the largest cluster of perfectly aligned sensors ensures failsafe perception systems critical for passenger safety.",
        "label": "maxclique",
        "index": 35
    },
    {
        "desc_split": "An online marketplace models its vendor-influencer partnerships as <graph> (<num_nodes> influencers, <num_edges> shared audience overlaps). Selecting an MIS ensures promoted products reach distinct customer segments, avoiding redundant ads and maximizing campaign ROI.",
        "label": "mis",
        "index": 58
    }
]