[
    {
        "desc_split": "A construction equipment rental firm delivers bulldozers, cranes, and other machinery to job sites (linehaul) and later retrieves them once projects are completed (backhaul). Each truck’s capacity <capacity> must accommodate both outbound machinery and returned equipment. However, vehicles must first complete all deliveries before starting pickups to prevent overloading or mixed routing inefficiencies. The locations of the depot and job sites is <locs>, with machinery delivery demand <demand_linehaul> and return demand <demand_backhaul>. The goal is to optimize routes to reduce fuel costs and ensure timely equipment turnover without violating vehicle load limits.",
        "label": "vrpb",
        "index": 71
    },
    {
        "desc_split": "A diagnostic lab dispatches mobile units from a central facility (`<loc_depot>`) to:  \n1. Deliver medical supplies to clinics (`<demand_linehaul>`).  \n2. Collect lab samples from the same clinics (`<demand_backhaul>`).  \nUnits (capacity: `<capacity>`) must adhere to:  \n- **Time windows** (`<time_windows>`): Clinics have strict sample collection hours (e.g., 9–11 AM).  \n- **Distance limits** (`<distance_limit>`): Units cannot exceed 200 km/day due to refrigeration limits.  \n- **Mixed backhauls**: A unit might deliver supplies to Clinic A, then collect samples from Clinic B.  \n*Goal*: Ensure all clinics are served within constraints while minimizing fleet size.",
        "label": "ovrpmbltw",
        "index": 2
    },
    {
        "desc_split": "A space agency maintains <num_customer> remote satellite tracking stations (<loc_customer>) across a desert region. Technicians depart from headquarters (<loc_depot>) in rugged vehicles carrying repair parts (<demand_linehaul>) and data storage units (<capacity>). They perform both equipment servicing and collect recorded space telemetry (<demand_backhaul>) in adaptable sequences. Extreme environment constraints limit each route to <distance_limit> km before requiring shelter. Teams overnight at their final station rather than returning daily. The objective is to maximize scientific data recovery while maintaining critical infrastructure within harsh operational limits.",
        "label": "ovrpmbl",
        "index": 69
    },
    {
        "desc_split": "A logistics firm transports fragile, high-value artworks to museums across the city for simultaneous exhibitions. Each artwork has a unique weight (<demand>), and trucks must not exceed their payload capacity (C). Vehicles start at an art storage facility (<loc_depot>) and end at their final delivery point (O). Routes must adhere to strict distance limits (L) to prevent excessive wear on the vehicles and ensure timely deliveries. Museums impose tight time windows (TW) to coordinate with installation crews, demanding precise arrival times to avoid halting exhibition setup.",
        "label": "ovrpltw",
        "index": 31
    },
    {
        "desc_split": "A healthcare provider operates mobile vaccine clinics that visit neighborhoods (<loc_customer>) to administer vaccines (<demand_linehaul>) and collect blood samples (<demand_backhaul>) for testing. Vehicles with capacity <capacity> start at a central hub (<loc_depot>) and must visit locations within strict time windows (<time_windows>) due to patient appointments. Clinics can perform deliveries (vaccines) and pickups (samples) in any order. After the final stop, vehicles remain on-site for next-day operations (open routes). The goal is to minimize travel time while ensuring no vehicle exceeds capacity and all time-sensitive medical tasks are completed.",
        "label": "ovrpmbtw",
        "index": 30
    },
    {
        "desc_split": "Technicians deploy from a central facility (<loc_depot>) to service IoT sensors across the city (<loc_customer>). Vehicles carry replacement parts (<demand_linehaul>) and collect faulty units (<demand_backhaul>), with mixed sequencing allowed. Each sensor has a calibration time window (<time_windows>) and requires <service_time> minutes for maintenance. Battery-powered service carts have limited range (<distance_limit>) and payload capacity (<capacity>). Teams conclude shifts at their last assignment.",
        "label": "ovrpmbltw",
        "index": 62
    },
    {
        "desc_split": "A marine research institute services a network of sensor buoys along a coastline. Maintenance vessels (<capacity>) launch from port (<loc_depot>) to both replenish buoy power cells (<demand_linehaul>) and retrieve data modules (<demand_backhaul>) at waypoints (<loc_customer>). Strict fuel constraints (<distance_limit>) prevent vessels from returning to port, requiring them to dock at coastal stations after final service.",
        "label": "ovrpmbl",
        "index": 77
    },
    {
        "desc_split": "A conservation group must urgently relocate endangered animals from rescue centers to protected habitats. Each habitat (customer) has a time window for arrival to avoid extreme temperatures and requires specific crates (demand) within a vehicle's capacity. Vehicles depart from the central depot but end routes at the final habitat, adhering to strict distance limits to ensure animal safety during transit. Routes must balance load limits, time-sensitive arrival windows, and maximum travel distances to prevent stress on the animals.",
        "label": "ovrpltw",
        "index": 95
    },
    {
        "desc_split": "A mobile veterinary service operates across rural areas, delivering vaccines and medical supplies to farms (<demand_linehaul>) while simultaneously rescuing injured/stray animals (<demand_backhaul>) for transport to shelters. Vehicles (capacity <capacity>) depart from a central clinic (<loc_depot>) and must visit <num_customer> locations (<loc_customer>), sequencing deliveries and pickups flexibly. Routes cannot exceed <distance_limit> km due to refrigerated medication storage limits. Vehicles end routes at the last stop without returning.",
        "label": "ovrpmbl",
        "index": 25
    },
    {
        "desc_split": "A healthcare nonprofit sets up temporary clinics in underserved rural areas. Medical supplies (medications, diagnostic tools) must first be delivered to clinic locations (<loc_customer>), followed by the collection of used or expired equipment for sterilization or disposal. Each vehicle (<capacity>) must complete all deliveries before collecting items (backhaul) to prevent contamination risks. Routes are open-ended, ending at the final clinic visited. The goal is to optimize routes to ensure clinics receive supplies promptly while efficiently consolidating returned equipment within capacity limits.",
        "label": "ovrpb",
        "index": 81
    },
    {
        "desc_split": "An underwater archaeology team must redeploy excavation equipment between submerged sites (<loc_customer>). Submersibles (<capacity> kg) transport tools and artifacts but are limited by dive-time constraints (<distance_limit> meters depth/minute), necessitating return to surface support vessels. Excavation operations require precise timing (<time_windows>) to coincide with tidal windows and daylight hours, ensuring equipment arrives at each site when water visibility and crew availability permit safe recovery of fragile artifacts.",
        "label": "vrpltw",
        "index": 97
    },
    {
        "desc_split": "A pharmaceutical distributor must deliver temperature-sensitive vaccines (<demand_linehaul>) to healthcare centers and collect expired medical supplies (<demand_backhaul>) for disposal. Vaccines must be delivered within strict time windows (<time_window>) to maintain cold-chain integrity, while pickups must follow delivery routes to avoid cross-contamination. Each refrigerated truck has a <capacity> kg limit and a maximum route distance of <distance_limit> km to prevent refrigeration failure. The challenge is optimizing routes to ensure all centers are serviced efficiently without exceeding capacity or distance constraints.",
        "label": "vrpbltw",
        "index": 1
    },
    {
        "desc_split": "In a riverine community, boats (capacity: <capacity> kg) distribute fresh produce (<demand_linehaul>) to floating vendors (<loc_customer>) and collect organic waste (<demand_backhaul>) for composting. Starting from the riverside depot (<loc_depot>), routes must navigate waterways efficiently with <distance_limit> constraints due to fuel scarcity. Mixed sequencing accommodates tidal market schedules.",
        "label": "vrpmbl",
        "index": 33
    },
    {
        "desc_split": "A chemical company services <num_customer> industrial clients (<loc_customer>) from a secure depot (<loc_depot>). Specialized trucks (capacity <capacity>) deliver fresh chemicals (<demand_linehaul>) and collect spent materials (<demand_backhaul>) for disposal, with strict sequencing flexibility to accommodate urgent client needs. Routes are capped at <distance_limit> km due to hazardous material transportation regulations, requiring careful load balancing between inbound and outbound hazardous materials.",
        "label": "vrpmbl",
        "index": 84
    },
    {
        "desc_split": "A dairy cooperative distributes milk crates, cheese, and yogurt to suburban grocery stores (linehaul) and collects empty plastic crates and returnable glass bottles (backhaul). Each truck’s capacity (<capacity> kg) must prioritize perishable goods during delivery phases, then accommodate lighter but bulkier empty containers during return trips. Routes are restricted to <distance_limit> km to ensure milk freshness and timely return of reusable packaging to the processing plant.",
        "label": "vrpbl",
        "index": 54
    },
    {
        "desc_split": "Maintenance crews dispatch from an aviation hub (<loc_depot>) to regional airports (<loc_customer>) to deliver replacement aircraft parts (<demand_linehaul>). After servicing planes, they collect outdated components for recycling (<demand_backhaul>). Each truck has a <capacity> kg payload limit and must complete routes within <distance_limit> kilometers to ensure timely returns to the hub. Deliveries must precede pickups to avoid overloading vehicles before unloading. Routes end at the final airport, streamlining logistics.",
        "label": "ovrpbl",
        "index": 82
    },
    {
        "desc_split": "A lumber company supplies construction sites with timber planks and beams. Trucks departing from a regional depot (<loc_depot>) must deliver precise volumes of wood (<demand> cubic meters) to <num_customer> active construction sites at <loc_customer>. Each truck has a cargo capacity of <capacity> cubic meters. The objective is to optimize delivery routes so that all sites receive their timber requirements without overloading any vehicle, while keeping transportation costs low.",
        "label": "cvrp",
        "index": 28
    },
    {
        "desc_split": "A farm equipment rental company must deliver tractors, harvesters, and other machinery to various farms during the peak harvest season. Each farm has a specific time window during which the equipment must arrive to avoid missing the optimal harvest period. The vehicles transporting the equipment have limited capacity, so each route must ensure that the total weight or size of equipment does not exceed the vehicle's maximum capacity. The objective is to plan routes that start and end at the depot, minimize total travel distance, and ensure all equipment is delivered within the required time frames.",
        "label": "vrptw",
        "index": 90
    },
    {
        "desc_split": "A manufacturing supply company must deliver spare parts and tools to industrial facilities while collecting outdated machinery components for recycling. Each truck has a maximum capacity of :math:`Q`, requiring planners to ensure the combined weight of delivered items and collected scrap does not exceed this limit. Routes can sequence deliveries and pickups in any order to balance load efficiency. The central warehouse and 20 customer locations are at <locs>, with delivery demands of <demand_linehaul> and pickup requirements of <demand_backhaul>. The goal is to minimize total travel distance while adhering to capacity constraints and maximizing vehicle utilization.",
        "label": "vrpmb",
        "index": 10
    },
    {
        "desc_split": "A movie production company transports filming equipment (cameras, lighting) to multiple shooting locations (<demand_linehaul>) while collecting reusable props and rented gear (<demand_backhaul>) from wrap-up sites. Trucks (<capacity>) depart from a central storage warehouse (<loc_depot>), and sequences are mixed (e.g., deliver lights to Location A, pick up props from Location B, then deliver more gear to Location C). Crews remain at the last location for setup (open route). The objective is to minimize idle time and transportation costs while avoiding overloading trucks.",
        "label": "ovrpmb",
        "index": 22
    },
    {
        "desc_split": "An event organizer rents stages, sound systems, and lighting equipment for temporary outdoor concerts. After the events, they must retrieve the gear for future use. Routes must balance deliveries and pickups in any sequence, avoiding capacity overloads. The depot and 20 event venues are at <locs>, with setup demands <demand_linehaul> and retrieval demands <demand_backhaul>.",
        "label": "vrpmb",
        "index": 93
    },
    {
        "desc_split": "A textile manufacturer supplies fabric rolls to garment factories and collects leftover fabric scraps for recycling. Trucks must first deliver full fabric rolls to factories before returning to pick up scrap materials. The total weight of outgoing fabric plus collected scraps must not exceed each truck’s capacity <capacity>. The depot’s location and 20 factory sites are provided, with delivery quantities <demand_linehaul> and scrap pickup amounts <demand_backhaul>. The goal is minimizing transportation costs while ensuring no overloads and efficient scrap recovery.",
        "label": "vrpb",
        "index": 28
    },
    {
        "desc_split": "A health NGO uses mobile clinics to administer vaccines (<demand_linehaul>) and conduct health surveys (<demand_backhaul>) in underserved neighborhoods (<loc_customer>). Nurses start at a hospital (<loc_depot>), visit sites in any order (MB), and end at the last location (O). Each neighborhood has strict time windows (<time_windows>) (e.g., midday when schools are closed). Vehicles (capacity <capacity>) carry vaccines, survey kits, and cold storage, requiring capacity-aware routing to maximize coverage.",
        "label": "ovrpmbtw",
        "index": 93
    },
    {
        "desc_split": "A healthcare logistics firm redistributes MRI and CT scanners (linehaul) to hospitals while collecting biohazard-contaminated waste (backhaul) from imaging labs. Hospitals demand equipment within specific operational hours to avoid downtime, and waste must be retrieved within 4 hours of generation. Vehicles are restricted to a 250km route to ensure waste freshness and have dual capacity limits for medical gear and hazardous materials. Routes terminate at the last hospital without depot return.",
        "label": "ovrpbltw",
        "index": 68
    },
    {
        "desc_split": "An adventure sports company rents kayaks and camping gear to customers at remote lakes and campgrounds. Vehicles must deliver equipment to drop-off points by morning time windows for rentals, then return later to collect gear (backhaul) after sunset. Each truck’s capacity is constrained by equipment size, and routes must stay within daily distance limits to comply with operator shift durations. Time windows for pickups are critical to avoid leaving equipment unattended overnight.",
        "label": "vrpbltw",
        "index": 76
    },
    {
        "desc_split": "A tech company operates mobile repair vans that simultaneously deliver refurbished devices to customers and collect e-waste for recycling. Each van (capacity <capacity>) starts at the service center (<loc_depot>) and visits <num_customer> locations (<loc_customer>), where some stops require device drop-offs (<demand_linehaul>) and others need e-waste pickups (<demand_backhaul>). Time windows (<time_windows>) reflect customer availability, and routes cannot exceed <distance_limit> km due to battery constraints. Technicians finish their shifts at their last stop without returning to base.",
        "label": "ovrpmbltw",
        "index": 30
    },
    {
        "desc_split": "A healthcare provider operates mobile testing units that visit neighborhoods to conduct COVID-19 tests while simultaneously collecting completed test kits for lab analysis. Each vehicle (capacity <capacity>) starts at a central lab (<loc_depot>), visits testing sites (<loc_customer>) with time windows (<time_windows>) for optimal foot traffic, and must return within <distance_limit> km due to refrigeration requirements for samples. Deliveries (test kits) and pickups (completed samples) can be sequenced flexibly (MB) to maximize efficiency. Service times (<service_time>) include setup and sample handling.",
        "label": "vrpmbltw",
        "index": 25
    },
    {
        "desc_split": "A real estate developer is furnishing newly constructed homes in a suburban housing complex. Your team must deliver furniture kits (<demand> cubic meters per household) from a warehouse (<loc_depot>) to individual properties (<loc_customer>). Each van has a limited cargo space (<capacity> cubic meters). Design routes that maximize space utilization without overloading any vehicle, and allow drivers to finish their routes at the final delivery address. The goal is to minimize total driving distance while ensuring every home receives its furniture.",
        "label": "ovrp",
        "index": 69
    },
    {
        "desc_split": "A marine services company delivers repair parts to fishing boats and offshore platforms (<loc_customer>) and retrieves obsolete equipment for recycling. Each customer has a maintenance window (<time_windows>) when crews are available. The service vessels (<capacity>) must deliver parts first (linehaul) before hauling away scrap metal (backhaul). Routes are open-ended, concluding at the final stop to reduce fuel costs. Capacity limits ensure vessels can handle both heavy parts and bulky scrap without overloading.",
        "label": "ovrpbtw",
        "index": 29
    },
    {
        "desc_split": "A semiconductor manufacturer requires timely delivery of raw materials (<demand_linehaul>) to factories (<loc_customer>) and simultaneous pickup of hazardous waste (<demand_backhaul>). Factories operate on strict production schedules with <time_windows> to avoid halting assembly lines. Transport trucks (capacity <capacity>) must first deliver materials before collecting waste, while adhering to <distance_limit> km limits to ensure drivers return within an 8-hour shift. The depot (<loc_depot>) must optimize routes to minimize delays and comply with environmental regulations on waste transport.",
        "label": "vrpbltw",
        "index": 48
    },
    {
        "desc_split": "A recycling company services smart reverse vending machines (<loc_customer>) that accept used containers and dispense rewards. Service trucks (capacity <capacity>) start at a processing center (<loc_depot>), delivering empty reward cartridges (<demand_linehaul>) and collecting compacted recyclables (<demand_backhaul>) in any sequence. After servicing the last machine, trucks proceed to nearby maintenance facilities rather than returning to base. The system optimizes for minimal mileage while handling fluctuating machine fill levels.",
        "label": "ovrpmb",
        "index": 38
    },
    {
        "desc_split": "A renewable energy company installs new solar panels (linehaul) at residential rooftops while collecting old panels (backhaul) for recycling. Trucks departing from the depot (<loc_depot>) must first deliver panels to customers (<loc_customer>), then pick up discarded equipment. Capacity constraints (<capacity> kg) ensure vehicles aren’t overloaded with both new panels and bulky recyclables. Routes are limited to <distance_limit> km to comply with battery life and fuel efficiency targets. Technicians finish their shifts at the final installation site, avoiding unnecessary return trips.",
        "label": "ovrpbl",
        "index": 9
    },
    {
        "desc_split": "A music festival organizer must deliver specialized stage equipment (sound systems, lighting rigs, backdrops) to <num_customer> venues across a region. Each venue at <loc_customer> requires a specific set of equipment (<demand> in weight/volume), and delivery trucks from <loc_depot> have a maximum capacity of <capacity> tons. The goal is to plan routes that ensure all venues receive their equipment without overloading any truck, while minimizing total travel distance. The focus is purely on efficient loading and route optimization, as setup teams handle installation at each site without time constraints.",
        "label": "cvrp",
        "index": 35
    },
    {
        "desc_split": "A winery needs to deliver oak wine barrels to <num_customer> regional distributors. Each barrel weighs 500 kg, and trucks (<capacity> kg capacity) depart from the production facility (<loc_depot>). Distributors require varying quantities of barrels (<demand>). The winery must plan routes to avoid overloading any truck while ensuring all orders are fulfilled. The focus is on optimizing fuel use and reducing delivery time without compromising the structural integrity of the trucks.",
        "label": "cvrp",
        "index": 17
    },
    {
        "desc_split": "An EV infrastructure firm deploys new charging stations (<demand_linehaul>) to strategic locations (<loc_customer>) while collecting old, depleted batteries (<demand_backhaul>) from existing stations. Vehicles originate from the central depot (<loc_depot>), must first install stations before retrieving batteries, and cannot exceed <capacity> kg (combining equipment and battery weights). Each route must not exceed <distance_limit> km to minimize travel time and ensure timely battery recycling. Vehicles finish at the last stop to avoid unnecessary return trips.",
        "label": "ovrpbl",
        "index": 26
    },
    {
        "desc_split": "A research vessel conducting deep-sea studies requires regular resupply of equipment and provisions from a coastal base <loc_depot>. The resupply boats must deliver items to the vessel's locations <locs>, which change periodically. Each boat has a cargo capacity of <capacity> tons and must return to the base within a round-trip distance of <distance_limit> nautical miles to maintain safety and fuel efficiency. The vessel's demands at each location are <demand> tons. Plan routes ensuring all resupply needs are met without exceeding capacity or distance limits.",
        "label": "vrpl",
        "index": 54
    },
    {
        "desc_split": "A green catering supplier delivers fresh meals in reusable containers (<demand_linehaul>) to corporate clients and retrieves dirty containers (<demand_backhaul>) from prior deliveries. Clients have narrow lunchtime windows (<time_windows>), and containers occupy fixed space (capacity <capacity>). Routes must dynamically mix deliveries and pickups (e.g., dropping off breakfast at Office X before collecting yesterday’s containers from Office Y) to minimize empty runs while meeting midday deadlines.",
        "label": "vrpmbtw",
        "index": 43
    },
    {
        "desc_split": "A tech firm deploys trucks (<capacity>) from <loc_depot> to deliver new laptops (<demand_linehaul>) to offices (<loc_customer>) and retrieve outdated devices (<demand_backhaul>) for recycling. Time-critical deliveries (<time_windows>) must align with office hours, while pickups can occur flexibly during the same route. Mixed backhauls enable efficient same-trip handling of both tasks.",
        "label": "vrpmbtw",
        "index": 66
    },
    {
        "desc_split": "A company specializing in temporary event setups must deliver modular stages, lighting rigs, and power generators to venues hosting festivals, conferences, or sports events. After the events conclude, the same trucks must collect and return the equipment to the depot. Deliveries (linehaul) must occur before pickups (backhaul), and each truck’s capacity :math:`Q` must handle both the outbound heavy machinery and the inbound dismantled equipment. With 20 event locations at <locs>, the company needs optimized routes to reduce idle time and prevent overloading vehicles during retrieval phases.",
        "label": "vrpb",
        "index": 53
    },
    {
        "desc_split": "A meteorological agency needs to deploy weather balloons to monitor atmospheric conditions at remote locations. The central launch depot (<loc_depot>) sends out delivery trucks (<capacity> kg capacity) to transport instruments and helium canisters (<demand>) to scattered launch sites (<loc_customer>). Each truck must stay within a <distance_limit> km range to ensure safe return to the depot for refueling. However, once a truck completes its final delivery, it can conclude its route at the last site, avoiding redundant backtracking.",
        "label": "ovrpl",
        "index": 91
    },
    {
        "desc_split": "A company specializes in supplying heating and cooling systems to commercial buildings while also managing the recycling of outdated equipment. Trucks must deliver new HVAC units (linehaul) to installation sites and simultaneously collect old units (backhaul) for proper disposal or recycling. The warehouse and customer locations are <locs>, with delivery demands <demand_linehaul> and pickup demands <demand_backhaul>. Each vehicle has a capacity <capacity>, requiring careful planning to balance the weight and space of new and old equipment. The challenge is to design routes where deliveries and pickups can occur in any sequence, ensuring no vehicle exceeds capacity while minimizing operational costs.",
        "label": "vrpmb",
        "index": 5
    },
    {
        "desc_split": "A company operates mobile charging units to service electric vehicles (EVs) in urban areas. Each truck (capacity: <capacity> kWh) starts at a depot (<loc_depot>) and visits <num_customer> locations (<loc_customer>) to either deliver charged batteries (<demand_linehaul>) or collect depleted ones (<demand_backhaul>). Routes must be optimized to ensure no truck exceeds its energy capacity or maximum travel distance (<distance_limit> km), while allowing mixed sequences of deliveries and pickups.",
        "label": "vrpmbl",
        "index": 70
    },
    {
        "desc_split": "During a natural disaster, a telecom provider must install temporary cell towers (linehaul) in disconnected regions to restore communication. Each site has a critical time window for activation, as delays could hinder rescue efforts. After emergency response concludes, obsolete equipment must be retrieved (backhaul) for redeployment. Trucks are constrained by payload capacity, requiring optimized routes that prioritize delivery before pickup. Routes terminate at the last collection point, avoiding depot returns, while respecting time windows for both deployment and retrieval phases.",
        "label": "ovrpbtw",
        "index": 81
    },
    {
        "desc_split": "An event services company transports tables, chairs, and decor items to venues for weddings/conventions and later collects used materials for recycling or storage. Each truck must manage outbound decor deliveries (linehaul) and inbound recyclables (backhaul), which vary in weight and bulk. The mixed backhaul allows drivers to intermingle stops for setup and teardown phases. Capacity constraints ensure that bulky decor items (e.g., foldable tables) plus dense recyclables (e.g., metal frames) do not exceed the truck’s volume or weight capacity. All routes originate and terminate at the central storage depot, with stops at diverse event locations.",
        "label": "vrpmb",
        "index": 37
    },
    {
        "desc_split": "An automotive service chain requires timely delivery of new engine parts and lubricants to repair shops (linehaul), followed by collection of spent batteries and hazardous fluids (backhaul). Each vehicle must respect strict time windows set by the shops’ operational schedules. Routes must also stay within a predefined distance limit to serve rural and suburban locations efficiently, ensuring no single vehicle travels beyond its fuel range. The backhaul pickups of hazardous materials must occur *after* all deliveries to comply with safety regulations.",
        "label": "vrpbltw",
        "index": 32
    },
    {
        "desc_split": "A pharmaceutical company needs to deliver temperature-sensitive medications to <num_customer> clinics and hospitals from its central storage at <loc_depot>. Refrigerated trucks have a <capacity> kg capacity, and each clinic requires a specific quantity of medical supplies (<demand> kg). Routes must be planned to ensure all orders are fulfilled without exceeding vehicle capacities, prioritizing efficient use of resources and minimizing logistics costs.",
        "label": "cvrp",
        "index": 3
    },
    {
        "desc_split": "A production company transports sound systems, lighting rigs, and staging equipment between outdoor concert venues (<loc_customer>). Each venue has a strict setup window (<time_windows>) starting 4 hours before showtime. The trucks (<capacity>) can only carry a certain weight, and routes must not exceed a <distance_limit> to allow crews to rest between shifts. Once all equipment is unloaded at the final venue, the truck remains parked onsite to minimize logistics costs, with no need to return to the depot (<loc_depot>) that evening.",
        "label": "ovrpltw",
        "index": 17
    },
    {
        "desc_split": "A mountain rescue organization dispatches emergency gear to remote base camps and collects outdated equipment for replacement. Each camp at <loc_customer> requires safety tools (<demand_linehaul>) and returns obsolete gear (<demand_backhaul>). Helicopters or trucks must prioritize deliveries before pickups, adhering to <capacity> limits. Routes must not exceed <distance_limit> to maintain rapid response capabilities, concluding at the final camp without returning to the depot.",
        "label": "ovrpbl",
        "index": 87
    },
    {
        "desc_split": "An event rental company transports modular office furniture to conference venues (linehaul) and later removes the equipment after events conclude (backhaul). Trucks must first deliver all items to their destinations before returning to collect the furniture from venues, adhering to capacity limits. Routes terminate at the final pickup location, avoiding redundant return trips to the warehouse.",
        "label": "ovrpb",
        "index": 58
    },
    {
        "desc_split": "A music school sends instructors from a studio (<loc_depot>) to teach lessons (<demand>: instrument transport) and pick up broken instruments for repair (backhaul). Lessons require fixed student availability (<time_windows>). Vans (capacity: <capacity>) can mix teaching and pickups (MB) and conclude at instructors’ homes (O). Routes avoid highways to protect instruments (<distance_limit>).",
        "label": "ovrpmbltw",
        "index": 39
    },
    {
        "desc_split": "A mobile blood donation unit operates across the city, starting from a central hub (<loc_depot>). Each day, it must visit <num_customer> locations (<loc_customer>) to collect blood donations (<demand_backhaul>) and deliver plasma to hospitals (<demand_linehaul>), with vehicles of capacity <capacity>. Each stop has strict time windows (<time_windows>) due to donor appointments and hospital delivery schedules. The unit can sequence pickups and deliveries in any order (MB) and does not return to the hub after the final stop (O). The goal is to maximize collections and deliveries while minimizing travel time and respecting time constraints.",
        "label": "ovrpmbtw",
        "index": 10
    },
    {
        "desc_split": "A logistics company operates cargo landers delivering essential supplies like oxygen, food, and equipment to a lunar base’s various outposts (<loc_customer>). These landers must also retrieve scientific waste and defunct machinery for Earth return. Each vehicle has a maximum capacity (<capacity>) and must complete all deliveries before collecting waste to prevent contamination. Routes must stay within a <distance_limit> km limit to conserve fuel for the return trip to the central depot (<loc_depot>). The challenge is to balance payload limits while ensuring all outposts are serviced efficiently and waste is safely retrieved.",
        "label": "vrpbl",
        "index": 80
    },
    {
        "desc_split": "A renewable energy company services offshore wind turbines by delivering replacement parts (<demand_linehaul>) and retrieving worn components (<demand_backhaul>). Service vessels (<capacity> tons) must first complete deliveries before pickups, within a <distance_limit> nautical mile radius. Routes terminate at the final turbine site to conserve fuel.",
        "label": "ovrpbl",
        "index": 47
    },
    {
        "desc_split": "A marine conservation organization must transport coral fragments to restore damaged reefs in a protected marine area. The coral fragments are stored at a central depot <loc_depot>, and restoration sites are located at <loc_customer>. Each site requires <demand> kg of coral fragments. Transport vessels (e.g., boats or drones) have a maximum payload capacity of <capacity> kg and a maximum allowable travel distance of <distance_limit> km before needing to return to the depot. Design routes to ensure all restoration sites are supplied without exceeding vehicle capacity or distance limits.",
        "label": "vrpl",
        "index": 35
    },
    {
        "desc_split": "A team of marine archaeologists must transport specialized equipment to underwater excavation sites scattered across a coastal region. Divers’ vessels have limited storage capacity (<capacity>) and must stay within a travel distance (<distance_limit>) to ensure safe return to shore. The vessels complete their routes at the final site, ending their journeys there. The goal is to plan routes that deliver all required gear without overloading boats or exceeding distance limits.",
        "label": "ovrpl",
        "index": 27
    },
    {
        "desc_split": "A furniture rental company services short-term leases for offices and events. Trucks (capacity <capacity>) deliver items (<demand_linehaul>) to clients (<locs>) within narrow time windows (<time_windows>) aligned with business hours, while also picking up expired rentals (<demand_backhaul>). Service times (<service_time>) account for assembly/disassembly. Mixed backhauls allow retrieving items from one client before delivering to another if it minimizes travel distance.",
        "label": "vrpmbtw",
        "index": 56
    },
    {
        "desc_split": "A satellite operator must deploy scientific instruments to remote ground stations and retrieve data modules for analysis. Delivery trucks depart from a central hub (<loc_depot>), delivering equipment (<demand_linehaul>) to sites with strict operational time windows (<time_windows>) tied to satellite passes. After deployment, trucks must collect data modules (<demand_backhaul>) but cannot begin pickups until all deliveries are complete. Each truck has a <capacity> ton limit and must return within a <distance_limit> km range due to limited fuel and restricted access areas. The route must ensure timely equipment setup before satellite overpasses while avoiding overloading and adhering to strict environmental regulations during retrieval.",
        "label": "vrpbltw",
        "index": 70
    },
    {
        "desc_split": "A construction company must deliver steel beams and concrete (<demand> tons) to multiple job sites (<loc_customer>). Each site has a narrow time window (<time_windows>) for deliveries to avoid disrupting ongoing work (e.g., avoiding rush hour). Flatbed trucks (<capacity> ton capacity) must also return to the depot (<loc_depot>) within a <distance_limit> mile radius by <time_limit> hours to refuel and service equipment. The solution must balance traffic compliance, vehicle load limits, and strict time constraints to avoid project delays.",
        "label": "vrpltw",
        "index": 13
    },
    {
        "desc_split": "A coffee supplier delivers freshly harvested green coffee beans to specialty roasters, who require beans to arrive just before their scheduled roast times. Roaster locations are <locs>, with bean quantities <demand> and time windows <time_windows> aligned with roasting schedules. Delivery trucks have a refrigerated capacity <capacity> and travel at <speed> km/h. Service time <service_time> includes temperature verification and unloading. Routes must originate/end at the bean processing facility, minimizing travel distance while ensuring beans are delivered before their optimal roast window closes to preserve flavor profiles.",
        "label": "vrptw",
        "index": 79
    },
    {
        "desc_split": "A farm supply cooperative delivers seeds, fertilizers, and tools to farmers and collects agricultural waste (e.g., crop residues) for composting. Trucks must first complete deliveries (linehaul) before traveling to farms for pickups (backhaul). The capacity <capacity> limits the total weight of supplies and waste. With 20 farms at <locs>, delivery demands for supplies are <demand_linehaul>, and pickup volumes for waste are <demand_backhaul>. The cooperative aims to route trucks efficiently to support farming operations while managing ecological waste responsibly.",
        "label": "vrpb",
        "index": 3
    },
    {
        "desc_split": "A florist must deliver custom bouquets to venues during peak wedding season. Each bouquet has a strict delivery window (<time_windows>) to arrive just before ceremonies. Delivery trucks have limited space (<capacity>) for floral arrangements, and routes must be planned to avoid overheating perishable flowers. Distance limits (<distance_limit>) ensure blooms stay fresh overnight without requiring refrigeration stops. The aim is to minimize delays and floral spoilage while meeting all time and capacity constraints.",
        "label": "vrpltw",
        "index": 48
    },
    {
        "desc_split": "A network of coastal weather stations along a long shoreline needs regular resupply of instruments and sensors. Each station (<loc_customer>) requires a specific set of equipment (<demand> kg), but supply boats departing from a central coastal depot (<loc_depot>) can only carry up to <capacity> kg. Additionally, each boat’s route must not exceed <distance_limit> km to avoid risking fuel shortages. Boats finish their routes at the last station visited, ensuring all equipment is delivered without backtracking to the depot. The challenge is to plan efficient paths that respect weight limits and distance constraints while covering every station.",
        "label": "ovrpl",
        "index": 51
    },
    {
        "desc_split": "A healthcare provider operates mobile testing units that visit neighborhoods (<loc_customer>) to conduct COVID-19 tests. Each unit starts from a central hub (<loc_depot>) with a limited supply of test kits (<capacity>). Some locations also generate medical waste (<demand_backhaul>) that must be collected for safe disposal. The challenge is to plan routes where test kits are delivered and waste is picked up in any order, ensuring no vehicle exceeds its capacity. After the final stop, vehicles do not return to the depot, minimizing unnecessary travel.",
        "label": "ovrpmb",
        "index": 80
    },
    {
        "desc_split": "A furniture company delivers new items to customers’ homes (<loc_customer>) and collects old furniture for recycling. Deliveries must occur during customers’ specified time windows (<time_windows>), after which the trucks can pick up discarded pieces (<demand_backhaul>). Each vehicle (<capacity> cubic meters) must first complete all deliveries before initiating pickups. Routes are constrained to <distance_limit> km to comply with driver working-hour regulations, ending at the final customer’s location. The challenge is to optimize routes to minimize fuel costs while ensuring timely service and respecting capacity limits.",
        "label": "ovrpbltw",
        "index": 21
    },
    {
        "desc_split": "A non-governmental organization operates mobile medical clinics serving remote villages. The central medical hub is at <loc_depot>, and villages requiring services are at <loc_customer>. Each clinic vehicle can carry medical supplies totaling up to <capacity> kg, including equipment and medications. To ensure fuel efficiency, each vehicle must complete its route and return to the hub within <distance_limit> km. Villages require <demand> kg of supplies for their clinics. Plan routes to deliver all required supplies without exceeding vehicle capacity or distance constraints.",
        "label": "vrpl",
        "index": 97
    },
    {
        "desc_split": "A healthcare provider dispatches mobile clinics (capacity <capacity>) from a central hub (<loc_depot>) to administer vaccines in underserved neighborhoods (<loc_customer>). Each stop may involve delivering vaccines (<demand_linehaul>) and collecting biohazard waste like used syringes (<demand_backhaul>). Vehicles can visit locations in any order (mixed backhauls) and remain parked at the final site (open routes). The objective is to serve all locations while minimizing travel distance and ensuring medical waste never exceeds available storage capacity during transit.",
        "label": "ovrpmb",
        "index": 97
    },
    {
        "desc_split": "A semiconductor factory requires precise deliveries of chemicals and substrates (linehaul) to production bays within strict time windows to maintain schedules. Post-processing, hazardous waste must be collected (backhaul) and returned to the depot. Vehicles must ensure deliveries occur before pickups, stay within capacity limits, and adhere to time windows to prevent production delays. Routes end at the depot after waste retrieval, optimizing efficiency without mandatory returns.",
        "label": "ovrpbtw",
        "index": 99
    },
    {
        "desc_split": "A regional produce cooperative delivers fresh, perishable goods (e.g., berries, leafy greens) to a series of **pop-up farmers' markets**. Each market (<loc_customer>) operates only during a specific **time window** (e.g., 6 AM–10 AM for morning markets). Delivery trucks (<capacity> ton capacity) must start from the distribution center (<loc_depot>), ensuring all produce arrives before markets open. Routes are **open-ended**, concluding at the final market to avoid unnecessary return trips. The goal is to prevent spoilage while minimizing travel distance and fuel costs.",
        "label": "ovrptw",
        "index": 51
    },
    {
        "desc_split": "A non-profit distributes medical equipment (e.g., diagnostic tools, vaccines) to remote clinics for short-term health campaigns. After the campaign, unused or expired items must be collected. Deliveries must precede pickups to ensure equipment availability. Each vehicle has a capacity limit. Clinics have delivery time windows (aligned with staff schedules) and pickup deadlines after the campaign. The goal is to minimize travel distance while adhering to constraints, with routes terminating at the last pickup site.",
        "label": "ovrpbtw",
        "index": 88
    },
    {
        "desc_split": "Museums need to move sensitive artifacts between exhibition centers (<loc_customer>). Each venue has time windows (<time_window>) for unloading during off-peak hours. Climate-controlled trucks (<capacity> kg) depart from a central storage depot (<loc_depot>). Routes must stay under distance limits (<distance_limit>) to prevent temperature fluctuations. Vehicles end their routes at the final destination, avoiding unnecessary travel.",
        "label": "ovrpltw",
        "index": 68
    },
    {
        "desc_split": "A high-end hotel chain delivers amenities (e.g., toiletries, <demand_linehaul>) and collects laundry (<demand_backhaul>) from guest villas (<loc_customer>) during strict time windows (<time_windows>). Electric carts (capacity <capacity>) start at the service center (<loc_depot>), follow mixed sequences (MB), and end at the last villa (O) without exceeding battery range (<distance_limit>).",
        "label": "ovrpmbltw",
        "index": 14
    },
    {
        "desc_split": "An electronics retailer delivers new appliances (<demand_linehaul>) to customers (<loc_customer>) and collects old devices (<demand_backhaul>) for recycling. Trucks (<capacity>) depart from a warehouse (<loc_depot>), with mixed sequences of deliveries and pickups allowed. Each route must stay under <distance_limit> km to comply with driver shift regulations. The challenge is to balance load distribution and route lengths while serving all customers.",
        "label": "vrpmbl",
        "index": 21
    },
    {
        "desc_split": "A school district expands its capacity during peak enrollment periods by renting movable classroom furniture. A logistics provider uses trucks (<capacity> unit capacity) to deliver desks and chairs from a storage facility (<loc_depot>) to schools (<loc_customer>). After the semester ends, the trucks revisit the same schools to collect the furniture. The route design requires deliveries to precede pickups, ensuring classrooms are fully equipped before any items are reclaimed. Vehicles conclude routes at the last pickup point to minimize fuel waste.",
        "label": "ovrpb",
        "index": 98
    },
    {
        "desc_split": "Drones deploy from a mobile command center (<loc_depot>) to deliver emergency supplies (<demand_linehaul> kg) to disaster-stricken areas (<loc_customer>) and retrieve damage assessment kits afterward. Each delivery must occur within a 30-minute window (<time_windows>) when communication relays are active. Drones have a payload capacity of <capacity> kg and a maximum flight radius of <distance_limit> km due to battery life. After the final pickup, drones land at the nearest temporary base (no return to the command center).",
        "label": "ovrpbltw",
        "index": 93
    },
    {
        "desc_split": "Marine archaeologists require specialized equipment (diving gear, sonar arrays) to be delivered to underwater excavation sites and must later retrieve recovered artifacts. Submersible support vessels (<capacity> m³) have a strict distance limit (<distance_limit>) due to limited battery life. Deliveries must occur first, followed by artifact pickups, with time windows (<time_window>) dictated by safe diving conditions during low tide. Expeditions must conclude before tidal shifts complicate retrieval operations.",
        "label": "vrpbltw",
        "index": 59
    },
    {
        "desc_split": "A drone delivery company provides same-day package deliveries (<demand_linehaul>) and return pickups (<demand_backhaul>) in a city. Each drone has a limited battery range (<distance_limit> km), a payload capacity (<capacity> kg), and must adhere to strict time windows for customer deliveries (<time_windows>). Deliveries must occur before pickups to ensure customers receive their orders before returning items. Routes must also account for service times at each location to avoid exceeding battery limits.",
        "label": "vrpbltw",
        "index": 67
    },
    {
        "desc_split": "An educational institution must deliver standardized exam kits to testing centers across a region. Testing centers are located at <locs>, each requiring a specific number of exam bundles <demand>. Centers have strict time windows <time_windows> to ensure exams start on schedule, with a service time <service_time> for security checks. Delivery vans have a capacity <capacity> bundles and travel at <speed> km/h. Routes must originate/end at the exam distribution hub, avoiding capacity overloads and late deliveries while minimizing distance.",
        "label": "vrptw",
        "index": 29
    },
    {
        "desc_split": "A confidential document management company must both deliver empty secure storage bins to offices (<demand_linehaul>) and collect filled bins for shredding (<demand_backhaul>) using armored trucks (capacity: <capacity>). Clients (<loc_customer>) specify narrow time windows (<time_windows>) during business hours. Routes must interleave deliveries and pickups based on real-time bin fill-level alerts while ensuring trucks never exceed weight limits from combined outgoing/incoming loads.",
        "label": "vrpmbtw",
        "index": 31
    },
    {
        "desc_split": "A concert promoter hosts simultaneous events across multiple venues, each requiring security equipment (e.g., barriers, surveillance systems) to be delivered within strict time windows aligned with setup schedules. Delivery trucks must transport gear without exceeding capacity limits, optimizing routes to conclude at the last venue of each route. This ensures all venues are secured before crowds arrive while avoiding depot returns.",
        "label": "ovrptw",
        "index": 74
    },
    {
        "desc_split": "A geological survey team must deploy monitoring equipment to active volcanoes in rugged terrain. The base camp is at <loc_depot>, and monitoring sites are at <loc_customer>. Each equipment package weighs <demand> kg, and helicopters have a payload limit of <capacity> kg. Helicopters must return to base within <distance_limit> km to avoid running out of fuel. Plan routes to install all equipment without exceeding constraints.",
        "label": "vrpl",
        "index": 89
    },
    {
        "desc_split": "High-end hotels use temperature-controlled vans (capacity <capacity>) to circulate designer toiletries to properties (<loc_customer>) during morning preparation windows (<time_windows>), while collecting used linens (backhaul) from the same locations. Mixed sequencing accommodates urgent linen requests mid-route. Distance limits (<distance_limit>) ensure same-day service across metropolitan areas.",
        "label": "vrpmbltw",
        "index": 88
    },
    {
        "desc_split": "A climate control company installs new HVAC systems in commercial buildings and removes outdated units for recycling. Technicians use service vans with limited space to first deliver new units (linehaul) to client sites, then load the old systems (backhaul) for disposal. Each van’s capacity is constrained by the size and weight of HVAC components. Routes must not exceed 100km to ensure technicians can complete installations and pickups within a single shift. The objective is to minimize fuel costs by optimizing routes while adhering to vehicle limits and distance restrictions.",
        "label": "vrpbl",
        "index": 14
    },
    {
        "desc_split": "A furniture rental company manages a fleet of trucks that deliver rented items (e.g., sofas, tables) to customers and simultaneously pick up returned items needing refurbishment. Each truck has weight limits (<capacity>), and customers specify narrow delivery/pickup windows (<time_windows>) aligned with their availability. Routes must balance linehaul (new rentals) and backhaul (returns) in any order while adhering to a maximum daily driving distance (<distance_limit>) to comply with labor regulations.",
        "label": "vrpmbltw",
        "index": 51
    },
    {
        "desc_split": "A cooperative of urban farms delivers freshly harvested produce to a central processing hub at <loc_depot>. Each farm (<loc_customer>) specifies a time window (<time_windows>) for collection (e.g., morning harvest hours), and the hub must collect exactly <demand> kilograms from each site. Refrigerated trucks (<capacity> kg capacity) must complete all pickups and return to the depot before <time_limit> hours pass to prevent spoilage. Routes must also stay within a <distance_limit> mile radius to ensure timely returns for afternoon sorting.",
        "label": "vrpltw",
        "index": 11
    },
    {
        "desc_split": "A wedding rental firm delivers floral arrangements, tents, and decor to venues for ceremonies, then collects items post-event. Each venue specifies a tight time window for setup (e.g., morning before the ceremony) and teardown (after sunset). Deliveries (linehaul) must occur first to ensure setups are complete, followed by pickups (backhaul). Trucks have limited capacity due to bulky decor items like chandeliers and tables. Missed time windows risk penalties, as weddings require precise timelines. Routes must account for rural venues with limited access times.",
        "label": "vrpbtw",
        "index": 92
    },
    {
        "desc_split": "Event organizers deliver stage equipment (lights, audio systems) to venues (linehaul) before setup deadlines and retrieve it after events (backhaul). Venues enforce strict time windows for equipment access, often aligning with load-in/load-out schedules. Trucks must first deliver gear without overloading, then return later to collect it within the teardown window, balancing capacity for both outbound and inbound loads.",
        "label": "vrpbtw",
        "index": 34
    },
    {
        "desc_split": "A theater company must relocate set pieces between multiple venues for rotating productions. Each venue’s setup window (time window <time_windows>) aligns with pre-show schedules, requiring deliveries to arrive precisely. The transport trucks have a capacity <capacity> tons (weight) and dimensions (volume) constraints, traveling at <speed> km/h. Service times <service_time> include unloading/loading at each venue. The central storage depot operates within <depot_service_time> hours. The goal is to design routes that start/end at the depot, adhere to venue time windows, and avoid exceeding truck capacities, while minimizing travel distance.",
        "label": "vrptw",
        "index": 24
    },
    {
        "desc_split": "A mobile blood donation service operates vans that collect blood donations from donors at various locations (<loc_customer>) while also delivering blood samples to testing labs. Each van has a limited capacity (<capacity>) for storing blood bags and samples. Donors (linehaul) and labs (backhaul) can be visited in any order. Vans start at a central hub (<loc_depot>) but end their routes at the last lab visited (open route). Due to strict cold-chain requirements, each route must be completed within a maximum distance (<distance_limit>) to ensure sample integrity. The goal is to maximize collections and deliveries while minimizing total travel distance.",
        "label": "ovrpmbl",
        "index": 20
    },
    {
        "desc_split": "A marine research team delivers live aquatic specimens (e.g., coral samples, fish) to research vessels. Each vessel has a time window <time_windows> to align with dive schedules. Transport vehicles have a capacity <capacity> limited by oxygenation systems and water tanks. Locations are <locs>, with demands <demand>, service times <service_time>, and travel speed <speed>. The objective is to minimize travel distance while ensuring specimens arrive within time windows and survival conditions are maintained via vehicle capacity constraints.",
        "label": "vrptw",
        "index": 84
    },
    {
        "desc_split": "A satellite company deploys communication equipment to remote regions and retrieves outdated gear for maintenance. Vehicles depart from the central hub (<loc_depot>), first delivering new satellite dishes and transmitters (linehaul) to field stations (<loc_customer>). After installation, they collect obsolete equipment (backhaul) for refurbishment. Each vehicle has a capacity limit (<capacity> kg) to prevent overloading. Routes must remain open-ended, concluding at the final retrieval site. Time windows (<time_windows>) are critical for deployment during optimal weather or satellite alignment periods, while distance limits (<distance_limit> km) ensure vehicles stay within operational range without refueling.",
        "label": "ovrpbltw",
        "index": 31
    },
    {
        "desc_split": "A production company delivers stage structures, lighting rigs, and audio systems to concert venues. Each venue (<loc_customer>) imposes strict setup time windows (<time_window>) before public access begins. Delivery trucks (capacity: <capacity> tons) start from the staging warehouse (<loc_depot>), load equipment within load limits, and proceed to destinations. Routes conclude at the final unloading point. The objective is to complete deliveries within venue schedules while avoiding overloading any vehicle, ensuring shows start on time.",
        "label": "ovrptw",
        "index": 63
    },
    {
        "desc_split": "A construction firm is building infrastructure in a remote desert region. Trucks based at a central depot (<loc_depot>) must first deliver heavy machinery, building materials, and tools (<demand_linehaul>) to scattered work sites (<loc_customer>). After completing deliveries, they must collect scrap metal, excess sand, and construction debris (<demand_backhaul>) for recycling. Each truck has a limited capacity (<capacity>) to handle both outbound and return loads. The extreme desert environment imposes a strict distance limit (<distance_limit>) on routes to prevent vehicles from straying too far from water and fuel sources. The goal is to plan efficient routes that ensure all sites are supplied while maximizing the volume of recyclable waste retrieved without overextending vehicle ranges.",
        "label": "vrpbl",
        "index": 76
    },
    {
        "desc_split": "An IT firm installs new hardware (e.g., servers, workstations) at client offices while decommissioning old equipment. Vehicles (`<capacity>`) start at the tech hub `<loc_depot>` and serve `<num_customer>` clients (`<loc_customer>`). Clients may require new equipment (`<demand_linehaul>`) or removal of old devices (`<demand_backhaul>`). Routes must interleave deliveries and pickups efficiently, with technicians ending their day at the final job site.",
        "label": "ovrpmb",
        "index": 13
    },
    {
        "desc_split": "A vertical farming network requires perishable nutrients (linehaul) delivered to rooftop farms (<loc_customer>) and organic waste (backhaul) collected for composting. Delivery trucks (<capacity>) must adhere to tight time windows (<time_windows>) to preserve nutrient freshness and avoid spoilage. Routes are constrained by <distance_limit> to prioritize local farms, and vehicles end their routes at the last farm to streamline waste collection.",
        "label": "ovrpbltw",
        "index": 48
    },
    {
        "desc_split": "A national retail chain manages daily store replenishment while handling seasonal product returns. Each truck (capacity: <capacity>) departs from a distribution center (<loc_depot>) to deliver fresh inventory (<demand_linehaul>) to stores (<loc_customer>), simultaneously collecting returned items (<demand_backhaul>). Stores have strict receiving hours (<time_windows>) for deliveries, and returns must be collected before afternoon processing deadlines. Routes must dynamically alternate between deliveries and pickups based on store availability while respecting vehicle capacity limits.",
        "label": "vrpmbtw",
        "index": 15
    },
    {
        "desc_split": "A government agency is upgrading communication towers in rugged mountainous regions. Each tower site at <loc_customer> needs specific equipment (antennas, power generators, satellite dishes) with different weights. Delivery trucks from the central hub at <loc_depot> have a maximum capacity of <capacity> kg. The narrow, winding mountain roads impose strict weight limits to prevent road damage. Planners must design routes to deliver all items precisely, ensuring no truck exceeds its capacity while minimizing total driving distance and reaching even the most remote sites.",
        "label": "cvrp",
        "index": 86
    },
    {
        "desc_split": "A regional distributor supplies grocery stores with fresh produce in refrigerated trucks starting from the central warehouse (<loc_depot>). Each store (<loc_customer>) requires a specific quantity of goods (<demand>) and must receive deliveries before their morning opening hours (<time_windows>). After unloading, the trucks must collect empty crates left by stores for recycling (<demand_backhaul>). Trucks cannot exceed their <capacity> ton limit and must prioritize deliveries before pickups. Routes must stay within a maximum distance of <distance_limit> km to ensure drivers finish before dusk. The goal is to plan efficient routes that respect time windows, prevent overloading, and avoid unnecessary returns to the depot.",
        "label": "ovrpbltw",
        "index": 20
    },
    {
        "desc_split": "A wedding planning company transports floral arrangements, seating, and decor to venues before ceremonies, with strict setup time windows. After events, all items must be collected. Vehicles must deliver decor (linehaul) within time constraints, then return later to pick up items (backhaul), ensuring deliveries precede pickups. Capacity limits and timing are critical to avoid delays and logistical bottlenecks.",
        "label": "ovrpbtw",
        "index": 98
    },
    {
        "desc_split": "A seafood company services offshore fish farms (<loc_customer>) from a coastal depot (<loc_depot>) using vessels (capacity: <capacity> tons). Each visit combines:  \n- Delivering customized feed (<demand_linehaul>)  \n- Collecting mature fish (<demand_backhaul>)  \nTidal conditions create strict time windows (<time_windows>) for dock access. Vessels must complete routes within <distance_limit> nautical miles while maintaining feed freshness and live harvest viability.",
        "label": "vrpmbltw",
        "index": 83
    },
    {
        "desc_split": "An offshore wind farm operator needs to transport turbine components to installation sites in the North Sea. The depot is at <loc_depot>, and wind turbine locations are at <loc_customer>. Barges have a maximum cargo capacity of <capacity> tons and a maximum travel distance of <distance_limit> nautical miles due to fuel and safety regulations. Each turbine site requires <demand> tons of components. Design routes to deliver all parts while ensuring barges return safely to the depot without exceeding their range.",
        "label": "vrpl",
        "index": 43
    },
    {
        "desc_split": "A research organization operates Arctic research stations requiring periodic supplies (equipment, food) and waste collection. Vehicles (snowmobiles/ATVs) must first deliver supplies (<demand_linehaul>), then collect hazardous waste (<demand_backhaul>). Each vehicle has a <capacity> kg limit and must stay within a <distance_limit> km radius to ensure safe travel. Routes end at the final station, avoiding depot returns.",
        "label": "ovrpbl",
        "index": 45
    },
    {
        "desc_split": "A telecommunications company deploys submersibles to repair deep-sea internet cables. Crews must first deliver repair kits (<demand_linehaul>) to fault locations (<loc_customer>), then salvage damaged segments (<demand_backhaul>). Each repair window (<time_windows>) is dictated by ocean current patterns, with service taking <service_time> hours. Submersible vessels (capacity <capacity>) must complete repairs before surfacing within a <distance_limit> km radius of the support ship (<loc_depot>). The challenge is coordinating repair sequences, avoiding payload overloads, and meeting time-sensitive oceanic conditions.",
        "label": "vrpbltw",
        "index": 49
    },
    {
        "desc_split": "Your catering business must transport pre-prepared meals, utensils, and decor to event venues (<loc_customer>) from your central kitchen (<loc_depot>). Each event has specific catering needs (e.g., 100 plates, 50 chairs), and your delivery vans have a maximum weight limit (<capacity>). The goal is to:  \n✓ Assign deliveries so no van exceeds its capacity.  \n✓ Optimize routes to serve all events with minimal detours.  \n✓ Let drivers finish at the last venue, eliminating redundant backtracking.  \nThis streamlines logistics and ensures timely setup for events.",
        "label": "ovrp",
        "index": 3
    },
    {
        "desc_split": "An office solutions provider delivers new desks and chairs to corporate clients while collecting outdated electronics like printers and monitors for recycling. The mixed backhaul approach enables drivers to serve delivery and pickup stops in any order, such as furnishing a startup’s workspace and then collecting e-waste from a neighboring law firm. The vehicle capacity <capacity> must balance the volume of large furniture items with the weight of electronics. Locations <locs> include office buildings and warehouses, with delivery demands <demand_linehaul> and e-waste pickup targets <demand_backhaul>.",
        "label": "vrpmb",
        "index": 33
    },
    {
        "desc_split": "Health workers use mobile clinics to administer vaccines (<demand_linehaul>) and conduct community health surveys (<demand_backhaul>) across neighborhoods (<loc_customer>). Each vehicle carries <capacity> units of medical supplies from a distribution center (<loc_depot>). Locations specify narrow service windows (<time_windows>) corresponding to local events or high foot traffic periods. Clinics can perform vaccinations and surveys in any order (MB) based on real-time demand, with teams permitted to conclude operations at their final stop (O) rather than returning to base. The objective is to maximize community coverage while respecting cold chain storage limits and time-sensitive appointment blocks.",
        "label": "ovrpmbtw",
        "index": 72
    },
    {
        "desc_split": "A meteorological agency must replenish equipment and supplies at remote mountain weather stations. The stations are accessible only via narrow, icy roads, limiting trucks to a maximum load of <capacity> kg. The rugged terrain and unpredictable weather force vehicles to return to the base depot <loc_depot> within <distance_limit> km to avoid being stranded. Determine routes to supply all stations without overloading trucks or exceeding travel limits.",
        "label": "vrpl",
        "index": 57
    },
    {
        "desc_split": "A space agency must deliver specialized equipment to multiple remote satellite launch sites scattered across a desert region. Each site requires specific components (e.g., rocket parts, calibration tools) with varying weights. The transport trucks have a maximum load capacity of <capacity> tons and must stay within a predefined distance limit (<distance_limit> km) from the central depot due to fuel and logistical constraints. The trucks do not return to the depot after completing their assigned deliveries. The goal is to plan efficient routes that ensure all equipment reaches its destination without overloading any vehicle or exceeding the distance limits.",
        "label": "ovrpl",
        "index": 40
    },
    {
        "desc_split": "A construction equipment rental firm delivers machinery to job sites and later collects it after use. Deliveries (linehaul) of excavators or cranes must precede pickups (backhaul) of equipment. Each site has a time window for equipment delivery (e.g., morning setup) and pickup (e.g., post-construction). Vehicles cannot exceed capacity limits for weight and volume, must stay within daily distance constraints, and finish routes at the final site. This ensures timely equipment availability while optimizing fuel use and route efficiency.",
        "label": "ovrpbltw",
        "index": 81
    },
    {
        "desc_split": "A nonprofit delivers medical supplies (<demand_linehaul>) like vaccines and diagnostic kits to remote clinics (<loc_customer>) in mountainous regions. Simultaneously, it collects hazardous medical waste (<demand_backhaul>) for safe disposal at a central depot (<loc_depot>). Off-road vehicles (<capacity> kg capacity) must first supply clinics before transporting waste, adhering to a <distance_limit> km limit to avoid running out of fuel. Routes start at the depot, traverse rugged terrain, and terminate at the last clinic, ensuring no backtracking while balancing payload constraints. This minimizes delays in both aid delivery and waste management for underserved areas.",
        "label": "ovrpbl",
        "index": 34
    },
    {
        "desc_split": "A company rents temporary fencing and security barriers for events like concerts or festivals. Vehicles must first deliver barriers to venues (linehaul) and later collect them (backhaul) for redistribution. The depot is the central warehouse. Routes must ensure deliveries happen before pickups to avoid setup delays, with total load constrained by capacity <capacity>. The depot and 20 customer sites are <locs>, with delivery demands <demand_linehaul> and pickup demands <demand_backhaul>.",
        "label": "vrpb",
        "index": 89
    },
    {
        "desc_split": "A logistics firm supports research bases in Antarctica using snowcats (capacity <capacity>). Vehicles must:  \n- Deliver supplies from a coastal depot (<loc_depot>) to inland stations (<loc_customer>, demand <demand_linehaul>).  \n- Collect recyclables and waste from stations (<demand_backhaul>).  \nMixed sequences are allowed, but extreme cold limits daily travel to <distance_limit> km. Routes must avoid overloading while servicing all stations before blizzard season.",
        "label": "vrpmbl",
        "index": 67
    },
    {
        "desc_split": "A film production company redistributes camera gear, lighting rigs, and sets between multiple filming locations (<loc_customer>). Equipment demands (<demand>) vary per site, and trucks (<capacity>) must avoid overloading to prevent damage. Crews require gear by specific call times (<time_windows>), and vehicles end their routes at the final location to minimize downtime between shoots.",
        "label": "ovrptw",
        "index": 28
    },
    {
        "desc_split": "A courier service delivers time-sensitive legal documents to law firms and courts <locs> that require strict delivery deadlines <time_windows>. Each document bundle has a volume <demand>, and couriers can carry a maximum load <capacity>. Vehicles travel at <speed> km/h, with service time <service_time> for signature verification. Routes must originate and terminate at the central office, ensuring all documents arrive before court filing cutoffs.",
        "label": "vrptw",
        "index": 8
    },
    {
        "desc_split": "An educational company delivers interactive science booths to schools and collects them after school hours. Each school has a delivery time window before classes begin and a pickup window after dismissal. Delivery vehicles (<capacity> capacity) must first drop off booths and then collect them later, ensuring the combined weight of booths and any returned materials stays within capacity limits. Routes must be planned to serve all schools within their schedules while minimizing travel distance.",
        "label": "vrpbtw",
        "index": 87
    },
    {
        "desc_split": "A sustainable grocer supplies fresh produce to floating market stalls (<loc_customer>) on riverside docks and collects organic waste for composting. Boats (capacity <capacity>) start at a warehouse (<loc_depot>) and must adhere to stall operating hours (<time_windows>). Deliveries (groceries) and pickups (compost) are sequenced flexibly. Vessels remain at their last stop to avoid empty return trips.",
        "label": "ovrpmbtw",
        "index": 98
    },
    {
        "desc_split": "A medical logistics firm transports time-sensitive lab samples from clinics (<demand_backhaul>) while delivering sterile supplies (<demand_linehaul>) using refrigerated vans (capacity <capacity>). Each clinic has strict time windows (<time_windows>) aligned with lab processing schedules. Vehicles (<speed>) must complete routes within <distance_limit> km to maintain temperature control. Mixed backhauls enable urgent specimen pickups mid-route when near expiration.",
        "label": "vrpmbltw",
        "index": 91
    },
    {
        "desc_split": "A safety gear rental company provides hard hats, harnesses, and protective equipment to construction sites and collects them afterward. Each truck has a capacity :math:`Q` that restricts the total weight of outgoing gear plus returned items. The mixed backhaul constraint permits sequencing deliveries and pickups in any order, as long as the combined load does not exceed capacity. The task is to plan efficient routes that ensure all sites are serviced while adhering to vehicle limits.",
        "label": "vrpmb",
        "index": 58
    },
    {
        "desc_split": "A research organization redistributes specialized equipment (lab instruments, field sensors, data loggers) from a central hub (<loc_depot>) to remote field research sites (<loc_customer>). Each site has unique equipment requirements (<demand>), and vehicles face capacity limits (<capacity>) due to rugged terrain. The goal is to design routes that deliver all items without overloading any vehicle. After the final delivery, vehicles stay at the site to support researchers, avoiding return trips. The challenge is to minimize travel distance while adhering to capacity constraints.",
        "label": "ovrp",
        "index": 94
    },
    {
        "desc_split": "A construction logistics firm delivers temporary office furniture, computers, and safety gear (linehaul) to active building sites. After the equipment is deployed, these sites generate waste materials like scrap metal, plastic packaging, and obsolete tools (backhaul) that need collection. Vehicles must first drop off all office supplies before backtracking to gather waste, as space is limited (<capacity>). Routes are open-ended, ending at the final waste collection site. The challenge is to optimize delivery and pickup sequences to reduce fuel use and ensure no truck overloads while serving all sites.",
        "label": "ovrpb",
        "index": 46
    },
    {
        "desc_split": "During a prolonged drought, a water utility company must distribute large water tanks to <num_customer> rural households and farms located in arid regions (<loc_customer>). Trucks (<capacity> liters capacity) depart from a central storage facility (<loc_depot>), and each destination requires a specific volume of water (<demand>). The goal is to plan efficient routes that cover all locations while adhering to vehicle capacity limits, ensuring critical water supplies reach every site without unnecessary detours.",
        "label": "cvrp",
        "index": 31
    },
    {
        "desc_split": "A pharmaceutical logistics company must deliver prescription medications to pharmacies from a central warehouse. Each vehicle starts at the depot (<loc_depot>), first delivering medications to pharmacies (<loc_customer>) based on their demand (<demand_linehaul>). After completing all deliveries, the vehicle proceeds to collect expired or unused medications (<demand_backhaul>) for safe disposal. The vehicle's capacity (<capacity>) must accommodate the combined weight of outgoing medications and returned items. Routes are planned to end at the last customer location, avoiding unnecessary return trips to the depot.",
        "label": "ovrpb",
        "index": 35
    },
    {
        "desc_split": "An auto parts supplier delivers new components (e.g., engines, transmissions) to mechanics (<loc_customer>) and retrieves used “cores” (recycled parts) for remanufacturing. Each vehicle starts at the warehouse (<loc_depot>), first fulfilling delivery orders (<demand_linehaul> kg) to repair shops. Only after all deliveries are completed can the truck collect cores (<demand_backhaul> kg) from the same or other locations. The vehicle’s capacity (<capacity> kg) must handle both outbound parts and inbound cores without overloading. Routes end at the last core pickup location to minimize empty driving.",
        "label": "ovrpb",
        "index": 12
    },
    {
        "desc_split": "Agricultural farms require pollination services for seasonal crops. Bees housed in hives must be transported from a central apiary depot (<loc_depot>) to multiple farm fields (<loc_customer>). Each hive has a weight of <demand> kg, and transport trucks can carry a maximum of <capacity> kg. Due to bee stress, each truck must return to the depot within <distance_limit> km to ensure hive viability. Plan routes to deliver hives to all farms while respecting truck capacity and round-trip distance limits.",
        "label": "vrpl",
        "index": 75
    },
    {
        "desc_split": "A tech retailer needs to deliver newly purchased electronics to customers’ homes and simultaneously collect old devices for recycling. Each delivery truck starts at the distribution center (<loc_depot>), first delivering gadgets like TVs or laptops (<demand_linehaul> kg) to customers’ addresses (<loc_customer>). After completing all deliveries, the truck proceeds to designated pickup points to collect e-waste (<demand_backhaul> kg), ensuring recyclables are returned to the depot. The truck’s capacity (<capacity> kg) must accommodate both outbound and return loads without exceeding limits. Routes must end at the final pickup location to avoid unnecessary return trips.",
        "label": "ovrpb",
        "index": 10
    },
    {
        "desc_split": "An agribusiness distributes seed bags to farms (<demand_linehaul>) and collects crop samples for analysis (<demand_backhaul>) during the same trip. Trucks (<capacity>) depart from a regional hub (<loc_depot>) and visit farms (<loc_customer>), optionally picking up samples before or after seed deliveries. Mixed sequencing allows efficient use of vehicle space (e.g., unloading seeds first if samples are bulky). Routes end at the final farm without returning to the hub.",
        "label": "ovrpmb",
        "index": 64
    },
    {
        "desc_split": "Farmers in a region have seasonal crops that must be harvested within specific time windows to ensure optimal quality and prevent spoilage. A logistics company uses trucks with a maximum capacity of <capacity> tons to collect crops from <num_customer> farms located at <loc_customer>. Each farm has a demand of <demand> tons and must be serviced between <time_window_start> and <time_window_end>. The trucks must start from the central processing facility at <loc_depot>, deliver all crops without exceeding their capacity, and complete their routes within a maximum distance of <distance_limit> kilometers. Routes are open-ended, meaning trucks do not return to the depot after their last pickup. The goal is to minimize total travel distance while respecting time windows and capacity constraints.",
        "label": "ovrpltw",
        "index": 50
    },
    {
        "desc_split": "A municipal team services IoT sensors across the city (<loc_customer>), delivering replacement parts (<demand_linehaul>) and retrieving full data storage units (<demand_backhaul>). Vehicles (<capacity>) must operate within sensor-specific maintenance windows (<time_windows>) to avoid disrupting traffic monitoring or environmental sensing. Mixed sequencing is critical—e.g., urgently replacing a faulty air quality sensor before collecting data from a nearby parking meter.",
        "label": "vrpmbtw",
        "index": 28
    },
    {
        "desc_split": "An airport catering service must:  \n- Deliver pre-ordered meals from kitchens (<loc_depot>) to aircraft (<loc_customer>) during boarding windows (<time_windows>)  \n- Collect unused meals and trash (MB)  \n- Operate within strict tarmac driving time limits (L)  \nRefrigerated trucks (<capacity>) complete routes without returning to base (O), prioritizing flights by departure time.",
        "label": "ovrpmbltw",
        "index": 67
    },
    {
        "desc_split": "IoT technicians optimize routes for maintaining <num_customer> municipal sensors from a central workshop (<loc_depot>). Service trucks (<capacity>) carry both replacement components (<demand_linehaul>) and decommissioned units (<demand_backhaul>). The mixed nature allows swapping faulty sensors during component deliveries when geographically efficient. Technicians end routes at their last maintenance point, as subsequent assignments may originate from different locations.",
        "label": "ovrpmb",
        "index": 58
    },
    {
        "desc_split": "A touring theater company needs to move heavy set components between performance venues (<loc_customer>). Each venue requires equipment delivery during a narrow **time window** (e.g., 2 hours before curtain-up). Trucks (<capacity> ton capacity) start from a staging warehouse (<loc_depot>), transporting props and scenery. Routes are **open-ended**, ending at the final venue to avoid delays. Time windows are critical to allow crews enough time to assemble sets before performances begin.",
        "label": "ovrptw",
        "index": 54
    },
    {
        "desc_split": "A fleet of mobile testing units operates across a city, providing COVID-19 tests at designated stops (<loc_customer>) with time-sensitive demand (<demand>). Each vehicle (capacity <capacity>) starts at a central depot (<loc_depot>), collects test samples (linehaul), and simultaneously retrieves biohazard waste (backhaul) from clinics. Time windows (<time_windows>) ensure tests are conducted during peak hours, while route distance limits (<distance_limit>) prevent driver fatigue. Mixed sequencing allows waste pickups en route to testing sites.",
        "label": "vrpmbltw",
        "index": 85
    },
    {
        "desc_split": "A network of mobile medical units must visit remote villages to provide healthcare services. Each clinic van has a limited capacity for patients (<capacity>). Villages require visits within specific time windows (<time_windows>) aligned with community availability. Routes must not exceed daily distance limits (<distance_limit>) to ensure vehicles can return to the central medical hub for restocking supplies and overnight stays. The goal is to schedule routes that meet all villages' time constraints while optimizing fuel efficiency and patient access.",
        "label": "vrpltw",
        "index": 45
    },
    {
        "desc_split": "A sports rental company supplies equipment like kayaks, bicycles, and camping gear to customers for temporary use. The company must deliver equipment to pickup locations (e.g., parks, resorts) as linehaul stops and later retrieve it after the rental period ends as backhaul stops. Each vehicle must complete all deliveries before starting pickups to avoid mixing gear types or overloading. The depot, rental sites, equipment quantities, and return schedules are fixed. The goal is to optimize routes to reduce mileage and ensure timely gear availability for subsequent rentals.",
        "label": "vrpb",
        "index": 77
    },
    {
        "desc_split": "A biotech company must collect and deliver temperature-sensitive research samples (<demand> mL) from remote field labs (<loc_customer>) to a central analysis facility. Each sample has a time-sensitive viability window (<time_windows>) and must be transported in specialized coolers. Delivery drones (<capacity> kg payload) depart from a mobile command center (<loc_depot>), with routes optimized to meet deadlines while avoiding overloading. Drones land at the final lab on their route and remain there to recharge, ensuring continuous sample flow without depot returns.",
        "label": "ovrptw",
        "index": 33
    },
    {
        "desc_split": "After a hurricane, aid teams depart from a staging area (<loc_depot>) to distribute emergency supplies (<demand_linehaul>) to shelters (<loc_customer>) while collecting salvageable materials (<demand_backhaul>) like undamaged furniture. Vehicles (<capacity>) cannot return to base; crews must prioritize routes that mix deliveries and pickups (e.g., drop off water, then collect usable goods nearby) to maximize resource utilization.",
        "label": "ovrpmb",
        "index": 33
    },
    {
        "desc_split": "Following an earthquake, aid organizations deliver medical kits, food, and water to isolated communities. Each location has a critical delivery time window (TW) to prioritize urgent needs. Relief trucks have restricted cargo capacity (C) due to fragile supplies and must stay within a daily distance limit (L) to ensure drivers can return safely for resupply. The goal is to design efficient routes that meet all time constraints, avoid overloading vehicles, and respect distance limits while reaching the most affected areas.",
        "label": "vrpltw",
        "index": 27
    },
    {
        "desc_split": "A marathon organizer needs to deliver water, medical supplies, and equipment to aid stations along the race route. Each station has a strict time window (TW) to ensure supplies are in place before runners arrive. Delivery vans (capacity C) must transport materials without exceeding load limits. Routes are open (O), concluding at the final aid station. The objective is to optimize delivery timing and vehicle utilization to avoid race delays.",
        "label": "ovrptw",
        "index": 46
    },
    {
        "desc_split": "Drones are deployed to rush critical medical supplies from a central hub (<loc_depot>) to emergency zones after earthquakes. Each disaster site (<loc_customer>) specifies a delivery window (<time_windows>) tied to evacuation phases. Drones have a maximum payload (<capacity>) and battery range (<distance_limit>), requiring precise route planning to land at the last delivery point without returning. The challenge is to maximize coverage while adhering to strict time and distance constraints to save lives efficiently.",
        "label": "ovrpltw",
        "index": 71
    },
    {
        "desc_split": "During a widespread blackout, mobile generators must be rushed to hospitals, shelters, and critical infrastructure. Each location has a time window (TW) for power restoration. The delivery trucks (C) are constrained by generator weight limits, and routes must stay within a distance limit (L) to ensure quick deployment. The vehicles depart from the energy company depot (O) and finish at the final site, prioritizing urgent needs without return trips.",
        "label": "ovrpltw",
        "index": 58
    },
    {
        "desc_split": "A coastal research organization supplies remote marine monitoring buoys with sensors and batteries while retrieving collected data pods. Boats have strict weight limits (<capacity>) due to stability requirements and must complete routes within tidal time windows (<time_windows>). Route lengths are capped (<distance_limit>) for fuel safety in open water. The mixed operations allow critical data retrievals to interrupt supply sequences when storage pods near capacity.\n```  \n\nAll scenarios emphasize:  \n- **Capacity (C)**: Explicit vehicle load limits  \n- **Mixed Backhauls (MB)**: Unrestricted sequencing of deliveries/pickups  \n- **Duration Limits (L)**: Maximum route distance/duration constraints  \n- **Time Windows (TW)**: Mandatory service time intervals  \nWhile excluding open routes, strict backhaul sequencing, and multi-depot requirements as specified.",
        "label": "vrpmbltw",
        "index": 39
    },
    {
        "desc_split": "A construction equipment rental firm delivers tools (e.g., drills, generators) to job sites (<demand_linehaul> units) and collects them post-use (<demand_backhaul> units). Rentals require precise route planning: trucks (<capacity> units) must first deliver equipment to active sites (<loc_customer>), then return to pick up returned gear. Each vehicle’s route must not exceed a distance limit (<distance_limit> km) to avoid excessive driving and ensure timely returns to the depot. The challenge is to balance load capacity and route length while minimizing total travel costs.",
        "label": "vrpbl",
        "index": 19
    },
    {
        "desc_split": "A shipping company must deliver loaded containers to coastal ports (linehaul) and collect empty containers from the same ports (backhaul). Each truck has a maximum capacity of <capacity> tons and must prioritize deliveries before pickups. The routes start at the central port depot (<loc_depot>) and end at the final port stop, with no return journey. Additionally, each route must stay within a <distance_limit> km range to ensure fuel sufficiency for round-trip operations. The goal is to minimize total travel distance while ensuring all containers are delivered and collected efficiently without overloading trucks.",
        "label": "ovrpbl",
        "index": 20
    },
    {
        "desc_split": "Blood delivery trucks (<capacity> liters) transport critical blood units to hospitals (<demand_linehaul>), which must arrive before the start of morning shifts (<time_windows>). After completing deliveries, the same trucks collect expired blood samples (<demand_backhaul>) for safe disposal. The depot (<loc_depot>) mandates that all routes stay within a <distance_limit> km radius to ensure cold-chain integrity and avoid delays. Trucks cannot exceed their capacity for either blood or waste during the round trip.",
        "label": "vrpbltw",
        "index": 87
    },
    {
        "desc_split": "Hotels across a city require fresh linens delivered daily before morning housekeeping shifts begin, followed by the collection of soiled linens after evening checkouts. Delivery trucks must first distribute clean linens to each hotel within their early morning time windows, then return to collect soiled linens during late afternoon slots. Each truck has a limited capacity (<capacity>) to balance the weight of clean linens and soiled laundry. The route must ensure that all deliveries are completed before pickups commence, avoiding overloading vehicles while adhering to strict hotel operational schedules.",
        "label": "vrpbtw",
        "index": 20
    },
    {
        "desc_split": "A mining operation requires regular tool and spare part deliveries to remote drilling sites (<loc_customer>) scattered across rugged terrain. Supplies originate from a central storage facility (<loc_depot>). Each site’s tool demand (<demand>) must be met, but trucks have limited cargo space (<capacity>). Routes must avoid overloading vehicles and prioritize efficiency, as drivers conclude their shift at the final site to assist with installation. The aim is to reduce logistics costs while ensuring critical equipment reaches all mining crews.",
        "label": "ovrp",
        "index": 54
    },
    {
        "desc_split": "A logistics firm services restaurants by delivering fresh ingredients and supplies while collecting used cooking oil and food waste for recycling or disposal. Each truck has a capacity <capacity>, requiring that the combined weight of deliveries and pickups never exceeds this limit. The order of stops can be arranged flexibly—deliveries and pickups can be interleaved to optimize routes. The depot and 20 restaurant locations are at <locs>, with delivery demands <demand_linehaul> and waste pickup requirements <demand_backhaul>. The goal is to plan routes that balance load efficiency and minimize travel costs while ensuring all customers are serviced.",
        "label": "vrpmb",
        "index": 15
    },
    {
        "desc_split": "An office supply retailer delivers printer cartridges, paper, and stationery (linehaul) to businesses. In return, customers provide empty ink cartridges, cardboard boxes, and plastic packaging (backhaul) for recycling. Delivery trucks must first complete all supply drops before collecting recyclables to prevent contamination. Each vehicle’s capacity (<capacity>) must balance the weight of new items and returned materials. Routes end at the final collection point, ensuring drivers do not backtrack to the depot. The focus is on reducing fuel costs and maximizing recycling efficiency without overloading trucks.",
        "label": "ovrpb",
        "index": 48
    },
    {
        "desc_split": "Service vessels (<capacity>) transport crews from shore bases (<loc_depot>) to multiple wind turbines (<loc_customer>), both delivering technicians and retrieving completed work teams. Routes dynamically mix drop-offs and pickups based on real-time maintenance needs, constrained by <distance_limit> nautical mile range limits. Vessels remain near the final turbine cluster after completing service rounds.",
        "label": "ovrpmbl",
        "index": 19
    },
    {
        "desc_split": "A manufacturing company needs to redistribute heavy machinery between its facilities. The central warehouse (depot) is at <loc_depot>, and receiving plants are at <loc_customer>. Each transport truck can carry a maximum weight of <capacity> tons. Due to fuel and logistical constraints, no route can exceed <distance_limit> kilometers round-trip. The equipment demand for each plant is <demand> tons. Plan routes to deliver all machinery while respecting capacity and distance limits, minimizing total travel distance.",
        "label": "vrpl",
        "index": 19
    },
    {
        "desc_split": "A seafood supplier delivers fresh sashimi-grade fish to sushi restaurants with strict time windows to maintain freshness. After the seafood is used, the supplier collects empty ice boxes and packaging for reuse. Vehicles must first complete deliveries (linehaul) before pickups (backhaul), ensuring capacity limits are not exceeded. The goal is to plan routes that respect time windows, prevent overloading, and minimize travel costs while adhering to the delivery-first sequence.",
        "label": "vrpbtw",
        "index": 68
    },
    {
        "desc_split": "A furniture retailer offers a \"trade-in\" service where customers receive new furniture deliveries and simultaneously return old items for recycling. Delivery trucks (<capacity>) start at a warehouse (<loc_depot>), first delivering new furniture to homes (<loc_customer>), then collecting the old pieces. The vehicles must prioritize deliveries to avoid overloading before pickups. Each route’s total distance must not exceed (<distance_limit>), ensuring efficient fuel use and same-day return to the depot for reloading.",
        "label": "vrpbl",
        "index": 6
    },
    {
        "desc_split": "A research team coordinates field operations where trucks depart from a base camp (<loc_depot>) to deliver excavation tools (<demand_linehaul>) to dig sites (<loc_customer>) and retrieve artifacts/soil samples (<demand_backhaul>). Vehicles have fragile-item weight limits (<capacity>) and must stay within a fuel-efficient range (<distance_limit>) due to remote terrain. Routes terminate at the last site to reduce environmental impact. Optimizing mixed sequences (e.g., delivering shovels before collecting pottery shards) is critical.",
        "label": "ovrpmbl",
        "index": 81
    },
    {
        "desc_split": "An adventure sports company rents kayaks, climbing gear, and camping equipment to remote trailheads (<loc_customer>). Their delivery trucks first transport all rented items (linehaul) to outdoor activity sites, then return later to collect the returned gear (backhaul). The route must respect the truck’s <capacity> kg limit, deliver before picking up, and conclude at the last equipment collection point.",
        "label": "ovrpb",
        "index": 29
    },
    {
        "desc_split": "Medical NGOs deliver life-saving supplies to isolated jungle clinics using lightweight helicopters. Each helicopter has a strict weight capacity (<capacity> kg) for medical kits, vaccines, and equipment, and cannot exceed a flight distance limit (<distance_limit> km) due to fuel and safety regulations. Pilots chart routes to visit multiple clinics without returning to base, prioritizing critical deliveries while ensuring the helicopter’s payload never overloads and total flight distance stays within operational limits.",
        "label": "ovrpl",
        "index": 72
    },
    {
        "desc_split": "A cooperative transports fresh produce from farms to farmers' markets using refrigerated trucks. The market locations are <locs>, each requiring a specific quantity <demand> of goods. Markets operate within strict time windows <time_windows> to ensure produce freshness, with unloading taking <service_time> minutes. Each truck has a refrigeration capacity of <capacity> kg and travels at <speed> km/h. The goal is to minimize total distance while ensuring all deliveries occur within market operating hours and without overloading trucks.",
        "label": "vrptw",
        "index": 5
    },
    {
        "desc_split": "A construction firm delivers pre-fabricated building modules (linehaul) to construction sites and collects scrap materials (backhaul). Trucks depart from the fabrication yard (<loc_depot>), first transporting modules (<demand> m³) to active sites (<loc_customer>). After delivery, they gather scrap metal and waste (backhaul) for recycling. Capacity constraints (<capacity>) prevent overloading. Routes end at the final collection point (open-ended). Time windows (<time_windows>) align with site work hours, and distance limits (<distance_limit>) ensure crews stay within a service radius to avoid delays.",
        "label": "ovrpbltw",
        "index": 34
    },
    {
        "desc_split": "A renewable energy company operates offshore wind farms and must deliver maintenance supplies (e.g., lubricants, turbine blades, and electrical components) from a coastal depot to each turbine site. Each wind turbine requires specific parts, and the delivery vessels have limited cargo space. Routes must be planned to service all turbines efficiently, ensuring no vessel exceeds its capacity, while minimizing fuel consumption and operational costs. The challenge includes navigating marine routes and reaching remote offshore locations.",
        "label": "cvrp",
        "index": 81
    },
    {
        "desc_split": "A medical lab dispatches vehicles to deliver testing equipment (linehaul) to hospitals within strict time windows (TW) for urgent diagnostics. After sample collection, vehicles return with biohazardous specimens (backhaul) for analysis. Each vehicle (C) must complete deliveries before pickups, operate within daily distance limits (L) to avoid delays, and end routes at the last hospital (O) to streamline workflow.",
        "label": "ovrpbltw",
        "index": 59
    },
    {
        "desc_split": "A municipal arborist team manages tree planting (deliveries) and diseased tree removal (pickups) across city neighborhoods (<loc_customer>). Each job has a time window (<time_windows>) based on resident availability and permits, with service durations (<service_time>). Vehicles (<capacity>) carry saplings and removal equipment, sequencing tasks flexibly (mixed backhauls). Routes are constrained by daily shift durations (<distance_limit>), and crews finish at their last job site (open routes).",
        "label": "ovrpmbltw",
        "index": 41
    },
    {
        "desc_split": "A municipal waste management company operates trucks to collect household waste (linehaul) and pick up recyclables (backhaul) from designated bins across the city. Each truck (capacity: `<capacity>`) starts at the depot (`<loc_depot>`) and must visit `<num_customer>` locations (`<loc_customer>`), where each stop has either waste to collect (`<demand_linehaul>`) or recyclables to pick up (`<demand_backhaul>`). Mixed sequencing is allowed (e.g., a truck can alternate between waste and recycling stops). Routes must respect:  \n- **Time windows** (`<time_windows>`): Bins are only accessible during specific hours (e.g., 7 AM–10 AM).  \n- **Distance limits** (`<distance_limit>`): Trucks must finish their route within fuel constraints.  \n- **Open routes**: Trucks end their shift at the final stop (e.g., a recycling center).  \n*Goal*: Minimize total travel distance while ensuring all bins are serviced on time.",
        "label": "ovrpmbltw",
        "index": 0
    },
    {
        "desc_split": "A tech firm deploys environmental sensors (linehaul) to farms to monitor crop health and later retrieves data storage modules (backhaul). Farmers require sensor installation during daylight hours (8 AM-5 PM) and data retrieval within 24 hours to prevent data overflow. Each sensor has a weight/dimensions limit, and retrieval modules must be collected after deployment. The firm’s vans have a capacity constraint, and routes must conclude at the final farm to optimize fuel use.",
        "label": "ovrpbtw",
        "index": 71
    },
    {
        "desc_split": "A lunar logistics company must transport modular components to construction sites (<demand_linehaul>) and collect space debris (<demand_backhaul>) across the Moon’s surface (<loc_customer>). Rovers (capacity <capacity>) launch from a base (<loc_depot>) and can freely mix tasks (MB). Limited battery life restricts each route to <distance_limit> km. The challenge is to optimize paths while respecting capacity and range limits in a low-gravity environment.",
        "label": "vrpmbl",
        "index": 54
    },
    {
        "desc_split": "A cooperative of strawberry farmers needs timely pickup of their harvest from rural farms (<loc_customer>). Each farm specifies a 2-hour (<time_windows>) window for collection to ensure berries are picked at optimal ripeness. The refrigerated trucks (<capacity>) have limited space and must complete their routes within a <distance_limit> to maintain cold-chain integrity. Drivers finalize their day at the furthest farm, where crates are transferred to overnight storage, avoiding depot returns to maximize daily harvest efficiency.",
        "label": "ovrpltw",
        "index": 18
    },
    {
        "desc_split": "A city parks department plants new trees (<demand_linehaul>) and removes diseased ones (<demand_backhaul>) using trucks (<capacity>) from a nursery (<loc_depot>). Challenges:  \n- Planting and removal stops can be interleaved (e.g., remove a tree at Park X before planting at Park Y).  \n- Soil/wood debris must not exceed truck weight limits.  \n- Routes are capped at <distance_limit> km to align with work shifts.",
        "label": "vrpmbl",
        "index": 27
    },
    {
        "desc_split": "A public health team deploys mobile testing units to communities (<loc_customer>) while simultaneously redistributing excess PPE (masks, sanitizers) from overstocked sites. Vehicles (capacity <capacity>) depart from a central hub (<loc_depot>) and must arrive at each location within assigned time slots (<time_windows>). Testing (delivery) and PPE collection (pickup) can be interleaved. Routes terminate at the final stop.",
        "label": "ovrpmbtw",
        "index": 97
    },
    {
        "desc_split": "A utility company must restore power lines (C) across a storm-ravaged region, with repair crews required to reach sites (TW) before local curfews or daylight ends. Each service truck carries limited supplies (C) and must return to the depot (L) before dusk for safety. The challenge is to prioritize routes to meet critical infrastructure deadlines while ensuring crews do not exceed daily driving limits or overload their material capacity.",
        "label": "vrpltw",
        "index": 43
    },
    {
        "desc_split": "A fish farming operation services <num_customer> sea cages (<loc_customer>) from a coastal depot (<loc_depot>) using boats (capacity <capacity>). Routes combine delivering feed (<demand_linehaul>) and collecting mature fish (<demand_backhaul>), constrained by tidal time windows (<time_windows>) and maximum range (<distance_limit> nautical miles). Mixed sequencing allows prioritizing hungry cages or ripe harvests based on real-time biomass sensors.",
        "label": "vrpmbltw",
        "index": 93
    },
    {
        "desc_split": "A construction equipment supplier must deliver machinery like excavators and bulldozers to active job sites while also collecting scrap metal from completed projects for recycling. Each truck must deliver all equipment first before returning to collect scrap metal, as per safety regulations. The total weight of delivered machinery plus collected scrap must stay within the truck’s capacity <capacity>. The depot location and 20 job sites are mapped out, with specific delivery demands <demand_linehaul> and scrap pickup amounts <demand_backhaul>. The challenge is routing trucks efficiently to minimize fuel use and ensure no overloaded vehicles, while balancing the need to service active sites and reclaim materials.",
        "label": "vrpb",
        "index": 25
    },
    {
        "desc_split": "A tech company is deploying prefabricated modular data center units to remote locations for expanding cloud infrastructure. Each unit weighs <demand> tons and must be transported via specialized trucks (<capacity> ton capacity) from the central manufacturing facility (<loc_depot>). The logistics team must plan routes to deliver all <num_customer> modules (<loc_customer>) to isolated sites, ensuring no truck exceeds its maximum load while optimizing travel distance to reduce delivery time and costs.",
        "label": "cvrp",
        "index": 94
    },
    {
        "desc_split": "A logistics firm serves urban vertical farms by delivering liquid nutrients and collecting harvested produce. Trucks (capacity: `<capacity>` liters/kg) start at a distribution center (`<loc_depot>`) and visit `<num_customer>` farms (`<loc_customer>`), where some require nutrient deliveries (`<demand_linehaul>`) and others have harvests ready for pickup (`<demand_backhaul>`). Routes must accommodate mixed sequences (e.g., delivering to Farm X before collecting from Farm Y) and adhere to a maximum route distance (`<distance_limit>`) to preserve produce freshness. The aim is to optimize routes for minimal travel while respecting capacity and distance limits.",
        "label": "vrpmbl",
        "index": 77
    },
    {
        "desc_split": "A high-end furniture rental company services luxury hotels and event spaces. Deliveries must occur during the client’s specified time windows for setup, while pickups are scheduled after the rental period ends. Each truck’s capacity must accommodate both outbound furniture (linehaul) and inbound returns (backhaul), with strict sequencing: returns can only occur after all deliveries on a route are finalized. Time windows are enforced to avoid disrupting client operations, and late pickups incur penalties.",
        "label": "vrpbtw",
        "index": 43
    },
    {
        "desc_split": "Your company delivers oxygen, nitrogen, and other gas cylinders to factories and hospitals from the central depot (<loc_depot>). Each delivery truck can only carry up to <capacity> cylinders. Each customer site (<loc_customer>) requires a certain number of cylinders (demand <demand>). The challenge is to design routes that:  \n- Never overload any truck beyond its capacity.  \n- Let drivers end their day at the final delivery location.  \n- Reduce total travel distance to save fuel and time while meeting all orders.",
        "label": "ovrp",
        "index": 11
    },
    {
        "desc_split": "A furniture rental company services urban clients (<loc_customer>) from a warehouse (<loc_depot>) using trucks with limited cargo space (<capacity>). Each stop involves either delivering new furniture (linehaul) or collecting expired rentals (backhaul), with mixed sequencing allowed. Installation teams have fixed time windows (<time_windows>) at each location based on customer availability, and each service takes a predetermined time (<service_time>). Routes must be completed within driver shift limits (<time_limit>). The objective is to minimize operational costs while meeting all scheduling commitments.",
        "label": "ovrpmbltw",
        "index": 76
    },
    {
        "desc_split": "A farm cooperative supplies livestock feed to farmers and collects manure waste for composting. Delivery trucks start from a central depot, first delivering feed (linehaul) to farms based on their demand, then collecting manure (backhaul) during the return trip. Each truck’s capacity is constrained by weight limits for feed bags and manure bins. Routes must not exceed 120km to accommodate rural terrain and ensure timely service. The goal is to optimize routes so farmers receive their feed efficiently while manure is collected without overloading trucks or exceeding distance restrictions.",
        "label": "vrpbl",
        "index": 11
    },
    {
        "desc_split": "Renewable energy companies need to deliver wind turbine components to isolated islands. Boats depart a mainland depot (<loc_depot>), carrying heavy machinery parts (<capacity> ton). Each island requires specific component sets (<demand>). To avoid mid-journey refueling, boat routes must stay under <distance_limit> nautical miles. After unloading at the final island, crews remain there to assist with installation, ensuring efficient logistics without return voyages across open seas.",
        "label": "ovrpl",
        "index": 34
    },
    {
        "desc_split": "A transportation authority needs to install temporary road signs and traffic barriers (<demand>) at 50+ construction zones (<loc_customer>) across a city. Equipment is stored at a central depot (<loc_depot>), and each truck has a maximum load capacity (<capacity>). The task is to plan routes that ensure no vehicle overloads, all sites are equipped, and drivers finish their routes at the last location to reduce redundant travel and costs.",
        "label": "ovrp",
        "index": 64
    },
    {
        "desc_split": "Technicians service chip fabrication labs (<loc_customer>) delivering purified gases (<demand_linehaul>) while retrieving contaminated canisters (<demand_backhaul>). Specialty trucks (<capacity>) operate from purification plants (<loc_depot>) with radiation-safe distance limits (<distance_limit>). Routes must dynamically mix deliveries and hazardous pickups based on real-time lab alerts, with vehicles remaining at final sites for decontamination.",
        "label": "ovrpmbl",
        "index": 99
    },
    {
        "desc_split": "Medical supplies must be delivered to isolated Arctic research stations. Snowmobiles (capacity) carry kits (demand in weight) from a depot to each station. Due to extreme cold, each snowmobile has a maximum allowable travel distance (L) to avoid breakdowns. After the last delivery, the snowmobile remains at that station (open route). The goal is to minimize total distance while ensuring supply delivery.",
        "label": "ovrpl",
        "index": 83
    },
    {
        "desc_split": "A biotech firm coordinates time-sensitive transport of lab specimens (pickups) and experimental medications (deliveries) between research hospitals. Each hospital `<loc_customer>` has strict time windows `<time_windows>` for specimen collection (to preserve sample integrity) and medication delivery (to align with patient schedules). Vehicles with refrigeration capacity `<capacity>` and fuel range `<distance_limit>` must dynamically interleave pickups and deliveries (e.g., dropping off medication at Hospital A before collecting specimens from nearby Hospital B) without exceeding cold-storage limits or violating time windows.",
        "label": "vrpmbltw",
        "index": 96
    },
    {
        "desc_split": "A pharmacy (<loc_depot>) provides doorstep delivery of life-sustaining medications to homebound patients. Each patient (<loc_customer>) has a critical time window (<time_windows>) for delivery (e.g., before their morning medication routine). Delivery vans can carry only <capacity> prescriptions at a time due to refrigeration constraints. Drivers must complete all deliveries and return to the pharmacy within a <distance_limit> mile radius before closing time to comply with shift regulations. The goal is to optimize routes to minimize delays while respecting strict time and capacity limits.",
        "label": "vrpltw",
        "index": 12
    },
    {
        "desc_split": "A research team uses vessels to deploy sensors (<demand_linehaul>) at oceanic sites (<loc_customer>) and retrieve malfunctioning equipment (<demand_backhaul>). Vessels depart from a coastal base (<loc_depot>) with a cargo hold capacity of <capacity> tons. Due to fuel limits, each route must stay under <distance_limit> nautical miles. Sensor deployments and equipment pickups can occur in any order.",
        "label": "vrpmbl",
        "index": 16
    },
    {
        "desc_split": "A renewable energy company must service offshore wind turbines located in the North Sea. The service vessels depart from a central harbor depot (<loc_depot>) and must inspect and maintain turbines at <loc_customer> locations. Each vessel has a cargo capacity of <capacity> kg for spare parts and equipment. Due to fuel and operational safety constraints, each vessel’s round-trip journey must not exceed <distance_limit> nautical miles. Each turbine requires specific quantities of parts. Plan routes to service all turbines without exceeding capacity or distance limits, minimizing total travel distance.",
        "label": "vrpl",
        "index": 20
    },
    {
        "desc_split": "A coastal logistics firm supplies essential goods to remote islands. Each island (<loc_customer>) demands a specific volume of supplies (<demand>). Boats (<capacity> cubic meters) must adhere to a maximum travel distance (<distance_limit> nautical miles) to avoid dangerous open-sea navigation. Routes start from the mainland depot (<loc_depot>), ending at the furthest island without return journeys, ensuring cargo capacity and safety constraints are met while reaching all communities.",
        "label": "ovrpl",
        "index": 8
    },
    {
        "desc_split": "A catering company must deliver perishable food, linens, and equipment to event venues for weddings, corporate galas, and festivals. Each event has a strict setup window (e.g., 1 hour before the event starts) to ensure timely service. Trucks leave a central kitchen (<loc_depot>), each with a refrigerated capacity of <capacity> cubic meters. The challenge is to route deliveries so all venues receive their supplies within their time windows, without overpacking trucks. Drivers conclude their shifts at the final venue, avoiding return trips to the depot.",
        "label": "ovrptw",
        "index": 17
    },
    {
        "desc_split": "A health NGO operates mobile clinics to administer vaccines (deliveries) and conduct health surveys (pickups of completed forms) in underserved neighborhoods. Vehicles start at a storage hub (<loc_depot>) with cold-chain capacity (<capacity>). Clinics at (<loc_customer>) have strict operating hours (<time_windows>). Teams can interleave vaccine delivery and survey collection, ending shifts at the final location. The goal is to maximize coverage while respecting vehicle capacity and clinic time constraints.",
        "label": "ovrpmbtw",
        "index": 68
    },
    {
        "desc_split": "A disaster response team uses drones to deliver critical medical supplies to stranded communities (<loc_customer>) after an earthquake. Drones depart from a central aid depot (<loc_depot>), carrying a maximum payload of <capacity> kg. Each delivery must arrive within a 2-hour time window (<time_windows>) to coincide with on-ground medics’ shifts. Due to battery constraints, drones cannot exceed a round-trip distance of <distance_limit> km. The team must optimize routes to maximize coverage while ensuring drones return safely for recharging and reloading.",
        "label": "vrpltw",
        "index": 77
    },
    {
        "desc_split": "A luxury logistics firm transports fragile wine crates between cellars and auction venues. Each venue’s location is in <locs>, with demands <demand> (number of crates). Venues enforce <time_windows> to align with auction schedules, while service time <service_time> includes climate checks. Vehicles have a capacity <capacity> restricted by crate dimensions and temperature control systems. The objective is to minimize travel distance while maintaining climate conditions and respecting time windows.",
        "label": "vrptw",
        "index": 73
    },
    {
        "desc_split": "A catering service transports cooking gear, tables, and utensils to event venues and later collects all items after the event. Each truck must first deliver supplies to venues before returning to retrieve used equipment. The challenge is optimizing routes to keep total loads under truck capacities. The depot and event sites are located at <locs>, with catering equipment delivery demands <demand_linehaul> and return pickups <demand_backhaul>. Each truck has a capacity of <capacity>, requiring careful coordination between delivery and pickup phases.",
        "label": "vrpb",
        "index": 69
    },
    {
        "desc_split": "A telecom firm deploys new satellite dishes to rural areas and retrieves outdated equipment for recycling. Each location at <loc_customer> requires new hardware (<demand_linehaul>) and has obsolete gear (<demand_backhaul>). Delivery trucks must first install the new equipment before collecting old parts, respecting <capacity> limits. Routes must not exceed <distance_limit> for fuel efficiency, ending at the final installation site without returning to the depot.",
        "label": "ovrpbl",
        "index": 89
    },
    {
        "desc_split": "A furniture rental company services pop-up offices and events across a city. Trucks (<capacity>) depart from a warehouse (<loc_depot>) to deliver rented items (linehaul) and collect expired rentals (backhaul) in mixed sequences (MB). Each client specifies a 2-hour installation window (<time_windows>), and routes cannot exceed 8 hours (<distance_limit>) due to driver shifts. Vehicles remain at the final job site (O) for overnight parking. The challenge is to balance delivery/pickup loads while adhering to tight installation schedules and route duration constraints.",
        "label": "ovrpmbltw",
        "index": 46
    },
    {
        "desc_split": "A winery delivers wine bottles to distributors (<loc_customer>) and collects empty barrels from vineyards for reuse. Each delivery has a time window (<time_windows>) tied to shipping schedules, while barrel pickups depend on fermentation timelines. The trucks (<capacity>) must first complete all deliveries (linehaul) before returning to collect barrels (backhaul). Routes are open-ended, ending at the last stop to streamline logistics. Capacity constraints ensure trucks don’t overload with either outbound bottles or inbound barrels.",
        "label": "ovrpbtw",
        "index": 28
    },
    {
        "desc_split": "A smart city operator deploys electric trucks (`<capacity>`) to service IoT-enabled waste bins (`<loc_customer>`). Each bin has:  \n- A time window (`<time_windows>`) based on historical overflow data.  \n- Either waste for collection (`<demand_backhaul>`) or sensor maintenance needs (`<demand_linehaul>`).  \nRoutes must dynamically mix pickups (full bins) and deliveries (replacement sensors/parts), prioritizing bins nearing capacity during morning rush hours. Service times (`<service_time>`) vary for waste compaction vs. sensor repairs.",
        "label": "vrpmbtw",
        "index": 47
    },
    {
        "desc_split": "A scientific research firm delivers lab equipment and supplies to field research sites, then collects contaminated or used materials (e.g., hazardous chemicals, bio samples) for safe disposal. Deliveries must precede pickups to prevent cross-contamination. Each vehicle routes between sites, starting with equipment delivery before handling pickups. Capacity <capacity> limits require balancing the weight of new equipment and returning waste. The depot and research sites are located at <locs>, with delivery demands <demand_linehaul> and contaminated material pickups <demand_backhaul>. The focus is on efficient routing without compromising safety protocols.",
        "label": "vrpb",
        "index": 83
    },
    {
        "desc_split": "A company operates seasonal pop-up markets in city centers, requiring delivery of vendor stalls, generators, and promotional materials to designated zones. Each market site has a setup time window aligned with municipal permits, and vendors demand precise delivery times to avoid delays. After the market concludes, all items must be retrieved and returned to the warehouse, with pickups scheduled *after* deliveries are complete to prevent operational conflicts.",
        "label": "vrpbtw",
        "index": 82
    },
    {
        "desc_split": "A construction logistics firm supplies building materials (linehaul) to active job sites during daytime work hours and schedules waste removal (backhaul) of debris and recyclables after crews finish shifts. Each site has strict time windows for material delivery to avoid halting progress, while waste pickup must occur before evening cleanup. Trucks must first drop off concrete, lumber, or tools (within capacity limits) before returning to collect waste, ensuring no vehicle exceeds weight limits for mixed loads of construction supplies and heavy debris.",
        "label": "vrpbtw",
        "index": 37
    },
    {
        "desc_split": "A scientific team coordinates boat routes to deploy sensors (<demand_linehaul>) at oceanographic sites (<loc_customer>) while retrieving expired instruments (<demand_backhaul>). Vessels (capacity <capacity>) launch from a coastal base (<loc_depot>), with no return required—deliveries and collections are interleaved based on ocean currents and equipment urgency. Capacity constraints account for both heavy sensors and fragile retrieved samples.",
        "label": "ovrpmb",
        "index": 92
    },
    {
        "desc_split": "Your company is contracted to deliver equipment for a series of temporary street fairs across the city. Each event site (<loc_customer>) requires a mix of tents, stages, and booth materials, with varying quantities (<demand>). All deliveries originate from the central storage facility (<loc_depot>). Each delivery truck has a maximum cargo capacity (<capacity> kg) and must ensure the total weight of items assigned to it doesn’t exceed this limit. After unloading at the final destination, drivers end their shift there instead of returning to the depot. The goal is to plan routes that efficiently distribute all equipment without overloading any vehicle while minimizing total travel distance.",
        "label": "ovrp",
        "index": 75
    },
    {
        "desc_split": "A network of rooftop farms (<loc_customer>) receives weekly seedling deliveries (<demand_linehaul>) while returning harvests (<demand_backhaul>) to central kitchens. Electric cargo bikes (<capacity>) operate from a nursery hub (<loc_depot>) with battery-limited ranges (<distance_limit>). Routes must interleave seedling drop-offs and produce pickups based on real-time yield reports, with riders finishing at their last farm without returning to base.",
        "label": "ovrpmbl",
        "index": 97
    },
    {
        "desc_split": "An offshore wind farm’s construction phase requires transporting turbine components to installation vessels. Supply barges (<capacity> ton capacity) depart from the coastal depot at <loc_depot> to drop off parts at wind turbine locations (<loc_customer>). Barges must stay within a <distance_limit> km radius to ensure safe return, but once they unload their final component, they anchor near the last site to await further instructions, ensuring all deliveries are made without exceeding capacity or range limits.",
        "label": "ovrpl",
        "index": 63
    },
    {
        "desc_split": "A ski resort needs to distribute skis, snowboards, and safety gear to mountain lodges (linehaul) before opening hours. After the day’s activities, the resort collects the equipment for maintenance (backhaul). Each lodge has time windows for morning setup and evening pickup. Vehicles must first deliver gear to all locations, then return along the route to collect items, without overloading their capacity (<capacity>). Routes must be planned to avoid delays during peak traffic and ensure the last pickup location is the route’s endpoint.",
        "label": "ovrpbtw",
        "index": 41
    },
    {
        "desc_split": "A courier service handles urgent package deliveries (<demand_linehaul>) and return pickups (<demand_backhaul>). Clients specify strict delivery windows (<time_windows>) for time-sensitive items (e.g., medical samples or electronics), while return pickups must occur after deliveries. Each vehicle (<capacity> kg limit) starts at the hub (<loc_depot>), prioritizes deliveries, then collects returns from the same route without backtracking. The goal is to minimize delays and ensure all stops are serviced within their windows, ending routes at the final customer location.",
        "label": "ovrpbtw",
        "index": 7
    },
    {
        "desc_split": "A sports league operator delivers sports equipment to stadiums before games and collects it post-event. Each venue has strict time windows for setup and teardown. Delivery trucks must first distribute gear (linehaul) to all locations, then return to collect the equipment (backhaul). Capacity constraints limit the number of items per truck, and routes are restricted to a maximum distance to cover multiple venues efficiently. All deliveries must precede game starts, and pickups must align with post-game cleanup schedules.",
        "label": "ovrpbltw",
        "index": 77
    },
    {
        "desc_split": "An electric vehicle (EV) charging network operator needs to replenish fuel cells at <num_customer> remote stations. Starting from the supply center (<loc_depot>), delivery trucks must transport fuel cells (<demand> units) to each station without exceeding their <capacity> unit limit. To prevent mid-route battery depletion, all routes must stay within a <distance_limit> km range. Drivers finish their assignments at the final station, reducing operational overhead.",
        "label": "ovrpl",
        "index": 4
    },
    {
        "desc_split": "A conference organizer must deploy audio-visual equipment to multiple venues before event start times and retrieve it after events conclude. Each venue specifies a delivery time window (before setup) and a pickup window (after the event). Delivery vehicles must first complete all linehaul deliveries (equipment deployment) before executing backhaul pickups (equipment retrieval). Capacity constraints limit the number of equipment units per vehicle, requiring optimized route planning to avoid overloading. Time windows are critical to ensure setups finish before events begin and pickups occur only after venues are vacated.",
        "label": "vrpbtw",
        "index": 55
    },
    {
        "desc_split": "An energy company deploys mobile generators (<capacity>) from a warehouse (<loc_depot>) to outdoor concert venues (<loc_customer>), each with setup/teardown time windows (<time_windows>). Some locations require generator delivery while others need units retrieved post-event, with no fixed sequence. After the last service, trucks park at event sites for future redeployment rather than returning to base.",
        "label": "ovrpmbtw",
        "index": 62
    },
    {
        "desc_split": "A public library system operates a fleet to deliver new books to branch locations and collect returned books and damaged materials for recycling. Each truck must first deliver fresh inventory (linehaul) to libraries before retrieving returned items (backhaul), adhering to vehicle capacity <capacity>. The goal is optimizing routes to reduce fuel use and efficiently manage the book lifecycle. The depot and 20 library branches are located at <locs>, with delivery demands <demand_linehaul> and pickup demands <demand_backhaul>.",
        "label": "vrpb",
        "index": 91
    },
    {
        "desc_split": "A port logistics provider supplies fresh perishables (C) to luxury cruise ships during short docking windows (TW). Delivery trucks must navigate harbor traffic and unload within the ship’s limited time in port. Each vehicle has a daily distance limit (L) to service multiple ships and return before the port’s operational hours end. The solution must optimize routes to meet strict time windows while avoiding overloading trucks or exceeding driver shift constraints.",
        "label": "vrpltw",
        "index": 44
    },
    {
        "desc_split": "A photography service provides equipment (cameras, lighting, tripods) to event venues for live coverage. Deliveries must be completed before pickups to ensure gear is available during the event. Each truck has a capacity limit to avoid overloading. Venues have setup time windows (before the event starts) and pickup deadlines after the event concludes. The challenge is to plan efficient routes that respect time windows and capacity, ending at the final pickup location without returning to the depot.",
        "label": "ovrpbtw",
        "index": 87
    },
    {
        "desc_split": "An art logistics firm transports artworks to galleries (<loc_customer>) for exhibitions and retrieves pieces from closing shows. Fragile items limit vehicle capacity (<capacity>). Galleries impose strict time windows (<time_windows>) for installations/deinstallations. Routes are open (no depot return) to accommodate last-minute venue changes. Balance mixed loads to prevent damage and meet all scheduling constraints.",
        "label": "ovrpmbtw",
        "index": 8
    },
    {
        "desc_split": "A fleet of service vehicles operates in a metropolitan area to replace depleted electric vehicle (EV) batteries with fully charged ones at designated swap stations (<loc_customer>). Each station has both a demand for fresh batteries (<demand_linehaul>) and a supply of depleted ones (<demand_backhaul>). Service trucks (<capacity>) depart from a central depot (<loc_depot>) and must visit stations in any order, ensuring:  \n- Total battery load (fresh + depleted) never exceeds truck capacity  \n- Each route stays within a <distance_limit> km range due to operational shift constraints  \n- All stations receive fresh batteries and have depleted units collected",
        "label": "vrpmbl",
        "index": 60
    },
    {
        "desc_split": "A movie studio dispatches vans (capacity: <capacity>) from its equipment depot (<loc_depot>) to deliver cameras/lights to shooting locations (<loc_customer>) and retrieve rented gear from wrap sites. Time windows (<time_windows>) align with shooting schedules. Vehicles may serve as \"floating warehouses\" after final stops. Optimize routes to minimize idle time between shoots while balancing delivery/pickup loads.",
        "label": "ovrpmbtw",
        "index": 7
    },
    {
        "desc_split": "A university's central warehouse must distribute office supplies to campus departments. Each department has a time window <time_windows> corresponding to their operational hours (e.g., when staff are present), and each delivery requires <service_time> minutes for unloading. Delivery trucks have a capacity <capacity> in kg and travel at <speed> km/h. The goal is to route trucks such that all departments receive supplies within their time windows, without exceeding vehicle capacities, while minimizing the total distance traveled.",
        "label": "vrptw",
        "index": 46
    },
    {
        "desc_split": "A semiconductor manufacturer relies on just-in-time delivery of fragile components (<demand>) to multiple fabrication plants (<loc_customer>). Delivery trucks (<capacity> kg capacity) must depart from a logistics hub (<loc_depot>), adhering to stringent time windows (<time_windows>) to avoid production halts. Routes must also respect <distance_limit> km limits to prevent overheating of climate-controlled cargo compartments.",
        "label": "ovrpltw",
        "index": 82
    },
    {
        "desc_split": "An environmental agency uses drones to deploy air quality sensors across a polluted region (deliveries) and later retrieve data storage modules (backhaul). Drones have a limited payload capacity (<capacity> kg) and must return to the base station within a <distance_limit> km radius to recharge. Sensors must be deployed first to avoid overloading drones during data collection trips.",
        "label": "vrpbl",
        "index": 87
    },
    {
        "desc_split": "A pharmaceutical distributor must deliver fresh medications to pharmacies while collecting expired or returned drugs for safe disposal. Each vehicle must first complete all deliveries (linehaul) before proceeding to collect returned items (backhaul). The trucks have a maximum capacity to carry both outbound and inbound loads. Additionally, each route must stay within a maximum travel distance to ensure timely return to the central depot. The goal is to minimize total distance while adhering to capacity and route length constraints.",
        "label": "vrpbl",
        "index": 20
    },
    {
        "desc_split": "A tech company operates mobile fabrication units that deliver 3D printing materials (<demand_linehaul>) to schools (<loc_customer>) while collecting student prototypes (<demand_backhaul>). Each van (capacity <capacity>) starts at HQ (<loc_depot>), services stops in flexible sequence (MB), and remains at the last school (O). Battery limits enforce maximum route distances <distance_limit> (L).",
        "label": "ovrpmbl",
        "index": 47
    },
    {
        "desc_split": "A healthcare NGO must deliver critical medical supplies to remote clinics in a rugged region. The central warehouse is located at <loc_depot>, and clinics are scattered at <loc_customer> locations. Each clinic requires <demand> kg of medical equipment, while delivery vehicles have a maximum capacity of <capacity> kg. Due to limited fuel and terrain challenges, each vehicle must return to the warehouse within a round-trip distance of <distance_limit> km. Design routes ensuring all clinics receive supplies without overloading trucks or exceeding distance limits.",
        "label": "vrpl",
        "index": 0
    },
    {
        "desc_split": "A food company operates a rotating series of pop-up restaurants in urban locations. Each pop-up venue (<loc_customer>) must receive perishable ingredients (<demand>) by a specific time window (<time_window>) to begin operations. Refrigerated trucks depart from the central kitchen (<loc_depot>), each with a maximum load capacity (<capacity>). The goal is to plan routes ensuring all venues are stocked within their windows while avoiding depot returns after the final delivery, minimizing total travel distance and respecting vehicle capacities.",
        "label": "ovrptw",
        "index": 65
    },
    {
        "desc_split": "A university logistics provider supplies research labs with new equipment while retrieving expired chemicals and hazardous materials for proper disposal. Vehicles must handle both tasks without violating capacity constraints, ensuring safe and efficient handling of sensitive materials.",
        "label": "vrpmb",
        "index": 68
    },
    {
        "desc_split": "After a major earthquake, a telecom provider urgently deploys portable communication towers to isolated regions. Each tower requires specific equipment (<demand>) that must fit within truck capacities (C). Vehicles depart from a disaster response hub (<loc_depot>) and end at the final installation site (O). Routes must stay within distance limits (L) to ensure fuel sufficiency. Critical time windows (TW) are enforced to restore connectivity before nightfall, as darkness halts installation work.",
        "label": "ovrpltw",
        "index": 33
    },
    {
        "desc_split": "A municipal waste management company operates trucks to distribute recycling bins to households (<loc_customer>) while simultaneously collecting filled bins for processing. Each truck starts at the depot (<loc_depot>) with a capacity of <capacity> bins. Deliveries (empty bins) and pickups (full bins) can occur in any order along the route. After the final stop, trucks proceed directly to the recycling plant instead of returning to the depot. The goal is to minimize total distance traveled while ensuring no truck exceeds its capacity during mixed deliveries and collections.",
        "label": "ovrpmb",
        "index": 0
    },
    {
        "desc_split": "During peak seasons, a retail company distributes holiday decorations (e.g., lights, ornaments) to customers (<loc_customer>). After delivery (linehaul), the same vehicles collect old or damaged decorations (<demand_backhaul>) for recycling. The vehicle capacity (<capacity>) must handle both outgoing items and returning recyclables. Routes are structured to finish at the last customer location, ensuring efficient space utilization and eliminating depot returns.",
        "label": "ovrpb",
        "index": 37
    },
    {
        "desc_split": "A network of observatories requires urgent delivery of large, fragile optical lenses to telescope sites. Each site has a critical time window <time_windows> to align with celestial observation schedules. Transport vehicles have a limited capacity <capacity> due to the lenses' weight and size. Locations are <locs>, with demands <demand> (each lens is a single unit), service times <service_time> for installation coordination, and travel at <speed>. Routes must start/end at the central warehouse. The objective is to minimize total travel distance while ensuring lenses arrive within their time windows and without overloading vehicles.",
        "label": "vrptw",
        "index": 80
    },
    {
        "desc_split": "A space agency must transport sensitive satellite components from a logistics hub (<loc_depot>) to a remote launch facility (<loc_customer>). Each component has a strict weight (<demand>) and must arrive within a precise time window (<TW>) to align with orbital launch opportunities. Delivery trucks (<capacity> kg payload limit) cannot return to the depot after deployment. Routes must ensure components reach the launchpad without exceeding vehicle capacity, while adhering to fleeting time windows dictated by celestial mechanics.",
        "label": "ovrptw",
        "index": 95
    },
    {
        "desc_split": "A smart city operator deploys vehicles (capacity <capacity>) to empty waste bins (<demand_backhaul>) and repair IoT sensors (<demand_linehaul>) at locations (<locs>). Time windows (<time_windows>) reflect traffic avoidance policies (e.g., no collections during rush hour). Service times (<service_time>) vary for waste compaction vs. sensor calibration. Routes must dynamically interleave pickups and deliveries based on real-time fill-level alerts.",
        "label": "vrpmbtw",
        "index": 57
    },
    {
        "desc_split": "A logistics company must deliver scientific equipment to remote Antarctic research stations while retrieving environmental samples for analysis. Each station at <loc_customer> requires specific gear (<demand_linehaul>) and has collected specimens (<demand_backhaul>). Vehicles (e.g., cargo planes or snow trucks) have a capacity limit <capacity>, requiring careful planning to ensure deliveries precede pickups. Routes must stay within a maximum travel distance <distance_limit> to conserve fuel and end at the final station without returning to the depot. The challenge is balancing cargo loads and route efficiency in extreme conditions.",
        "label": "ovrpbl",
        "index": 85
    },
    {
        "desc_split": "A healthcare provider operates mobile clinics (capacity: <capacity> test kits/supplies) from a warehouse (<loc_depot>) to conduct tests at community centers (<loc_customer>) and redistribute surplus PPE to underserved clinics. Testing sites have appointment-based time windows (<time_windows>), and vehicles must return within shift limits (<time_limit>). Routes must efficiently combine testing (linehaul) and supply redistribution (backhaul) without exceeding cargo limits.",
        "label": "vrpmbltw",
        "index": 69
    },
    {
        "desc_split": "An appliance retailer’s central warehouse (<loc_depot>) stocks refrigerators to be delivered to <num_customer> retail stores. Each store (<loc_customer>) orders a distinct quantity (<demand> units), but delivery trucks can only hold up to <capacity> units at once. The company seeks to minimize total driving distance while ensuring every store receives its order exactly once. Trucks must not be overloaded, and routes must account for the bulky nature of refrigerators to avoid capacity breaches.",
        "label": "cvrp",
        "index": 13
    },
    {
        "desc_split": "In the aftermath of a natural disaster, your team must deliver potable water tanks and purification systems from the relief hub (<loc_depot>) to affected communities (<loc_customer>). Each location requires a specific number of water units (<demand>), and trucks have a maximum capacity of <capacity> liters. Routes must ensure no vehicle exceeds its limit while covering all sites. After the final delivery, trucks remain at the last destination to assist further, avoiding redundant return trips to the depot.",
        "label": "ovrp",
        "index": 27
    },
    {
        "desc_split": "A movie studio coordinates trucks (<capacity>) to transport filming equipment (<demand_linehaul>) to shooting locations (<loc_customer>) and retrieve used props (<demand_backhaul>). Time windows (<time_windows>) align with tight shooting schedules (e.g., \"Camera A must arrive between 5:30–6:00 AM for sunrise scene\"). Mixed routing allows delivering lights to Location X before picking up costumes from nearby Location Y. Service times (<service_time>) include equipment setup/breakdown. Overloading trucks risks damaging expensive gear.",
        "label": "vrpmbtw",
        "index": 8
    },
    {
        "desc_split": "A construction firm requires delivering building materials—like cement bags, lumber, and bricks—to active job sites (<loc_customer>) from a bulk storage yard (<loc_depot>). Each site demands a specific volume of materials (<demand>), and your trucks have strict payload limits (<capacity>). The challenge is to:  \n✓ Avoid overloading any vehicle beyond its capacity.  \n✓ Plan routes that efficiently cluster nearby sites to reduce idle driving.  \n✓ Allow drivers to conclude their routes at the final site, avoiding depot returns.  \nThis minimizes fuel use and ensures materials reach all sites on schedule.",
        "label": "ovrp",
        "index": 4
    },
    {
        "desc_split": "An automotive supplier delivers new parts to repair shops (<loc_customer>) and collects used parts for recycling. Deliveries must precede pickups to ensure shops receive parts before returning old inventory. Delivery trucks have a limited capacity (<capacity>) for both new and used parts. Each shop has a time window (<time_windows>): deliveries are required by morning hours (e.g., 8:30 AM) to support daily operations, while pickups are scheduled in the afternoon (e.g., 3:00 PM) after repairs are completed. The objective is to design routes that meet all time constraints, avoid overloading vehicles, and ensure pickups follow deliveries to streamline inventory management.",
        "label": "vrpbtw",
        "index": 14
    },
    {
        "desc_split": "An outdoor advertising company services digital billboards (<loc_customer>) by uploading new ads (<demand_linehaul>) and removing malfunctioning display panels (<demand_backhaul>). Technicians with equipment vans (<capacity>) depart from a media hub (<loc_depot>), freely sequencing maintenance tasks. Each route is limited to <distance_limit> km to ensure same-day completion, with crews leaving vehicles at the final billboard site.",
        "label": "ovrpmbl",
        "index": 64
    },
    {
        "desc_split": "Farmers in arid regions depend on your company to deliver drip irrigation systems, sprinklers, and pumps from the supply center (<loc_depot>) to scattered farms (<loc_customer>). Each farm requires a specific number of equipment units (<demand>). Delivery trucks can carry up to <capacity> items. The goal is to design routes that prevent overloading while covering all farms efficiently. Vehicles end their routes at the last farm, ensuring resources are deployed without wasting fuel on backtracking.",
        "label": "ovrp",
        "index": 29
    },
    {
        "desc_split": "A heating and cooling company needs to deliver HVAC units from its distribution center (<loc_depot>) to <num_customer> commercial buildings. Each building (<loc_customer>) has a specific HVAC demand (<demand> units), and delivery trucks have a maximum capacity of <capacity> units. The challenge is to plan efficient routes that serve all buildings without exceeding truck capacities, while also minimizing idle driving time and fuel expenditure. The solution ensures timely installations and optimal resource allocation across the fleet.",
        "label": "cvrp",
        "index": 14
    },
    {
        "desc_split": "A wholesale bakery supplies flour, sugar, and other ingredients to bakeries and collects empty delivery containers for reuse. Each truck has a capacity <capacity> and can visit bakeries in any order to drop off supplies (demand_linehaul) and pick up empty containers (demand_backhaul). The depot and 20 customer sites are located at <locs>. The challenge is optimizing routes so that ingredient deliveries and container pickups are efficiently combined without overloading trucks, ensuring bakeries have supplies while containers are recycled promptly.",
        "label": "vrpmb",
        "index": 48
    },
    {
        "desc_split": "A cooperative delivers fresh produce (demand: <demand_linehaul>) from a central hub (<loc_depot>) to restaurants (<loc_customer>) and retrieves empty crates (<demand_backhaul>) for reuse. Restaurants impose morning delivery windows (<time_windows>) to align with kitchen prep schedules. Vehicles (capacity: <capacity>) must balance crate space for deliveries (e.g., tomatoes) and pickups (empty crates), sequencing stops flexibly (e.g., deliver to Restaurant X, pick up crates at Restaurant Y, then deliver to Z) to avoid spoilage and minimize detours.",
        "label": "vrpmbtw",
        "index": 2
    },
    {
        "desc_split": "A film production company uses trucks to deliver camera gear, lighting equipment, and set materials to various filming locations and later collect the same items after shoots. Each truck has a maximum capacity :math:`Q`, restricting the total weight of deliveries and pickups on the route. The order of deliveries and pickups can be sequenced in any order along the route. The central warehouse and 20 filming locations are at <locs>. Delivery demands for equipment are <demand_linehaul>, and pickup demands for returned gear are <demand_backhaul>. The challenge is to design routes that minimize travel costs while ensuring all equipment is delivered and retrieved without exceeding truck capacities.",
        "label": "vrpmb",
        "index": 70
    },
    {
        "desc_split": "A marine archaeology team deploys submersibles to underwater excavation sites (<loc_customer>) to deliver tools and retrieve ancient artifacts. Each submersible has a maximum capacity (<capacity> kg) for carrying both supplies and artifacts. Supplies (e.g., diving gear, sensors) must be delivered first before collecting artifacts to prevent damage. The submersibles’ battery life restricts their maximum travel distance (<distance_limit> km) from the research vessel (<loc_depot>). The goal is to optimize routes to maximize artifact recovery while adhering to capacity and range limits.",
        "label": "vrpbl",
        "index": 96
    },
    {
        "desc_split": "A construction firm supplies building materials (e.g., cement, steel beams) to active job sites (linehaul) and later collects demolition debris (backhaul) for recycling. Sites operate on tight schedules with time windows for material arrivals and waste pickup. Trucks must deliver materials first, then return to collect debris without overloading. Route distances are capped to meet daily project deadlines and comply with vehicle operational limits.",
        "label": "vrpbltw",
        "index": 8
    }
]